[{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDr. Carrie Esopenko at Rutgers University is conducting an observational research study entitled \"Psychological Symptoms and Coping Strategies in College Student Athletes Following Injury.\"\nThe purpose of the study is to better understand psychological outcomes and coping strategies post-concussion or mild traumatic brain injury.\n\nYou CANNOT participate if you are CURRENTLY participating in Division III or Division I NCAA athletics or, if you are under 18 years of age.\n\nIf you are interested and have 30-45 minutes, click this link and follow the instructions on screen: http://www.esopenkolab.com/psych-symptoms.html\n\nFor questions or concerns, contact the email provided or  show contact info\n\n\nParticipation enters you for a chance to win one of ten $50 Amazon gift cards.    ","title":"Have you ever been diagnosed with a concussion?","url":"https://newyork.craigslist.org/wch/vol/d/have-you-ever-been-diagnosed/6591757886.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI buy many models of cell phones and electronics including:\n\nIphone 5\nIphone 5s\nIphone 5c\nIphone 6 \nIphone 6s\nIphone se\nIphone 7 \nIphone 8\nIphone X\nGalaxy s6\nGalaxy s7\nGalaxy s8\nAND MORE\n\nI travel to you\n\nCall/Text for free quote\n show contact info\n    ","title":"Buying All Used Iphone and Galaxy Devices","url":"https://newyork.craigslist.org/lgi/vnn/d/buying-all-used-iphone-and/6591757274.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are now accepting applications for SPRING  2018 ....\nSPACE IS LIMITED ....\n\nWe are having a special Offer going on for toddler 2years and older \nplease call for more Info . . ..\n\nWe are a new , Innovative Group Day care located in Yonkers, NY\nWe are fully certified and licensed in compliance with the State of NY and OCFS \n\nYOU CAN ALSO CALL THE CHILD CARE COUNSEL OF WESTCHESTER TO FIND OUT MORE INFO ON OUR PROGRAM \n\nWE TAKE CHILD CARE SUBSIDY PROGRAMS .....\n\nServices are available from 7am till 7pm .\nServing from 3months to 12years old\nLate nights and date night are available upon request . \n\nLinda's kids \n62 Burhans Ave \nYonkers NY 10701\n show contact info\n    ","title":"Linda's Kids Group day care  SPECIAL OFFER","url":"https://newyork.craigslist.org/wch/kid/d/lindas-kids-group-day-care/6591711290.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLicensed by NYS health department, CPR and first aid certified. After school program. Planned activities daily, all programs accepted and private, loving and caring staff. All meals included.\ncontact for more info.    ","title":"NOW ENROLLING !! CHILDREN'S CASTLE DAYCARE!!","url":"https://newyork.craigslist.org/brx/kid/d/now-enrolling-childrens/6591756601.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLicensed by NYS health department, CPR and first aid certified. After school program. Planned activities daily, all programs accepted and private, loving and caring staff. All meals included. contact for more info    ","title":"NOW ENROLLING !! CHILDREN'S CASTLE DAYCARE!!","url":"https://newyork.craigslist.org/brx/kid/d/now-enrolling-childrens/6591756336.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLicensed by NYS health department, CPR and first aid certified. After school program. Planned activities daily, all programs accepted and private, loving and caring staff. All meals included.\n contact for more info    ","title":"NOW ENROLLING !! CHILDREN'S CASTLE DAYCARE!!","url":"https://newyork.craigslist.org/brx/kid/d/now-enrolling-childrens/6591756042.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThanks for stopping by!\nWe are (all male) all original band into Pop + Blues + Jazz + Rock.\nWe don't do Hip-Hop/Rap and covers (and not planning to....etc).\nThis audition is for Female lead singer (around 23 y.o. + powerful voice).\n\nImage wise => no racial preferences here, meantime please be in SHAPE.\nThis band is based on Top Quality Musicians (two berklee cats on board).\nPlease don't waste our time IF you write songs/looking for band to sing \nyour material (basically song writers should pass/skip this audition). Band\nis formed by experienced music producer/songwriters (he also provides \nfree room and gear for rehearsals). \n\nIf you work night shifts then probably we won't be able to work with you\n(1. band practices are weeknights 2. also gigs are mostly booked at night).\n\nAttention Pro/Job seeking Session singers => Good luck with your search,\nbut we are not aiming to pay your bills, to be your personal bank ( we are\nband not a bank. we are seeking for EQUAL band mate, not some \"side\nsinger\").\n\nInterested? GREAT!\nNow, it's time to record and capture your image (use your phone...quality is\nnot an issues...it's better to have those low quality files than just saying \"hey,\ni am a singer, let's talk over the phone....\").\n\n\nThink SADE, PRETENDERS, BILLY HOLIDAY, AMY WINEHOUSE....etc.\n\nThanks\n\n    ","title":"Female Singer Needed +++ Girl Lead Singer Needed (please check our ad)","url":"https://newyork.craigslist.org/mnh/muc/d/female-singer-needed-girl/6582829145.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI am looking to lift together. Let me know if you have weight bench and weights as part of setup in your apartment, basement, or garage. Evenings are best.    ","title":"Gym workout and equipment","url":"https://newyork.craigslist.org/mnh/act/d/gym-workout-and-equipment/6598921369.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHow's those family values?\n\n\n\nWasn't Hillary was supposed to be in jail. What happened?\n\nAre you still wearing your Lock Her Up T-shirt..\n\n\nScroll down and you'll see all the idiots trying to have the upper hand on the other idiots.\n\nCons think they have the upper hand on Libs.\n\nLibs think they have the upper hand on Cons.\n\nIt's funny how they post the same nonsense every other hour.\n\nThe funny thing is that they think their point is the correct one.\n\nWhat would these idiots do without CL?\n\n\nHey Cons. \n\nWasn't your leader was going to fix everything so fast that was going to make your head spin.\n\nHow's the wall going?\n\n\n\nHow was the NFL boycott?\n\n\n\nHow's the Hillary investigation going?\n\nWhat happened to no more government spending?\n\nI guessed it takes a whole day to respond to a shooting...\n\n\n\nYou idiots have no choice but to say he's doing a good job.\n\nHa, Ha, Ha...\n\nGo ahead and reply that I'm a liberal.\n\nThat's all you have. Keep posting over and over like the losers you losers are.\n\nIt's just funny how you losers reply thinking that what you write it's important.\n\n\n\nLOSERS....\n\nKeep repeating like robots...\n\nIt's a good thing your leader recommended that they should have a rating system for movies. Isn't he a genius..\n\n\nAren't you glad you have a leader who will protect you by going after the shooter..\n\nWasn't he supposed to destroy Rocket Man?\n\nAre you tired of reading this post?\n\nIt will appear over and over like the other dumb post.\n\nMission accomplished..\n\n    ","title":"REMEMBER WHEN JESUS SAID IT'S OK TO FUCK PORN STARS WHEN UR MARRIED?","url":"https://newyork.craigslist.org/mnh/pol/d/remember-when-jesus-said-its/6599423536.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNeed a safe, trustworthy nanny or babysitter who can come your house? We have tons of excellent nannies and babysitters looking for jobs near you. Do a free search today and find the perfect nanny in no time!Brooklyn, Queens and the surrounding areas book at http://nannynewyorkcity.com    ","title":"Great nanny can start right away!","url":"https://newyork.craigslist.org/mnh/kid/d/great-nanny-can-start-right/6586874408.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSearching for the perfect nanny and having a hard time? We make it extremely easy to find qualified, reliable nannies in a jiffy! Search our nanny and babysitters for free and only sign up if you see matches.New York's finest nanny service taking care of your children http://nannymanhattan.com    ","title":"Full or part time nanny services available","url":"https://newyork.craigslist.org/mnh/kid/d/full-or-part-time-nanny/6586867585.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIf you are a middle-level Executive or Senior Executive we have good news for you and your friends! London School of Management & Research has a practice-led MBA and PhD programme for experienced people in middle-level management and above like you, your cohorts and colleagues. We want you to turn your professional experience into your dream qualification. You do not have to leave your job; you will also have the opportunity to attend international course\n\n\n \n\nMoneyMakingMachine.Host\t \n    ","title":"STUDY IN LONDON SCHOOL OF MANAGEMENT & RESEARCH","url":"https://newyork.craigslist.org/stn/pol/d/study-in-london-school-of/6580340825.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIf you are a middle-level Executive or Senior Executive we have good news for you and your friends! London School of Management & Research has a practice-led MBA and PhD programme for experienced people in middle-level management and above like you, your cohorts and colleagues. We want you to turn your professional experience into your dream qualification. You do not have to leave your job; you will also have the opportunity to attend international course\n\n\n \n\nMoneyMakingMachine.Host\t \n    ","title":"STUDY IN LONDON SCHOOL OF MANAGEMENT & RESEARCH","url":"https://newyork.craigslist.org/stn/pol/d/study-in-london-school-of/6580340817.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIf you are a middle-level Executive or Senior Executive we have good news for you and your friends! London School of Management & Research has a practice-led MBA and PhD programme for experienced people in middle-level management and above like you, your cohorts and colleagues. We want you to turn your professional experience into your dream qualification. You do not have to leave your job; you will also have the opportunity to attend international course\n\n\n \n\n Love-One.BestSurveys.Online \n\n     ","title":"STUDY IN LONDON SCHOOL OF MANAGEMENT & RESEARCH","url":"https://newyork.craigslist.org/stn/pol/d/study-in-london-school-of/6580340830.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n11 For I know the plans I have for you,\" says the Eternal, \"plans for peace, not evil, to give you a future and hope--never forget that.  12 At that time, you will call out for Me, and I will hear. You will pray, and I will listen.  13 You will look for Me intently, and you will find Me. Jeremiah 29:11-13 The Voice (VOICE)  \n\nhttps://onecrownz.blogspot.com/2017/12/activate-your-masterpiece.html\n\nhttps://www.books2read.com/b/myloveisone \n\n\n #MyLOVEisONE    ","title":"\"Plans for Peace, not evil, to give you a Future and Hope\"","url":"https://newyork.craigslist.org/fct/com/d/plans-for-peace-not-evil-to/6597502170.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSe Habla Espanol\nGet your  child spot reserve today!!!\n2018\n\nHello Parents:\n\nI am a licensed childcare provider with the Dept. of Health for 15 years.  I take care of children from ages 2 months - up to 5 years old.     I have 2 spots open for ages 2 monthss - up to 5 years old,  I am not accepting after school (5-12 years old).  I am in the food program so all meals are free except Formula.  I have other certificates in Shaken Baby Syndrome, Sudden Infant Death, and Child Abuse & Maltreatment.  I am also CPR and First Aid Certified.\n\nI accept HRA, ACD, ACS, and Private (cash), will give receipts with every payment and I do have a tax identification number for your taxes.  I also have HRA vouchers to take to your worker.\n\nI open all shifts, just tell me what days and hours you need care for...we can negotiate.\nI open at 5:00 am-until at times 9:00pm. I can open earlier if needed...just ask me.  (Please do NOT call for just Saturday care, your child must be in my care at least 3 days out of the week) and the child cannot start on Saturday.\n\n\nThis is NOT a 24 hour daycare, and I am NOT hiring!!!! No ESTOY BUSCANDO ALLUDA!!!!!\n\nThe new market rate for childcare went up June 1, 2016...you can find it on the UFT website.\n\nI live across from Lincoln Hospital and the #32 bus stops in front of this building.  Other transportation are the #2, #4, #5, trains to E. 149th st and Grand Concourse , #6 train to E. 138th steet 3rd Ave., and #21bus, #19Bus at E. 143rd & Third ave. or E. 149th St. Morris Ave.\n\nIf you're interested, please feel free to call me at  show contact info\n (This Is not a cell) Home ask for Ms. Arlene,  I can give you full address on day of interview, I will not post my address on Craigslist.\n\nI have contracts and paper work for us to sign.\nHablo Espanol\n\nThank You\nMs. Arlene 2018    ","title":"LICENSED PROVIDER/PROVEDORA CON LICENSIA/INCLUDING SATURDAYS","url":"https://newyork.craigslist.org/brx/kid/d/licensed-provider-provedora/6583387168.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi Parents,\n\nI am a Licensed Childcare Provider with the Dept. of Health for 15 years taking care of 6 children in my home from ages 6 weeks - 12 years old.   I have 2 spots available for children ages 2 months - up to 5 years old.  (I am not taking after school 5 - 12).  I am a mature lady with experience with my own 3 grown children and 7 grandkids (including Twins).   I have certificates in Shaken Baby Syndrome, Sudden Infant Death, Child Abuse & Maltreatment and CPR and First Aid certified.\n\nIf you're interested, please feel free to contact me at  show contact info\n (NOT A CELL PHONE NUMBER) ask for Ms. Arlene.   I live across from Lincoln Hospital and the #32 bus stops in front of this building.  I accept HRA/ACD/ACS and Private (cash)\n\nI work all shifts starting at 5:00 a.m.(I could open earlier if needed) till about 9:00 p.m. for working parents Monday - Saturday. You're child/ren will NOT start on Saturday, and they must be in my care at least 3 days a week.\n\nI give out receipts and contracts and I have a tax ID for the end of year taxes.  I speak English and Spanish.\nI am NOT hiring and this is NOT a 24 hour day care.\n\nSe Habla Espanol\nGracias\nThank You\nMs. Arlene\n2018    ","title":"LICENSED PROVIDER/PROVEDORA CON LICENSIA/INCLUDING SATURDAYS","url":"https://newyork.craigslist.org/brx/kid/d/licensed-provider-provedora/6597993051.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\n\nI am a expert childcare provider today Loving Caregiver/Nanny right to your house These nanny in your city Our staff makes finding nannies ez Babysitter professionals\n    ","title":"Exceptional Nanny/Babysitter Can Start Now","url":"https://newyork.craigslist.org/jsy/kid/d/exceptional-nanny-babysitter/6596376923.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe female Bengal twin sisters around 2 years old are in greater New York area. Original owner bought it from a breeder for $$$$ but unfortunately has to move to another country. The only requirement for the new owner is to live in a house with yard instead of an apartment no matter how large it is. Small adoption fee for the cats and all their toys, trees, scratching boards, litter boxes and food.    ","title":"Bengal kitties looking for a new home","url":"https://newyork.craigslist.org/mnh/pet/d/bengal-kitties-looking-for/6601342761.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\nHire a ideal caregiver/nanny Immediately Caring caregivers in your town Oour youngster care at our company We make staffing baby sitters easy caregiver pros\n    ","title":"#1 Babysitter/Nanny Available","url":"https://newyork.craigslist.org/que/kid/d/1-babysitter-nanny-available/6596374917.html"}]
