[{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is a long shot but hope you see this.  You were having dinner with a friend last night in Chelsea. You smiled at me when you said excuse me. I couldn't take my eyes off you.  I would like to take you out to dinner.\n\nYou-late 30's/early 40's, long brown hair, beautiful eyes and smile\n\nTell me what restaurant and why you said excuse me.    ","title":"Woman with long hair in Chelsea","url":"https://newyork.craigslist.org/mnh/mis/d/woman-with-long-hair-in/6601282486.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey guys I am looking for a guy to hang with in Dougan Hills Mildand Beach Area. I am into all types of men and looking to hang out now. Email me for more info Gay man here btm. Hit me up with a pic .\nLooking for now    ","title":"Looking to hang Out","url":"https://newyork.craigslist.org/stn/mis/d/looking-to-hang-out/6601354216.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI saw your message...it certainly applies to me and what happened b/w us. If it was meant for me, can you give a specific detail so I know it's you? Thank you, I appreciate it! \n\nPS Why did you take you post down?    ","title":"Re: APOLOGY","url":"https://newyork.craigslist.org/lgi/mis/d/re-apology/6601423341.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is a long shot but hope you see it. You were having dinner with a friend last night in Chelsea. You smiled at me when you said excuse me. I couldn't take my eyes off you. I would like to take you out to dinner.\n\nYou-late 30's/early 40's, long brown hair, beautiful eyes and smile\n\nTell me what restaurant and why you said excuse me.    ","title":"Long brown hair","url":"https://newyork.craigslist.org/mnh/mis/d/long-brown-hair/6601422736.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI See You On A Regular Basis Getting Your Morning Coffee At Donut D on Hope St.\nYou Are My Man Crush.\nM4M    ","title":"I See You Every Morning On Hope St","url":"https://newyork.craigslist.org/fct/mis/d/see-you-every-morning-on-hope/6601365699.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nlooking for older white bottom dads in chelsea today for dad/son fun.\npreppy white cute slim boyish type here..email back your age stats size tool pic etc    ","title":"Older white bottom dads-chelsea today","url":"https://newyork.craigslist.org/mnh/mis/d/older-white-bottom-dads/6601355401.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nBuying flowers this morning for my mom, and you were working in the shop.\nYou thought I looked familiar, and I thought our eyes connected. \nYou are very pretty, and I'd like to buy you a drink sometime.    ","title":"Latina in flower shop","url":"https://newyork.craigslist.org/lgi/mis/d/latina-in-flower-shop/6587972825.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nU were a waiter at the Oconee East Diner. I am the older guy. You were very friendly and especially when you tried to pass by me rubbing your crotch against my backside. We both smiled and it looked like you were excited. You provided good service, I would like to reciprocate.    ","title":"Checking each other out","url":"https://newyork.craigslist.org/lgi/mis/d/checking-each-other-out/6601344991.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey,\n\nI doubt you'll see this, but I just saw a message from a username tenmanten on adam4adam from a few weeks ago, and when I went to reply, your profile was deleted.\n\nMy apologies, I don't go on the site often, but yes, I'm likely who you thought I was as your couple questions about what I do were correct.\n\nSorry to have missed your message at the time. If you see this, drop a line and let's chat.    ","title":"tenmanten on adam4adam - m4m","url":"https://newyork.craigslist.org/mnh/mis/d/tenmanten-on-adam4adam-m4m/6601341786.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nMissing you lovely girl! We had some nice conversation on the bus and train. Get in touch if you remember me!\n\n    ","title":"I MISS THE LONELY GIRL,I ALWAYS USE TO TALK TO ON THE BUS & TRAIN!","url":"https://newyork.craigslist.org/que/mis/d/miss-the-lonely-girli-always/6597998192.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is for all the girls listed in the title. I'm new to New York and looking for a companion to have a drink/coffee with. Have some good conversation with and whatever. I have lived a colorful life so far so not a dull moment guaranteed. I have tattoos and one piercing. Well reply if you like and we can go from there. Questions? Ask away.    ","title":"Rocker, emo, punk","url":"https://newyork.craigslist.org/mnh/mis/d/rocker-emo-punk/6601270321.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nestabas trabajando en el restaurante ayer domingo como alas 3pm  eres la mesera más bonita que evisto limpiaste la puertas de cristal en le entrada principal yo era la persona que estaba esperando una hordden playera negra chaleco negro gorra y jeans me miraste varias veces te quise hablar pero estabas ocupada me gustaría invitarte a salir tu unos 40 y yo también siento que eres colombiana eres bellisima\n    ","title":"Misti restaurant","url":"https://newyork.craigslist.org/wch/mis/d/misti-restaurant/6601289656.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou would come by my business in mid town west and collect charity for the Lubavitcher charity group  ., usually it was early fridays and then you disappeared., we had great conversations and very deep thoughts on every topic. \nMost were very inspiring because they related to real life current challenges.Hope to hear from you.    ","title":"The fun Jewish Religious black hat kid","url":"https://newyork.craigslist.org/mnh/mis/d/the-fun-jewish-religious/6596922970.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \na few day back i was walking from east side to west side  up by the brambles didnt know what i saw i look closer n you know want i saw the guy who was standing ran away  n you wave me to come over i was to shy  n just left  well wish i had stop by if you see the get back to me    please hit me back even if it wasnt you or you dont remember    ","title":"central park","url":"https://newyork.craigslist.org/mnh/mis/d/central-park/6601215632.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI am so in love with you. I think about you all day long and at night I dream about you. You are the sweetest and kindest, not to mention the most amazing and awesome person I have ever met. They say music soothes the savage beast but their wrong. It's your smile. Cause every time I see you smile I swear I turn into a puddle of water cause I just melt. I love you so much. If you ever break up with the guy your with, let me know cause I promise, I'll treat you like the princess that you are. And if I die tomorrow, I'll die a happy man , just for the fact that I had the honor and privilege of knowing you.    ","title":"Carrie- M4W","url":"https://newyork.craigslist.org/stn/mis/d/carrie-m4w/6601137043.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOlder white guy who looks latino with white hat, was looking at you , sorry if I made you uncomfortable, thought you might be Chin, who used to visit me several years back and have such fun, we lost touch while I was away and would love to see him(you?) again, please answer this ad if you see it!    ","title":"small asian guy Saturday evening at 14th and 7th","url":"https://newyork.craigslist.org/mnh/mis/d/small-asian-guy-saturday/6601169151.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\"I used to think the worst thing in life was to end up all alone. It's not. The worst thing in life is to end up with people that make you feel all alone.\" -World's Greatest Dad\n\n----Robin Williams    ","title":"Quotes","url":"https://newyork.craigslist.org/mnh/mis/d/quotes/6601094420.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe saw each other, first in the liquor store, then inside the store and finally pumping gas. What are the odds? Each time we smiled and by the third encounter it seemed we couldn't decide do e who was pursueing who! Anyway if you're interested in more then just a chance encounter hmu. I don't bite, unless you want me to.    ","title":"Costco","url":"https://newyork.craigslist.org/lgi/mis/d/costco/6598297726.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou're the slim man in his 50s wearing a wedding ring who asked me how to use the parking app. I'm the same age.  We talked about  cardio and fitness. Thought you were cool. Let's continue the conversation.    ","title":"At City Place garage","url":"https://newyork.craigslist.org/wch/mis/d/at-city-place-garage/6601111137.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe used to hang out right after work at my place in hells kitchen (columbus circle). You worked by Bryant Park/GC (Law) in live in LI and I work in Fidi. Would like keep it going    ","title":"Lost contact - after work (M4M)","url":"https://newyork.craigslist.org/mnh/mis/d/lost-contact-after-work-m4m/6601074524.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nwe met after the event and i put my arm around you and i walked you to your train. You were wearing  leather jacket, i had on a shirt with an elephant on it. I walked you all the way to your bus stop and I gave you a kiss. Please get back to me. I felt like we had a connection. please email me.    ","title":"i walked you to the train last night after the axwell/ingrosso event.","url":"https://newyork.craigslist.org/brk/mis/d/walked-you-to-the-train-last/6601073232.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOn Saturday, May 27, You were Latina wearing black playing with your grandkids. I was with my daughter. We were smiling at each other.    ","title":"Bay Plaza Billy Beez","url":"https://newyork.craigslist.org/brx/mis/d/bay-plaza-billy-beez/6601026974.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI'm the good looking guy in his mid to late 40's, a little younger than you, that you said was funny. You're the dark haired, married man with chest hair poking out of the collar of your shirt. I said it intrigued me. We talked near my apt. building across from Bryant Park. We should continue the conversation.    ","title":"Dark Haired Man in Bryant Park","url":"https://newyork.craigslist.org/mnh/mis/d/dark-haired-man-in-bryant-park/6601023438.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI saw two beautiful young black women in Hampstead Friday i was work there they  walked by one was walking a baby and the other wasn't I said have a nice day they both turned around and said you too just wondering if you notice that I was interested in one of you to be friends and maybe leading to something more like a relationship and if your wondering I'm white male    ","title":"2 beautiful young black girls in Hampstead","url":"https://newyork.craigslist.org/lgi/mis/d/2-beautiful-young-black-girls/6601001488.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou: Cute boy in black and purple messanger bag, tortoise glasses and beanie \n\nMe: black tank top, split toe boots, red fanny pack and black beanie. \n\nWe made eye contact after you finished your halal and sat down across from me. We kept smiling back and forth and I was eyeing the seat next to me to try and get you to come sit down. You closed your eyes for a moment as we got to my stop (Morgan Ave) and when I left, I looked back and you had just noticed I got off the train. \n\nBrooklyn bound L at approx 3:30am Monday morning 5/28    ","title":"Cute Boy in Glasses 3:30AM Brooklyn Bound L","url":"https://newyork.craigslist.org/brk/mis/d/cute-boy-in-glasses-330am/6600997381.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nMet you a while back . You were from the heights . Washington heights . You were domincan . You came to me late at night .  Think k met you on cl . .    ","title":"Katy or Kathy","url":"https://newyork.craigslist.org/brk/mis/d/katy-or-kathy/6600977030.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nU got on liberty ave Saturday May 12th that would be early Saturday morning about 1 in the morning.i pray u c this ur face is my type ..we were lookin at each other u were  my type i did not want to say nothing I didn't want to embarrass you I didn't want to embarrass myself I am single italian ..i was wearing a black tshirt .got off bus and i smiled at ur beautiful face through the glass and your smile is beautiful I love your face and I mean that you don't have to meet me for a while you can talk to me call me text me as a friend so u can feel me out so you could see i am  genuine I would love to hang out with you I mean it I'm genuine and very cool very knowledgeable I have no children if you're from another country that's okay your face is gorgeous that's my type that's very sexy and I love intelligent conversation you have that look like you know the deal please you don't have to meet me for a while we could just  talk so u trust me  I pray that you see this ad okay you get you answer this ad and I will give you my phone number I could even meet you on Crossbay Boulevard Woodhaven blvd u  took the 21 bus so mayb u live in lindenwood or.howard beach or going to a late night job .... I hope you see this ad get to know me please i live by the car wash ..\n    ","title":"May 12 beauty that i smiled at thought the window of the q21 bus","url":"https://newyork.craigslist.org/que/mis/d/may-12-beauty-that-smiled-at/6586799990.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAnd, ever since we ran into each other some years ago at the bar.. All I can do is think what it must be like to have dinner with you. \nIt's a crush and a curiosity. You're just blocks away. Mind if I watch an episode?    ","title":"You're watching Outlander, I'm doing laundry.","url":"https://newyork.craigslist.org/brk/mis/d/youre-watching-outlander-im/6600952573.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOne of my favs    ","title":"A Knight's Tale","url":"https://newyork.craigslist.org/mnh/mis/d/knights-tale/6600948912.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was exhausted but I knew I'd regret not starting a conversation with you.  Second chances?  Let me know what I was carrying.    ","title":"waited together for the C at Lafayette on Sunday afternoon","url":"https://newyork.craigslist.org/brk/mis/d/waited-together-for-the-at/6600953188.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI see you all so often and some of you seem so lonely. A relationship is possible and happiness is within reach. I am a 24 year old attractive male adopted from Russia and am ready to take the next step.\nMessage me if you want my pic    ","title":"Gay euro/Russians in Brighton beach","url":"https://newyork.craigslist.org/brk/mis/d/gay-euro-russians-in-brighton/6600944304.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey we meet this morning by the castle this morning you had on white shitt black pants ang gote and was hard then your girl came you left. I wanna find you\nMike    ","title":"We met at Cabrini park","url":"https://newyork.craigslist.org/mnh/mis/d/we-met-at-cabrini-park/6600921891.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met last summer at a bar in Queens, and I remember you were disappointed that I didn't go with you to another place afterward. We ended up going on a coffee date later on. I lost your number--hope you see this and write me. (m4m)    ","title":"Vicente, where are you?","url":"https://newyork.craigslist.org/mnh/mis/d/vicente-where-are-you/6600933586.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi, I saw you at Barnes And Noble late afternoon around 5:30ish. You were a few people behind me  in line. We said hi and I wanted to ask for your number, but when I turned around, you were gone. I was the guy shaved head, grey tshirt, beard. Well anyway, I think you're awesomely beautiful. If you see this, let's for an iced coffee or something.\n\nThanks,\n    C    ","title":"Barnes And Noble","url":"https://newyork.craigslist.org/brk/mis/d/barnes-and-noble/6600931305.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were wearing a batman t-shirt, your hair was long and you were with a friend. I was two or three people behind you on the line. We made eye contact several times. You smiled and I froze. If you ever see this, I would love to learn your name.    ","title":"doctor strange movie screening","url":"https://newyork.craigslist.org/mnh/mis/d/doctor-strange-movie-screening/6600927513.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi u were so cute but i was too shy. Hope u find this n we could keep our conversation going\n\n ;)    ","title":"Tall guy who spoke to me near the yankee stadium","url":"https://newyork.craigslist.org/brx/mis/d/tall-guy-who-spoke-to-me-near/6600754003.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were on the N train late last night, sitting with what looked to be your parents. You had a shaved head, converse sneaks, and gorgeous eyes. We caught each other's eye a couple of times, but then you got off a stop before me. Would love to get to know you.    ","title":"Saw you on the N train last night","url":"https://newyork.craigslist.org/que/mis/d/saw-you-on-the-train-last/6600718115.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nQueens...\n\nI miss seeing U around Laura, always wanted to ask U out, but was scared...\nAlso, I wanted to save face around everybody else... I have it really bad for\nU... I think about you from time to time... Your personality kind of turned me off,\nBut I understand, you probably had to save face too:( \nI think we could have had good future together...\nHope all is all with your new work...\n\nTake care.    ","title":"Really miss seeing Laura G. from CityWide:(","url":"https://newyork.craigslist.org/que/mis/d/really-miss-seeing-laura-from/6582650423.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nMaya? from Ohio -- You pulled me on the dance floor and we were having a good time. You left in a hurry ...    ","title":"Red Lion Saturday","url":"https://newyork.craigslist.org/mnh/mis/d/red-lion-saturday/6600669469.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI wish I would've said hello \nYou were the gorgeous woman walking thru the mist and the fog..\nEven with the weather around us very dreary, you brought something bright to my day.\nI wish I would have said hello..\nI hope you find me here\nHappy Sunday    ","title":"The Beautiful Woman Walking in the Fog","url":"https://newyork.craigslist.org/mnh/mis/d/the-beautiful-woman-walking/6600622486.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo the attractive woman at the Indian Supply store on 1rst who danced with me.\nYou were very pretty  and after your check out you looked at me and hesitated but you didn't wait.\nI'ld love to meet you for coffee and to get to know you.\nPlease contact me.    ","title":"Attractive woman at the Indian store on 1rst who danced with me","url":"https://newyork.craigslist.org/mnh/mis/d/attractive-woman-at-the/6592166374.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI'm the 60 yo white male who was standing over you on the train yesterday afternoon. You are the gl man seated. You appeared excited to see me. I would like to get to know you m4m.    ","title":"Saw you on the A train","url":"https://newyork.craigslist.org/mnh/mis/d/saw-you-on-the-train/6600514346.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo that nice and cute Spanish chick on the 1 train from Friday evening around 7ish. We was heading Bx-bound and it was going express. You was thick, nice jeans and a black shirt. I was looking at you but I guess you was aggravated and tired. I am the blk male with the blk NY baseball hat on.    ","title":"To that nice and cute Spanish female on the 1 train","url":"https://newyork.craigslist.org/mnh/mis/d/to-that-nice-and-cute-spanish/6594552141.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was in a rush and you were busy filming next to the park and we both recognized that we knew each other but did not have time to figure it out. Would love to remember!    ","title":"Filming on St. Nicholas, 5/25","url":"https://newyork.craigslist.org/mnh/mis/d/filming-on-st-nicholas-5-25/6600378712.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLast night, Saturday, May 26 at around 8/8:30 PM. \n\nYou: handsome af, dark hair, rode up on a skateboard. Almost ran into my friend as you pulled up and went into a house on S 8th near Bedford. You were looking back at me as I was walking by, looking back at you. \n\nMe: black baseball cap, dark shirt, shorts. White beard, muscular. 6ft. 230.    ","title":"S 8th and Bedford in Williamsburg","url":"https://newyork.craigslist.org/brk/mis/d/8th-and-bedford-in/6600376250.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLooking for my Female Friend we met couple times by the College in the evening trying to contact you would love to see you again J..    ","title":"Bronxville Connection","url":"https://newyork.craigslist.org/wch/mis/d/bronxville-connection/6585464141.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou couldn't keep your eyes off my bulge. We made quick eye contact, smiled and then I had to get off train    ","title":"cute brunette on A train","url":"https://newyork.craigslist.org/mnh/mis/d/cute-brunette-on-train/6600306810.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLooking for a tall black man that i met on Jamaica  Ave  in Queens last weekend... i lost your number so if u see this message please get back to me..,i m that young venezuelan transgender u met  on the street near Stuphin Blvd last weekend.. i would likr to hang out with u... lemme know\nthanks......    ","title":"Black man from Jamaica","url":"https://newyork.craigslist.org/que/mis/d/black-man-from-jamaica/6597690221.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI asked you how your weekend was going so far. Let's get in contact. Grab a coffee or drink.    ","title":"Blue jumpsuit","url":"https://newyork.craigslist.org/brk/mis/d/blue-jumpsuit/6600282961.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met at the station and you were with your mother.  We talked while on the train where you told me you lived in long island. I really enjoyed talking to you but it was cut short due to the train reaching it's destination. And though I'm only in town for another 3 days I'd like to spend more time with you and have someone to go to the museums together.    ","title":"We met after the Yankee game","url":"https://newyork.craigslist.org/lgi/mis/d/we-met-after-the-yankee-game/6600274085.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nHi Julianne this is Anthony the guy in the golf cap that rescued you from the creeper in the red shirt on the bench... I should have asked for your number but I wasn't sure it was appropriate. If you're single I'd love to take you out. Hit me up :)    ","title":"Julianne in central park, I saved you from a creeper (central park)","url":"https://newyork.craigslist.org/mnh/mis/d/julianne-in-central-park/6600270086.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi Julianne this is Anthony the guy in the golf cap that rescued you from the creeper in the red shirt on the bench... I should have asked for your number but I wasn't sure it was appropriate. If you're single I'd love to take you out. Hit me up :) \n\n    ","title":"Julianne in central park, I saved you from a creeper","url":"https://newyork.craigslist.org/mnh/mis/d/julianne-in-central-park/6600268543.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFigured I'd try this but you'll probably never see it. You were with your friend Tiffany visiting nyc. I thought maybe our eyes met on the subtle side.   You are a nice guy.  I am the Personal trainer guy.  Too shy to make things obvious here. would like to meet up if you are free.  If its you tell me what I was showing you guys. Maybe you'll see this.    ","title":"Landon from LA 1 train tonight I was giving you & a friend directions","url":"https://newyork.craigslist.org/mnh/mis/d/landon-from-la-1-train/6600261685.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI'm a fool, but I still miss you.    ","title":"Sam","url":"https://newyork.craigslist.org/mnh/mis/d/sam/6600261621.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou was with your man and we both stared at each other after you sit down, we sat across from. Each other . You are really pretty . Tell me the color of my shirt or anytning u remember if you do see this . Lets get coffee together or dinner .?\n\nM4W    ","title":"Mexican girl on D train","url":"https://newyork.craigslist.org/mnh/mis/d/mexican-girl-on-train/6600240423.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou are the sexiest bodybuilder in ct alone i stare at you comstantly anytime i see you im 26 thick black chub that wears all black all the time i know chub mighy not be your thing but im hoping maybe we can build a relationship despite that maybe we can grab a coffee or go out to eat whatever but lets get to know eachother and build a relationship    ","title":"I am in love with you M4M","url":"https://newyork.craigslist.org/fct/mis/d/am-in-love-with-you-m4m/6600246131.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaturday night around 11:30. I walked in to Two Boots pizza at 44th and 9th Ave. I was wearing a white t-shirt and a hat. You were by yourself eating a slice. You were the beautiful girl with short dark hair and olive complexion. Shorts, a tan/beige tank top, and a backpack.    ","title":"You were eating alone at Two Boots pizzeria Saturday night","url":"https://newyork.craigslist.org/mnh/mis/d/you-were-eating-alone-at-two/6600246018.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nlookin for hot asian babe in skirt who visited late saturday afternoon. i sat at the table with a friend and got distracted by you :D    ","title":"Queens Village Popeyes","url":"https://newyork.craigslist.org/que/mis/d/queens-village-popeyes/6600237888.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nGood luck hope she accepts.  she was your first choice anyway....    ","title":"re:the engagement ring","url":"https://newyork.craigslist.org/lgi/mis/d/rethe-engagement-ring/6600207580.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWas at the sports club this morning.  Finished at about 11 and went to the steam room.  When I went in, our eyes locked at one another.  Felt there was a connection.  You are about 35 and darn handsome.  I am 50 and in great shape.  I go to that gym 4 times per week.  If by chance you see\nThis post,I would like to buy you a drink and go from there.    ","title":"Saw you at NYSC.  Felt there was a connection","url":"https://newyork.craigslist.org/wch/mis/d/saw-you-at-nysc-felt-there/6600184432.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met in CL. I was looking for a Beach Buddy to go to Robert Moses preferably the nude Section. U said u had never been\nBut would be up to it. We texted all afternoon and had a great time. U were from Florida but moved to LI. I had to get back to work and then u were gone. Lost \nUr number but would like to reconnect. Miss u Joerg    ","title":"Amber","url":"https://newyork.craigslist.org/lgi/mis/d/amber/6600176893.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaw you doing martial arts on Friday. Would like to be friends by\nmail or phone.  What did I say about your boots?    ","title":"McMap in military park","url":"https://newyork.craigslist.org/mnh/mis/d/mcmap-in-military-park/6600153770.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe short time spent with you was amazing. You are beautiful inside and out. Still thinking about you and it. Hopefully I'll see you around.\n\nPS. The person I was suppose to meet was you!    ","title":"Sexy cougar on Bergen St","url":"https://newyork.craigslist.org/brk/mis/d/sexy-cougar-on-bergen-st/6600147479.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAll you gotta do is text me and we can get engaged/married. Dont even respond here just text me    ","title":"I got the engagement ring","url":"https://newyork.craigslist.org/wch/mis/d/got-the-engagement-ring/6600048305.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nprobably shoulda taken my headphones off and let u compliment my shirt but i didn't realize what u were motioning for at first and then and i was too exhausted from work to strike up a conversation. u and ur dog seem nice tho so i hope u see this!    ","title":"L train - pink hair","url":"https://newyork.craigslist.org/brk/mis/d/train-pink-hair/6600092607.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nMiss me I'm here and not going anywhere (nineoneseventwoonethreethreethreeninenine)    ","title":"Christine","url":"https://newyork.craigslist.org/que/mis/d/christine/6600039769.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were in all black and I was in all white. I asked you when Powder was supposed to end her set. I thought you were cute and wish I had got your name!    ","title":"At Nowadays","url":"https://newyork.craigslist.org/que/mis/d/at-nowadays/6600034845.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were in all black and I was in all white. I asked you when Powder was supposed to end her set. I thought you were cute and wish I had got your name!    ","title":"At Nowadays just now","url":"https://newyork.craigslist.org/brk/mis/d/at-nowadays-just-now/6600035138.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nToday at around noontime whilst shopping, I encountered a lady with a very kind smile. We shared that, albeit shyly.\n\nYou wore a while blouse and black pants and have dark hair. I was the gentleman wearing a black shirt and jeans.\n\nI'd enjoy having a chance to share a conversation with you.\n\nIf you write and tell me a) The approximate length of your hair; and b) The area of the store where we were... I'll know that it's you and will surely write back.    ","title":"H-Mart in Williston Park, 5/26","url":"https://newyork.craigslist.org/lgi/mis/d/mart-in-williston-park-5-26/6600039249.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou worked at Wm. Morris, but left to go sailing around the world.  I wonder what ever became of you.    ","title":"Ex-William Morris Assistant","url":"https://newyork.craigslist.org/mnh/mis/d/ex-william-morris-assistant/6581699769.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\nfacing each other \nyou noticed my mushroom barley soup ...\nin case you care, I am single\nworking woman, you look like my type of guy\nI am 54, how old are you?    ","title":"I saw you at Odessa diner you and I were alone","url":"https://newyork.craigslist.org/mnh/mis/d/saw-you-at-odessa-diner-you/6599928977.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNo other will do \nAny other will always be \nSecond best compared to you\n\n.......\nI hope the best for tonight \nSo far it seems, it will follow thro\nI hope to post good news \nEven if I am the only one \nHappy about it\nI have waited so long for tonight \nImpatiently patiently waiting \nJust for tonight \nBecause i love myself enough \nTo know I deserve better than \nWhat I have endured for years\nFingers crossed\n\n........\nAnd by the way \nI can't help thus 'beatin' feels\nThat I have inside my soul\nIt's what's happens when\nYou have been treated a certain way\nFor many many years \nIt's like an engraving within self and\nWhen i met you, you took that away \nIn just one night, you made me feel \nYou made me feel like \nAnything could happen anything is possible \nAnd so tonight I complete \nWhat I started long time ago \nBut I do this for me \nBecause i shoulda did this along time ago\n\n........\nHow can pain and happiness coexist \nEz\nLook at me, living prove, right here \nIt means I live an not dead, yet \n\n......\nNothing compares to you \nPrince\n\n\n\n\n    ","title":"Witoutu","url":"https://newyork.craigslist.org/mnh/mis/d/witoutu/6599948115.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI met you on Mother's Day on a Lexington Ave. subway car going south and we spoke only briefly before I had to get out at 96th St. and before I had a chance to get your cell #.  You had a ukulele at your side and a psychology book in your lap (you were also eating chips!).  I had a guitar and was wearing a yellow jacket.  I enjoyed our short chat very much and would love to meet you again sometime for coffee.  I live in Westchester but am in the city often.  Someone told me about this site and I hope you or someone who knows you will see this post!    ","title":"A woman with blonde hair and a ukulele who lives in Brooklyn!","url":"https://newyork.craigslist.org/brk/mis/d/woman-with-blonde-hair-and/6599968445.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey. I saw you in this cafe once and we made eyes, but you were with a friend then, so I was excited to see you back there today. You were in what looked like yoga gear, I would guess. But you didn't stick around long so I didn't get a chance to say hello. I think you told the server your name was Danielle. There was some kind of kerfuffle about your green smoothie maybe? I dunno. You are radiantly beautiful.\n\nI'd love to get a coffee in the neighborhood sometime. Hope this finds you. xo    ","title":"Danielle at PLG","url":"https://newyork.craigslist.org/brk/mis/d/danielle-at-plg/6599942943.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou boarded the E train at Queens Plaza. Our eyes met before you boarded, but I had to quickly look away because I was too shocked at how pretty you were. I was wearing dark red pants with a chambray shirt. I wanted to talk to you - but alas, I didn't have the courage. I got off at 53rd Street - you kept going downtown. Full on regret if I don't get to at least know your name.    ","title":"E Train today at around 1:30","url":"https://newyork.craigslist.org/que/mis/d/train-today-at-around-130/6599861973.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDo I dare\nDisturb the universe?\nIn a minute there is time\nFor decisions and revisions which a minute will reverse.\n\nFor I have known them all already, known them all:\nHave known the evenings, mornings, afternoons,\nI have measured out my life with coffee spoons;\nI know the voices dying with a dying fall\nBeneath the music from a farther room.\n               So how should I presume?    ","title":"Shinko","url":"https://newyork.craigslist.org/mnh/mis/d/shinko/6599815630.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLexi, it's Dustin. So, you completely disappeared and never showed up.  I'm hoping you were just too nervous and still wanna meet up.  If you still wanna get together tell me what my favourite colors are so I know it's you.    ","title":"Lexi B","url":"https://newyork.craigslist.org/mnh/mis/d/lexi/6599789969.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOften think of Riding Academy old friends.    Specifically Peggy, Judy and Connie.   Hope you are all well    ","title":"Lakeside Riding Academy Cake Girls","url":"https://newyork.craigslist.org/lgi/mis/d/lakeside-riding-academy-cake/6599729628.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI see you at the Scarsdale train station almost every morning. Not sure if you're are married, but you always smile\nand say hi to me. Lets get to know each other. You look like a wonderful Lady.    ","title":"Scarsdale Train station - 737 train","url":"https://newyork.craigslist.org/wch/mis/d/scarsdale-train-station-737/6599656133.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe caught each others eye on the platform. Felt like you were into me, and I was into you. I only got off at 14 to transfer and you looked sleepy. You were older than me, but I didn't care. Until next time?? (Mm) \n\nGimme details if you read this.    ","title":"It was 2 am Friday night","url":"https://newyork.craigslist.org/mnh/mis/d/it-was-2-am-friday-night/6599611485.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were alone having your soup and sushi rolls at Ginza on Lexington Ave. I was a few tables away waiting for my take-out. You were checking something on your iPhone, but you looked up a few times & our eyes met briefly. I wanted to say something, but didn't want to disturb your lunch.\n\nHopefully you'll read this and respond. What color shirt was I wearing?\n\n    ","title":"You Were eating Your Lunch at Ginza on Lexington Ave. (M4W)","url":"https://newyork.craigslist.org/mnh/mis/d/you-were-eating-your-lunch-at/6599585337.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAsked if you were interested in a workout partner on a regular. Willing to do more. M4M.    ","title":"Club Fitness Astoria","url":"https://newyork.craigslist.org/que/mis/d/club-fitness-astoria/6599574979.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met a few times going back a couple of years. Your a flight attendant, male, early 30's, about 5'10 150, very personable, from the mid-west. We've fallen out of touch. Long shot here but thought i'd give it a try. I'm a male too.    ","title":"Flight Attendant","url":"https://newyork.craigslist.org/que/mis/d/flight-attendant/6593331972.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe briefly chatted....Sorry I couldn't spend more time with you. \n\nPlease let me now if you'd be interested in keeping in touch. \n\nFrom Montreal :)\n\n    ","title":"Albanian Girl at the Heavenly Bodies Exhibit at The Met","url":"https://newyork.craigslist.org/mnh/mis/d/albanian-girl-at-the-heavenly/6596330823.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI saw you walking on 7th avenue, tall, slim, dark hair, 30's.\n\nMe - 40's, 6' tall, White, European, fit, Wall st professional.    ","title":"Park Slope on 7th avenue (m4w)","url":"https://newyork.craigslist.org/brk/mis/d/park-slope-on-7th-avenue-m4w/6599530760.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nwe had eye contact at gym on e54 and 2nd. kept looking at each other while we worked.\ni like to watch other guys work out.\nwe should have struck a conversation.\nyou had shorts (tight i might add) on and black cutoff t.\nmwm 56 here    ","title":"we met gym on e54","url":"https://newyork.craigslist.org/mnh/mis/d/we-met-gym-on-e54/6599501321.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHello. We Chatted Briefly At Gym Locker Room. You Were Finished, I Just Arrive.\nYou Seemed Very Kind, Level Headed And Handsome.\nM4M?\nLet Me Know , We Could Meet For Morning Coffee- etc.    ","title":"We Chatted In Gym Locker Room","url":"https://newyork.craigslist.org/fct/mis/d/we-chatted-in-gym-locker-room/6599482725.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTaking a limb and seeing if those two bears I saw at Fulton around 4am-ish are into meeting up. You guys look like a couple and didn't want to assume. I was the guy in shorts standing in front of you at Fulton Street. I believe we all got out in Brooklyn at the same stop. Hmu if you are interested and what train line we were on.    ","title":"Cute Bears at Fulton - m4m","url":"https://newyork.craigslist.org/brk/mis/d/cute-bears-at-fulton-m4m/6599471346.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n(Redacting things out of a concern of her privacy; the location pin is the default location for the city in CL)\n\nHad a nice deep talk with some friends an hour ago (Sat, 5/26 at 12 midnight) about not having a set criteria about picking someone to date based on their pedigree - that one would judge others as \"not worthy\" before even getting to really know them, and how bad of a place that would lead :(\n\nTired, and out of a concern for safety, I decided to take an Lyft Line back to my place. I saw the car was picking up someone from the Exchange Place PATH station, so I figured I had a few minutes to hop on. I had greeted you and the driver a gentle \"Good evening\", and you both returned pleasantries. By the time we reached my place, pleasantly surprised, you had told me we were neighbors, and what street you lived on - the street opposite mine (i.e. that you were going to be dropped off a short distance after my place). With a smile, you reached out to shake my hand and introduced yourself as K.\n\nI was too shy and stunned to reply with more than my first name (S) and wish you and the driver Marin a safe evening. Why would a stunning lady risk introducing herself after midnight to a guy she had just met?\n\nEven if we don't cross paths again, I'd love to know that you got home safe, and get another chance to properly introduce myself face to face. thank you for surprising me :)    ","title":"Neighbors crossing paths after midnight","url":"https://newyork.craigslist.org/jsy/mis/d/neighbors-crossing-paths/6599451226.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nBeautiful angel who found my wallet this afternoon on breezy point beach.\nPlease contact Rich so I can thank you properly.  Greatly indebted to you.    ","title":"woman who found wallet on breezy point beach","url":"https://newyork.craigslist.org/que/mis/d/woman-who-found-wallet-on/6599430590.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe used to mess around you are a straight Latin  guy on the upper west side you would come over a few times a week\nI am mike    ","title":"Looking for my buddy","url":"https://newyork.craigslist.org/mnh/mis/d/looking-for-my-buddy/6599422002.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe spoke for a while with your friend. You we're a super cute accountant/ yoga instructor and I was the architect who was on my bike. Had to run. Should of got your number. \nHope you see this!    ","title":"Sweet woman at sweet chic","url":"https://newyork.craigslist.org/brk/mis/d/sweet-woman-at-sweet-chic/6599424308.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI know you see what I am up to from time to time. I know you look at my page. I'm a little hesitant in making direct contact with you for many obvious reasons. But, maybe it is worth taking a chance. Maybe.  This post is for a woman.    ","title":"R","url":"https://newyork.craigslist.org/mnh/mis/6599421744.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n...huh?\n\nI'm not really sure what I did or didn't do? Or was it what you did or didn't do?? Was it me? Was it an \"it's not you, it's me\" sitch in time? Was it just bad timing??? It's happened before. Was it bad timing then, too?!\n\nRadio silence. \n\nIrish exits. \n\nThat seems to be your thing.\n\nA Scooby-Doo mystery is unfolding.\n\nThe truth is, Joe Fox, that I really want to text you... to see how you are. The truth is, my honey bunches of oats, that I want you to text me... to see how it's hangin' up here.  \n\nThe truth is, I really just want to understand where you're at and how you feel and how you actually feel about me. I just want to solve this case once and for all.\n\nThe truth is, I care quite a bit about you.  \n\nBut, I won't text you... because it takes two to volley and you're up next to serve some quips and phrases. \n\n(And, because I already feel like a twerp.)\n\nThe truth is, I think it's kinda silly that you'd rather push me away than have a wonderfully awkward moment face to face... and enjoy the experience whether we hit it off or not. \n\nIRL could surely never feel as cold as this. You must know this.  \n\nWinter is over and there ain't no time for sharp little icicles...\n\n...only flowers and sunshine and that frolicin' we talked about.\n\nI'm here for you. I've never not been. \n\nYours remotely, \nKathleen Kelly (or something like that)    ","title":"So, I Guess There Won't Be Any Frolicin'... (W4M)","url":"https://newyork.craigslist.org/mnh/mis/d/so-guess-there-wont-be-any/6599412843.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThanks again for the compliment :)    ","title":"Girl riding her bike behind me this morning","url":"https://newyork.craigslist.org/mnh/mis/d/girl-riding-her-bike-behind/6599415227.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \ntell me your secrets,\nyou know i'm good for it\ni love it when you break down\nlose control\nbut i also love it when you wow \nthe crowd\nwatch their jaws drop so obviously\nkeeping my admiration a little further out of reach\n\ni'd be cool with you closing the book on me\nit's pretty obvious i could never handle you\nand thats not your fault\nbut it wonder if you'd ever drop my name\nif even just to paint layers and layers over it \nto acknowledge my existenz \n\nyour tryly\n    ","title":"i pine therefore i exist","url":"https://newyork.craigslist.org/mnh/mis/d/pine-therefore-exist/6599405000.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey, we used to fool around in your pad close to my house. Im the Asian kid with the juicy bum from Bushwick and you were in Bedstuy. Actually swapped numbers at some point and became regulars. Reached out lately and never got a reply. Hope to hear from you again.    ","title":"Ginger Papi in Bedstuy m4m","url":"https://newyork.craigslist.org/brk/mis/d/ginger-papi-in-bedstuy-m4m/6595557510.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was at your house working today, I was a little nervous but I wanted to tell you how pretty you are and I noticed you changed your top I liked the black one. Would you like to get together?    ","title":"Nanny in Cortlandt Manor","url":"https://newyork.craigslist.org/wch/mis/d/nanny-in-cortlandt-manor/6599342031.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe were transporting in thick traffic. You were in the car next to my ambulance. We looked at each other and shrugged.    ","title":"Urgent traffic jam.","url":"https://newyork.craigslist.org/fct/mis/d/urgent-traffic-jam/6599380000.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou: Tall, wearing an Indigo Blue button up shirt, black pants, black Toms, & Tan glasses, sitting to my right.\nMe: Long hair, Ray-Bans, standing by the door.  \n\nYou got off at Fulton/Financial Dist,  I wanted to say Hi, but I was too shy... are you out there?    ","title":"Man w/Tan Glasses. 6/25, On the C line from BK, 9:45am, Fulton Stop","url":"https://newyork.craigslist.org/mnh/mis/d/man-tan-glasses-6-25-on-the/6599340650.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nBusy mind clouded my desire but I noticed you, and I'm hoping we could meet again so I can get to know you.    ","title":"Beauty on B train, dark dress white vans,almost fell in my arms.","url":"https://newyork.craigslist.org/brk/mis/d/beauty-on-train-dark-dress/6599281518.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt just kind of flowed with you and yet the circumstances might have been a little awkward.  I'm sure we could figure something out though you are really cute and nice guy.\n\nTell me the circumstances we met under and name of the store.\n\n    ","title":"We met at a store on Madison earlier","url":"https://newyork.craigslist.org/mnh/mis/d/we-met-at-store-on-madison/6599252039.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou told me my ass was hanging out at the checkout in Stop & Shop. I was mortified. You said it made your day. If you were older and less attractive, I would have taken great offense. As such, you were neither and after I told all my friends about it, they said I should have asked you out.    ","title":"Stop&Shop","url":"https://newyork.craigslist.org/wch/mis/d/stopshop/6599237534.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou had some tattoos.. So did I. \n\nWe smiled.  \n\nGiving this a try.  \n\n    ","title":"Tall athletic guy on F train / you sat next to me / I got off 2nd Ave","url":"https://newyork.craigslist.org/mnh/mis/d/tall-athletic-guy-on-train/6599219288.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaw you today on the F train. You got off at 2nd Ave. I was the asian guy sitting next to you. Wanted to say hi but always believed it would make people uncomfortable so I kept my eyes off to the side and my headphones in. You were wearing leather mules? Is that what they are called? Dress shoe up front but party in the back. Would love to grab a drink sometime. What are the chances you see this? 1 in a million? more like a billion?    ","title":"asian girl F Train 2nd Ave wearing leather mules","url":"https://newyork.craigslist.org/mnh/mis/d/asian-girl-train-2nd-ave/6599194343.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI should have done more than point. Hit ME up.    ","title":"Girl with the Satan tattoos","url":"https://newyork.craigslist.org/mnh/mis/d/girl-with-the-satan-tattoos/6599074980.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHave curious creature reaching out of the nothing for you? \n\nHave you called on something from the depths for personal gain and got more than you expected?\n\nHave a parasite feeding on you from beyond the veil?\n\nI'm here to help. Tell me what haunts you.\n    ","title":"Time traveling monster hunter here with over a millennia of experience","url":"https://newyork.craigslist.org/mnh/mis/d/time-traveling-monster-hunter/6599019016.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo the most amazing looking woman in NYC:\n\nYou are so beautiful! I do CrossFit as well & I imagine sparks would fly as we do barbell cycles and C2B PU's.\n\nYou walked on the opposite side of the street from the Ace Hotel in your purple t and shorts today.  I would love to have a chance to get to know you better.\n\nI think I am your type.  Tall, handsome, and in shape.\n\nPlease do not hesitate to email me!    ","title":"Muscular CrossFit Beauty in Purple T","url":"https://newyork.craigslist.org/mnh/mis/d/muscular-crossfit-beauty-in/6598944309.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nyou came over more than once , i gave you foot rubs ,we had a glorious time , i lost your email address , please get in touch if you see this.    ","title":"Corner of metropolitan ave and ......  m4m","url":"https://newyork.craigslist.org/brk/mis/d/corner-of-metropolitan-ave/6598896982.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThere are so many posts on here... I'm not sure if you're reading, much less posting anything for me to see. I'm confused. \nI don't want my words to be misunderstood. Are you open to talk? I know a lot has happened. I know you have reasons to hate me... but all the time I have spent on therapy to help me discovery and forgive myself isn't enough. \nI'm not here to lie. I'm not here to blame. Motherhood has given me a new purpose in life. I do not want to hate for I don't want to raise haters. I want to be a good person and be a good example. \nCare to talk?  In person?    ","title":"Gemini","url":"https://newyork.craigslist.org/mnh/mis/d/gemini/6598773572.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo the tall black guy that I met around 10 last night, I had a lot of fun, should have gotten your number.  HMU and tell me where we met    ","title":"Met you last night in Bridgeport","url":"https://newyork.craigslist.org/fct/mis/d/met-you-last-night-in/6598755500.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe used to take the bus together all the time and you came over my house discreetly after school a couple times... I lost your number would really like to get together again. We can pick up where we left off. I am home alone this week my parents went on vacation. We were both young masc. latinos we were both very into each other lol I can't believe I am doing this! :p    ","title":"I lost your number dude from bus stop!","url":"https://newyork.craigslist.org/que/mis/d/lost-your-number-dude-from/6596849341.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou sat down next to me at Hoyt Schermerhorn (pretty sure). I looked at what you were reading and it was Chuck Klosterman's BUT WHAT IF WE'RE WRONG. I told you I'd read it too and want to read it again (I do, but I lent out my copy and doubt I will get it back). \nYou asked me what I thought of his other books and -- if I'd been on for another stop -- I would have asked you about whatever else you tend to read. I bet you have pretty good taste. Maybe we like more books in common? \nIf you see this: you wear yellow well. \nKeep smiling :)    ","title":"C Train rider -- You've probably read some good books too","url":"https://newyork.craigslist.org/brk/mis/d/train-rider-youve-probably/6598705969.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI think about you quite a bit. You moved to la but if you ever come back i'd love to see you again.    ","title":"Kristen i miss you","url":"https://newyork.craigslist.org/brk/mis/d/kristen-miss-you/6598636646.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou got on big sunglasses that covered that beautiful angelic face and stunning beauty can not stop thinking about you. You was sleeping and waking up to check your phone. You wearing black and red lumber jack style long sleeve with blue jeans and white canvas sneakers. I was standing in front you by the door, yankee gray cap, when you got off at Mosholu 5/22/18..I want to get to know you if that even possible. if not your beauty will haunt me for the rest of my life... NO SPAM NO SPAM FOH This message pertain to one person i am looking send pic to avoid not getting a response..    ","title":"Mosholu","url":"https://newyork.craigslist.org/brx/mis/d/mosholu/6598623259.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDiana...we met randomly while crossing a gridlocked street. You brightened my day with your friendliness and upbeat attitude. We parted at Mott and Canal.\nI'd love to continue our conversation.\nWhich rap star did I compare you with?\nI hope this reaches you\nDavid    ","title":"We spoke while walking thru Chinatown","url":"https://newyork.craigslist.org/mnh/mis/d/we-spoke-while-walking-thru/6598631813.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nEnjoyed meeting, even with another in the way. Would like to continue. Describe your clothing so I'll know you. Guy w/ glasses and jeans here.    ","title":"May 24 SOS W26 St -- Tall Hairy Guy","url":"https://newyork.craigslist.org/mnh/mis/d/may-24-sos-w26-st-tall-hairy/6598630930.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe caught eyes and smiled for a prolonged moment through the window at Hungry Ghost cafe.  I was meeting with someone for work and you were with a friend.  I was  completely stunned and can't get you out of my mind.    ","title":"Short haired beauty with blue tattoo","url":"https://newyork.craigslist.org/brk/mis/d/short-haired-beauty-with-blue/6598616670.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe passed by each other and glanced - my heart stopped. I wish id said something because you were so pretty.\n\nI was the guy in all black. If by any chance you see this get in touch.    ","title":"Girl in union square thurs around 8pm","url":"https://newyork.craigslist.org/mnh/mis/d/girl-in-union-square-thurs/6598610546.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSorry I was so preoccupied on my phone call. You said hi  (around 9:30 pm) as you were walking by me....I have to admit I wasn't expecting it and a bit preoccupied with my phone call. \nSo thank you to the beautiful ebony princess for making my night.    ","title":"You said hi while crossing president","url":"https://newyork.craigslist.org/brk/mis/d/you-said-hi-while-crossing/6598541356.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi! Alex. You asked me if I drank and when I said yes, pulled out a bottle of wine from your bag and offered it to me. After some banter about you being a kind stranger, cats and you not poisoning me, I had to get off. Thanks for the wine! Sorry I didn't get your info. Maybe we can drink some together soon?    ","title":"2 train uptown wine bottle guy","url":"https://newyork.craigslist.org/brx/mis/d/2-train-uptown-wine-bottle-guy/6598529334.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaw you in my building yesterday in Battery Park City today again.  We got stuck at Chambers St 2 weeks ago.  And we both got off the train. You went uptown, I went back downtown. You work in film production, I showed you pics of my art .  We def had a connection,   \nId love to know more about you. Let me know if you see this.  We texted a couple times. I said you belong to the STRC. lol, you know what that means. Lets hang out    ","title":"Battery Park City","url":"https://newyork.craigslist.org/mnh/mis/d/battery-park-city/6598524708.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were billed as The Georgia Peach. You worked at the Gaity Theatre when it was a strip club in 1971. We met when a car rear-ended my car in front of the theatre. You ran over and diffused a fight. We saw each other a few times after that. Just wondering if you are still alive. I moved down to Miami soon after, and lost touch. I remember you were friends with Brandy Stevens, who I ran into in Miami Beach in the fall of 1971.    ","title":"KAREN THOMAS-BUENO","url":"https://newyork.craigslist.org/mnh/mis/d/karen-thomas-bueno/6579375237.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOn Jan 12 about 12;30 pm in long island i was the guy behind you and you know who am i please call me or email me i lost your number    ","title":"i saw you at the cemetery. Afghan guy","url":"https://newyork.craigslist.org/que/mis/d/saw-you-at-the-cemetery/6598512820.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nyou had your phone in your shirt pocket and i sat across from you. \n\nstill thinkin about it.    ","title":"Guy in a blue polo on the BK 2 train","url":"https://newyork.craigslist.org/brk/mis/d/guy-in-blue-polo-on-the-bk-2/6598509266.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was walking north on Riverside Dr. with a friend around 8pm Thursday 5/24. I was wearing a blue dress and carrying a duffle bag. You were on a bike going south, wearing a yankees cap.\n\nWe made eye contact and continued to-- even though you had already biked passed me! Right before disappearing we waved to each other. \n\nI would love to see you again.\n\n\n    ","title":"Long eye contact with cute boy on bike (Riverside Dr. & 92nd/93rd)","url":"https://newyork.craigslist.org/mnh/mis/d/long-eye-contact-with-cute/6598508310.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe were on the A train last night; you were wearing a Brooks Brothers type suit and looked quite handsome.  You kept staring at my fishnets.  We smiled to each other. I was too nervous to say hello.  Love to have a glass of wine and talk more about fishnets.    ","title":"Saw you on the subway","url":"https://newyork.craigslist.org/mnh/mis/d/saw-you-on-the-subway/6598492464.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI know this is a long shot but nothing ventured....I told you I had 'hair envy' you told me you loved tall men and asked me my height. Your braid was below your waist!    ","title":"A giant and a long haired  beauty at The Bakery","url":"https://newyork.craigslist.org/lgi/mis/d/giant-and-long-haired-beauty/6598469397.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI wish I could speak to you again. I wish I could let you know that what you did to me behind my back is forgiven. I just wanna hold you and tell you it's okay. I have been mending the friendships I destroyed up while in my last relationship. I still want to be in your life one way or another. I wanna hear your voice again, see how much you've changed, help you in life, give you advice, inspire you even. I'm at a point now where I can do so much more for you than I ever been able to~\n\nI'm friends with the tree again\nAnd I know y'all speak\nSo let's meet\nTake it slow\nAnd get to know each other again    ","title":"maybe see what i have to say? im not mad.","url":"https://newyork.craigslist.org/brx/mis/d/maybe-see-what-have-to-say-im/6598490011.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou had great shoes and round-eyed brown glasses with some facial hair. \nYou were sitting down in the middle of the train, and I was the girl reading \"A Lover's Discourse,\" a hard covered green book, dressed all in black (and a pale brunette). \nWe kept looking at each other and grinning. I was about to give you my number when I got off at 23rd, but chickened out. \nMaybe this will work?    ","title":"M Train - Monday Morning, You Were Wearing Round Glasses","url":"https://newyork.craigslist.org/mnh/mis/d/train-monday-morning-you-were/6598491579.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI've never done this before. I got into the 1 train at 59th and stood next to you. You were holding something that looked like a sculpture, and a shoulder bag, red shoes, pretty eyelashes. You stepped out a few times with it for people to get off at their stop, with a really radiant smile. Some people on the train smiled at you and I couldn't help but smile to myself. I had a crush on you immediately. I kept trying to glance at you but I didn't wanna give myself away, I'm shy. I was planning to tell you you're beautiful if my stop was before yours but you got off. I thought you kept glancing at me but maybe just like me you're just curious about the whole train. Maybe this is hopeless and you aren't even queer. You are a stunning person    ","title":"Girl who got off at 125th (1)","url":"https://newyork.craigslist.org/mnh/mis/d/girl-who-got-off-at-125th-1/6598459209.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI am a white male 50 yrs old you were about a 40 year old women and you looked at my black leather pants intensely with interest You wanted to say something but you were too shy Lets talk    ","title":"I was wearing leather pants you stared m4w","url":"https://newyork.craigslist.org/mnh/mis/d/was-wearing-leather-pants-you/6598429780.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI found a museum notecard with a Monet painting on the cover 2 years ago, a beautiful, handwritten note from a gentleman named Henri to, presumably, a woman named Betty (her name was on the envelope cover).  I've been trying to find them ever since and only have first names to go on.  If either of you see this, or anyone knows of these two, please get in touch.\n\nMany thanks!    ","title":"Henri, you wrote a love note to Betty many years ago that I just found","url":"https://newyork.craigslist.org/mnh/mis/d/henri-you-wrote-love-note-to/6598419134.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were in the LIRR train from Port Washington to Penn Station tonight around 9 pm.  I sat close to you but said nothing unfortunately.  You looked stunning in a gorgeous spring dress. Let me know what color dress you wore so I know it is you.  Would love to connect.    ","title":"Port Washington LIRR to Penn","url":"https://newyork.craigslist.org/lgi/mis/d/port-washington-lirr-to-penn/6598418876.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nGuy with pink t shirt on F train heading to Brooklyn, black and silver hair on the sides ,light  brown eyes, tan.  He was so HOT and he had his black military style shoulder bag between his legs with a cap that said COMBAT VETERAN on the floor. when I look at his cap I noticed how amazing he really was, WOW. I'd love to have a drink with him he looked like we could have a great time. If you read this get BACK to me we will not regret it. GUARANTEED!    ","title":"Man in pink shirt","url":"https://newyork.craigslist.org/mnh/mis/d/man-in-pink-shirt/6598414266.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou couldn't keep your eyes off my bulge. We made quick eye contact, smiled and then I had to get off train    ","title":"Cute brunette on A train (14th st)","url":"https://newyork.craigslist.org/mnh/mis/d/cute-brunette-on-train-14th-st/6598395674.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi we were on the same flight from Toronto to LaGuardia.\nYou were coming here to visit your son.\nWe spoke of Dalian and Harbin.\nI'm John    ","title":"Flight from Toronto to LaGuardia","url":"https://newyork.craigslist.org/mnh/mis/d/flight-from-toronto-to/6598394157.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe exchanged a smile on my way out of the locker room. I was too nervous to say hi.\n\nWould love a second chance if you can tell me what I was wearing :)    ","title":"Bond St Equinox 7pm (m4m)","url":"https://newyork.craigslist.org/mnh/mis/d/bond-st-equinox-7pm-m4m/6598330150.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe caught eyes while crossing the street this afternoon at about 5:45 and I felt like I had the wind knocked out of me. I regret not turning around to see if you were looking back too. You're tall, dark, and handsome. Tell me what direction you were headed in and what side of the street in your reply. I'd love to have drinks and maybe more...let's see where it goes.    ","title":"Caught eyes at 28th and Madison W4M","url":"https://newyork.craigslist.org/mnh/mis/d/caught-eyes-at-28th-and/6598304278.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe connected so effortlessly and this is probably pointless but just in case, what pizza flavors did we eat?    ","title":"Purple T Shirt (in honor of Prince?)","url":"https://newyork.craigslist.org/mnh/mis/d/purple-shirt-in-honor-of/6598300447.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur eyes meet, then we exchanged smiles, I could see your eyes move up and down my chiseled frame, and I can tell that you felt the electricity too, but unfortunately I had to leave.  I cannot get that smile out of my mind.  \n\nI'm A 6'0 Athletic body shaved head with a beard. \n\nSo I know its the right woman tell me what mall, and any other details, color of my shirt etc.    ","title":"You're a female working at American Eagle...","url":"https://newyork.craigslist.org/lgi/mis/d/youre-female-working-at/6598274943.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI saw you looking over at me a few times but when we met eyes you stopped. You were wearing skull candy headphones and a black sweatshirt. Tell me what I was wearing so I know it's you.    ","title":"Penn station - Long Island","url":"https://newyork.craigslist.org/lgi/mis/d/penn-station-long-island/6598237584.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI've never done this before, but you had a lovely smile and I was hoping to keep talking. If you were too, reply with what I do for work and let's take a walk in the park? \n\nCheers, \nBehind You In Line    ","title":"Cute dress at the Church Ave post office","url":"https://newyork.craigslist.org/brk/mis/d/cute-dress-at-the-church-ave/6598200763.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi!\n\nResponding to your ad about the wink on the subway (last Thursday night 5/17). Wanted to see if this was the same person. \n\nYou were holding something in your hand when you winked. What was it?    ","title":"Wink on the train last Thurs night(5/17)","url":"https://newyork.craigslist.org/mnh/mis/d/wink-on-the-train-last-thurs/6598178512.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI got on the A at 145th at around 8:30AM. You were standing like me, had sunglasses, a Zara bag and perhaps a gray sweater. At some point, you took the glasses off, then there was an announcement about weekend disruptions and we both stared incredulously when they mentioned perhaps taking an Uber, but no bus. We had a short chat about DOT and co., then you got out at 42nd. \n\nI'm posting here because, of course, I'd like to talk to you again.    ","title":"On the downtown A this 8:30AM, m4w","url":"https://newyork.craigslist.org/mnh/mis/d/on-the-downtown-this-830am-m4w/6598142852.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe both got off the A train, you were walking ahead till I walked past you and your whistling made me turn around, I popped my headphones out of my ear, and listened and when we got the light on Atlantic, you spoke to me and asked me if I whistled... wish we could have spoken more, don't know if we have anything in common but if you see this and you want to get to know me too, send me a message? \n\nPut in the title the street we parted ways at.    ","title":"Gifted Whistler","url":"https://newyork.craigslist.org/brk/mis/d/gifted-whistler/6598122939.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIf you see this I would be very interested in seeing you again.    ","title":"Noticed you at the Starbucks on 46th, between 5th & 6th - m4w","url":"https://newyork.craigslist.org/mnh/mis/d/noticed-you-at-the-starbucks/6586138501.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe were on the LES when you passed me by and said beautiful dog.\nI said you were beautiful too. We both looked embarrassed.\nMaybe I should have said more...I wish you did.\n\n    ","title":"my beautiful dog","url":"https://newyork.craigslist.org/mnh/mis/d/my-beautiful-dog/6598076391.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nmany years ago. Many phones later have lost touch and your #. Would love to reconnect    ","title":"asian girl in Harlem. You were a writer and we met on okcupid","url":"https://newyork.craigslist.org/mnh/mis/d/asian-girl-in-harlem-you-were/6582426866.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou arrived for your workout in hospital scrubs. I had finished my workout. We chatted at the sink. I sensed we might get along. Tell me something about me and our interaction so that I know it is you.    ","title":"95th & Bway NYSC, UWS, Thurs 11 am","url":"https://newyork.craigslist.org/mnh/mis/d/95th-bway-nysc-uws-thurs-11-am/6597959365.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou wore a man bun and in a brief conversation you indicated you were from Norwalk. Didn't have a chance to get more info.  If you reply indicate where the party was and stats and I will respond    ","title":"You were at a party on Saturday May 5th","url":"https://newyork.craigslist.org/fct/mis/d/you-were-at-party-on-saturday/6597901418.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYesterday evening (5/23) around 6:30p I was riding my bike up riverside and we stared at each other as you were crossing the street toward riverside park. I believe you were walking with a women but couldn't really tell. As I rode by I looked back only to notice you were still starring at me.\n\nYou: Tan, handsome, slim, buzz cut hair, plaid button down shirt and trousers.\n\nMe: Tan, cyclist build, sunglasses, black helmet, black tee and shorts.\n\nWhat color was my bike and tires? \n\nGive me a buzz if you see this and would like to link up.\n\n\n\n\n    ","title":"Double take on riverside drive","url":"https://newyork.craigslist.org/mnh/mis/d/double-take-on-riverside-drive/6597848278.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI doubt you'll see this, but anyway.. you gave me a ride Wednesday 5/23. I really enjoyed talking to you, even for that brief time. You have a fun personality and I'd like to get know you more. Hopefully great minds will think alike (as you said), and you will feel the same    ","title":"Christy the Lyft driver","url":"https://newyork.craigslist.org/mnh/mis/d/christy-the-lyft-driver/6597765264.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met on the train back home from Penn Station, you stopped in Newark to take your connecting train.  You are incredibly beautiful, funny, and charming.  We discussed our travels amongst other things.  I truly enjoyed every second of our encounter, and would love to take you out sometime.  As I'm moving from NJ to Manhattan, we should meet sometime after work.  Tell me what we each majored in college so I know it's you.    ","title":"Spain / NJ Transit","url":"https://newyork.craigslist.org/mnh/mis/d/spain-nj-transit/6597738880.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe played a game of squash once and we went back to my place two minutes away. You were the married guy with the hairy chest. Tell me the color of my shirt, because I'd love to invite you back to finish the game.    ","title":"Dark-Haired Irish Guy- 4 Seasons Racquet Club","url":"https://newyork.craigslist.org/fct/mis/d/dark-haired-irish-guy-4/6597662575.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThere's just no way you will see this but I'll give it a shot.  You were the Dominican girl on the 1 train going downtown from 230th.  You have one a burgundy tank top and black pants and some beige or grey boots.  I was standing by you wearing all navy blue uniform.  My goodness I really wanted to say something ... anything but I'm not a morning person and I would have made myself look stupid.   \n\nYou are really beautiful with a amazing body , you def workout, with black hair.   Hope you see this    ","title":"1 train this morning","url":"https://newyork.craigslist.org/mnh/mis/d/1-train-this-morning/6597653994.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n7:00 am I saw you you saw me. You walked towards seven, I had to head to e train. Shared kind smiles.\n\nWhat if?    ","title":"Teacher/ public school proud button","url":"https://newyork.craigslist.org/brk/mis/d/teacher-public-school-proud/6597651778.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi, Going to Long island is what I wanted to say to you. You were an asian girl, dressed in a  brown one piece dress. Looked good. Maybe 20 to 25.  Me, a white guy, wearing a blue jacket and a small nap sack that was a bright orange color that said Bahamas on it. The time was 9:30. I was waiting for the 9:42 train. This was on Wednesday.  If you find this, write me.    ","title":"Wanted to say Hi","url":"https://newyork.craigslist.org/mnh/mis/d/wanted-to-say-hi/6597630356.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou're the most beautiful charming waitress.    ","title":"Fish and Lobster Co.","url":"https://newyork.craigslist.org/brk/mis/d/fish-and-lobster-co/6597630197.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou started off with the classic Pasty Cline, then slowly transitioned to Dolly Parton and had my heart. Whomever you are blasting country bangers in the backyard on this wonderful evening, thank you for being the Southern Belle you are! Hopefully you're a cute little souther queer, too. Thank you for this cute little gift tonight and here's to many more. xoxo\n\n-A    ","title":"Wednesday Night Country Bangers Seranading - M4M","url":"https://newyork.craigslist.org/brk/mis/d/wednesday-night-country/6597570833.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe caught eye contact . \nI noticed and i winked at you and you smiled, i smiled back . \nYou had 2 heart balloons with the string around your wrist . \nI guess you didnt hear me when you walked out but i didnt want to be awkward following you .  \nHope you find this .    ","title":"F Train to 71st","url":"https://newyork.craigslist.org/que/mis/d/train-to-71st/6597567473.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe kept making eye contact as I was sitting on some steps. You turned and smiled. I beckoned and you kept walking. We were both too proud to follow. If you wished we'd followed our intuition hit me up.    ","title":"We had a moment at Bedford and Grand","url":"https://newyork.craigslist.org/brk/mis/d/we-had-moment-at-bedford-and/6597560410.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI should of returned the googly eyes you were giving me.\n\n- Yellow dress with the takeout    ","title":"Guy at Dutch Burger, blond hair in ponytail w/shorts","url":"https://newyork.craigslist.org/brk/mis/d/guy-at-dutch-burger-blond/6597554399.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI noticed you on the platform and was excited to walk a short way with you.  You turned up the street at 46th Street and I was hoping for more time to think of something to say to you.  I'm a tall lass with silver hair and you are handsome with an eye patch.  I've never used this site but it seems romantic to imagine that you might be looking for me too.    ","title":"Sunset Park -- we exited at 45th Street together","url":"https://newyork.craigslist.org/brk/mis/d/sunset-park-we-exited-at-45th/6597547082.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt's simple, lets get engaged/married!!!    ","title":"re: Jesus christ girl","url":"https://newyork.craigslist.org/brk/mis/d/re-jesus-christ-girl/6597527594.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is the most long shots of long shots. I was on the 4/5 platform at Grand Central heading uptown at 8:12 on Wednesday, 5/23. This guy and I locked eyes--he's on the downtown platform-- and smiled at each other a few times. He was wearing a blue button down. If you can email me and tell me what I was wearing, what my hair color is, and what type of purse I was carrying ... then maybe I'm the lucky one.    ","title":"At Grand Central","url":"https://newyork.craigslist.org/mnh/mis/d/at-grand-central/6597512584.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nLost on i-95 somewhere in between Washington & Wyoming on an\nimprovised imaginary road trip we were holed up in an\norwellian hot house reading magazines\nand roasting\n\nin our silver snow suits with\nred cross back\npacks \n\n\n    ","title":"You mentioned \"Lost in Space\"","url":"https://newyork.craigslist.org/brk/mis/d/you-mentioned-lost-in-space/6597512142.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was wearing a black Lacoste shirt with short shorts. My hair was black and slicked back. I was listening to music waiting outside of grand central. We both looked at each other then I got shy and looked down.\n\nYou walked passed me and kept turning around and smiling while walking. You kept smiling but I was to nervous to look back at you.\n\nYou were a white male wearing a suit    ","title":"I was wearing a black Lacoste shirt","url":"https://newyork.craigslist.org/mnh/mis/d/was-wearing-black-lacoste/6597508169.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou dont play fair do you? Lmao . What am I to do.        \n\n  -__-    ","title":"Jesus christ girl","url":"https://newyork.craigslist.org/mnh/mis/d/jesus-christ-girl/6597419305.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was focused on what I was doing so I didn't realize how beautiful you are until the last minute. I'm sure I'm not your type, but I'd love to buy you a coffee sometime.    ","title":"Pink converse on a warm train","url":"https://newyork.craigslist.org/wch/mis/d/pink-converse-on-warm-train/6597463592.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYOU TUBE=We Were Soldiers - Speech (I'm a Combat Veteran) U.S. ARMY I fly the U.S.A. and POW flag in my front yard Let use remember our falling BROTHERS AND SISTERS. (It's about the ones that didn't make it back)    ","title":"Memorial day week Let's remember our falling soldier","url":"https://newyork.craigslist.org/brk/mis/d/memorial-day-week-lets/6597336837.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI had seen you at work a few months ago and something about you captivated me. I didn't get to interact with you, but something left me intrigued. Not a fan of AutoZone, but went back a few times in hopes of seeing you again, but to no avail...until yesterday, 5/17. Unfortunately you weren't on the register, but I felt that we made eye contact a few times and there was \"something\", although I am not sure what...\n99% chance you will never see this, but I felt I needed to do something to get it off my chest.    ","title":"Autozone","url":"https://newyork.craigslist.org/wch/mis/d/autozone/6597328697.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe locked eyes before you went down to the ACE at 43rd St, around 4:45. We shared a smile, and you said \"have a good day\" -- I wished you the same, but then instead wished I was getting on the same train to find out what your day entailed. \n\nYou had cute glasses, a blue button down, and simple, kind smile. If you happened to keep thinking about the redhead you passed, email me and let me know about your day!    ","title":"Have a nice day on 43rd St","url":"https://newyork.craigslist.org/mnh/mis/d/have-nice-day-on-43rd-st/6597286014.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe had eye contact as you were turning onto 100 off Chappaqua rd today.. and a big smile! I was in the big truck..    ","title":"Rt 100 and Chappaqua rd.","url":"https://newyork.craigslist.org/wch/mis/d/rt-100-and-chappaqua-rd/6597242198.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe used to go to the same gym in East Harlem.\nAlways enjoyed working out & chatting with you.\nSorry I neglected to ask you for your  # when I began using another gym.\n\nWould love to re-connect and become re-acquainted.\nHope to hear from you.    ","title":"Haitian Guy from Gym","url":"https://newyork.craigslist.org/mnh/mis/d/haitian-guy-from-gym/6597233253.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nARTIST IN SEARCH OF LOVE STORIES!\n\nHave you carved your name or initials as a declaration of love in the cement sidewalks of New York City?\n\nPlease come forward to contribute your love story (whether romantic, friendship, of familial) to an art project about the hidden love stories on the sidewalks of Manhattan.\n\nBe part of a unique portrait of love in NYC!\n\nIf you submit your love story:\n- you will receive a signed and small edition photograph of your heart/declaration of love.\n- your love story will be included in the project, Concrete Hearts of Manhattan.\n- you will be credited for your contribution. (Stories may also be submitted with first names only or anonymously.)\n\nDetails to include:\nWhere is your heart/declaration of love located?\nWhen did you make it?\nWho is it for?\nWhat made you decide to carve a heart/declaration of love?\nTell us your love story.\n\n(Please only submit if you actually carved a heart or other declaration of love or had one carved for you - real love stories only please!)\n\nOf particular interest are hearts in:\nGreenwich Village, the East Village, the West Village, and NoHo,\nbut ANY HEART in ANY SECTION of the city will be included in the project as long as it can be photographically documented.\n\nThis is a unique opportunity for you to share your love story with the world!\n\nFurther opportunities for your participation and recognition are possible.\n\nIf you have questions before you're ready to share your story - please contact me!\n\nShare the love,\nMeg\n\nMeg is an artist in NYC who undertook a two-year artistic journey walking every sidewalk between 14th St. and Houston St. to photograph the declarations of love discovered in concrete. These streets comprise the neighborhoods of Greenwich Village, the East Village, the West Village, and the small neighborhood of NoHo. Approximately 102 miles were walked with a total of 1182 hearts found.\n\nVISIT TO VIEW THE PROJECT: meglyding(dot)com/concrete-hearts    ","title":"Have you carved a heart in the cement of a NYC sidewalk?","url":"https://newyork.craigslist.org/mnh/mis/d/have-you-carved-heart-in-the/6597228460.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nARTIST IN SEARCH OF LOVE STORIES!\n\nHave you carved your name or initials as a declaration of love in the cement sidewalks of New York City?\n\nPlease come forward to contribute your love story (whether romantic, friendship, of familial) to an art project about the hidden love stories on the sidewalks of Manhattan.\n\nBe part of a unique portrait of love in NYC!\n\nIf you submit your love story:\n- you will receive a signed and small edition photograph of your heart/declaration of love.\n- your love story will be included in the project, Concrete Hearts of Manhattan.\n- you will be credited for your contribution. (Stories may also be submitted with first names only or anonymously.)\n\nDetails to include:\nWhere is your heart/declaration of love located?\nWhen did you make it?\nWho is it for?\nWhat made you decide to carve a heart/declaration of love?\nTell us your love story.\n\n(Please only submit if you actually carved a heart or other declaration of love or had one carved for you - real love stories only please!)\n\nOf particular interest are hearts in:\nGreenwich Village, the East Village, the West Village, and NoHo,\nbut ANY HEART in ANY SECTION of the city will be included in the project as long as it can be photographically documented.\n\nThis is a unique opportunity for you to share your love story with the world!\n\nFurther opportunities for your participation and recognition are possible.\n\nIf you have questions before you're ready to share your story - please contact me!\n\nShare the love,\nMeg\n\nMeg is an artist in NYC who undertook a two-year artistic journey walking every sidewalk between 14th St. and Houston St. to photograph the declarations of love discovered in concrete. These streets comprise the neighborhoods of Greenwich Village, the East Village, the West Village, and the small neighborhood of NoHo. Approximately 102 miles were walked with a total of 1182 hearts found.\n\nVISIT TO VIEW THE PROJECT: meglyding(dot)com/concrete-hearts    ","title":"Have you carved a heart in the cement of a NYC sidewalk?","url":"https://newyork.craigslist.org/mnh/mis/d/have-you-carved-heart-in-the/6597223826.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nARTIST IN SEARCH OF LOVE STORIES!\n\nHave you carved your name or initials as a declaration of love in the cement sidewalks of New York City?\n\nPlease come forward to contribute your love story (whether romantic, friendship, of familial) to an art project about the hidden love stories on the sidewalks of Manhattan.\n\nBe part of a unique portrait of love in NYC!\n\nIf you submit your love story:\n- you will receive a signed and small edition photograph of your heart/declaration of love.\n- your love story will be included in the project, Concrete Hearts of Manhattan.\n- you will be credited for your contribution. (Stories may also be submitted with first names only or anonymously.)\n\nDetails to include:\nWhere is your heart/declaration of love located?\nWhen did you make it?\nWho is it for?\nWhat made you decide to carve a heart/declaration of love?\nTell us your love story.\n\n(Please only submit if you actually carved a heart or other declaration of love or had one carved for you - real love stories only please!)\n\nOf particular interest are hearts in:\nGreenwich Village, the East Village, the West Village, and NoHo,\nbut ANY HEART in ANY SECTION of the city will be included in the project as long as it can be photographically documented.\n\nThis is a unique opportunity for you to share your love story with the world!\n\nFurther opportunities for your participation and recognition are possible.\n\nIf you have questions before you're ready to share your story - please contact me!\n\nShare the love,\nMeg\n\nMeg is an artist in NYC who undertook a two-year artistic journey walking every sidewalk between 14th St. and Houston St. to photograph the declarations of love discovered in concrete. These streets comprise the neighborhoods of Greenwich Village, the East Village, the West Village, and the small neighborhood of NoHo. Approximately 102 miles were walked with a total of 1182 hearts found.\n\nVISIT TO VIEW THE PROJECT: meglyding(dot)com/concrete-hearts    ","title":"Have you carved a heart in the cement of a NYC sidewalk?","url":"https://newyork.craigslist.org/mnh/mis/d/have-you-carved-heart-in-the/6597224559.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThat super interesting person I meet at the Drift on Monday. Totally forgot to give you my number, be great to see you again and talk more Philosophy and History...    ","title":"The Drift - History and Philosophy","url":"https://newyork.craigslist.org/brk/mis/d/the-drift-history-and/6597177196.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI've been trying to get in touch with you.\nIf by chance you see this,write back,I would love to get together!    ","title":"Tonia,write back,its Marcus","url":"https://newyork.craigslist.org/brx/mis/d/toniawrite-backits-marcus/6597132723.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were coming from work and waiting for your boyfriend. You had a great black dress on and we talked about sunglasses ( recently not needing them:(. )\n\nYou were smart, fun and had a great spark. Let's meet again. Are you in Manhattan today after work to meet for a drink. Let's laugh and flirt.  No agenda. I don't care that you are attached. As we know I am too.\n\nI am 5'11, with short brown hair and dark brown eyes..I was wearing a grey suit and checkered shirt. Mid 40s.  Send me a note.  \n\n    ","title":"Woman at the Moxi Hotel Rooftop Monday","url":"https://newyork.craigslist.org/mnh/mis/d/woman-at-the-moxi-hotel/6597125632.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHow do you know?\nHow would I know?\nYou could be anyone\nI could be anyone\n\n    ","title":"book hrt","url":"https://newyork.craigslist.org/mnh/mis/d/book-hrt/6596970232.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOn Monday 5/14 around 5:30pm there were two of you doing some type of photo shoot on York St. between Adams and Washington on the sidewalk in front of the graffiti wall. You were doing acrobatic poses like handstands and cartwheels etc.\n\nIt was very interesting work and I'd like to know more about it. Please contact me, thanks.    ","title":"Two young women doing a photoshoot in DUMBO Brooklyn","url":"https://newyork.craigslist.org/brk/mis/d/two-young-women-doing/6589296633.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe passed each other on the stairs of the Christopher Street subway stop last night around 9pm. We made eye contact a few times, you smiled an adorable smile, and now I can't get you out of my mind.    ","title":"Christopher Street stop","url":"https://newyork.craigslist.org/mnh/mis/d/christopher-street-stop/6596857390.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nwe were both riding the crowded J this morning, around 9am. I was wearing an oversized white shirt and trying desperately not to spill hot coffee on my commute neighbors. you've got thoughtful eyes, and were reading a book I love. I wanted to say something but... I chickened out! did you notice me? reply with what book you were reading & the last song you listened to. maybe we can go to Topos one day... xx    ","title":"thoughtful eyes on the J","url":"https://newyork.craigslist.org/brk/mis/d/thoughtful-eyes-on-the/6596835267.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou and I stood next to each other on the way into grand central today. What song was stuck on your iTunes?\n\nI can't get your smile out of my head...or your sexy arms.    ","title":"Uptown Express 4/5","url":"https://newyork.craigslist.org/mnh/mis/d/uptown-express-4-5/6596788562.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI hope you are single, \nI am divorced\ngreat talk we had....we're both legal eagles...\nlets connect...\n    ","title":"teddybear in back of me inhis 50s buying bagels..","url":"https://newyork.craigslist.org/mnh/mis/d/teddybear-in-back-of-me-inhis/6593660321.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIf anyone knows Sonia please contact me. I really really need to have a conversation with her. Tell me where she worked, lived or anything to identify that this is the Sonia I'm looking for. She Puerto Rican and lived uptown B.X. around 2001, has family in Connecticut. I know that's a long time ago.    ","title":"Sonia Rivera","url":"https://newyork.craigslist.org/brx/mis/d/sonia-rivera/6596699846.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI wanted to give you my contact info...    ","title":"Seeking mother / daughter from Slovakia that I went to Seth Meyers w/","url":"https://newyork.craigslist.org/mnh/mis/d/seeking-mother-daughter-from/6596708956.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were at the diner on Broadway waiting on your ex. Did he finally make it? You were stunning and I should have asserted myself, but you said you were waiting for him, so I gave you space. I hate to think you waited there much longer, you don't deserve that, but I also hope he never showed, for my sake.  Where were you from again? What were you drinking?    ","title":"At the Diner","url":"https://newyork.craigslist.org/mnh/mis/d/at-the-diner/6596653729.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou living in my building probably you just moved here . we make eye contact every now and then tonight bout 10 pm you were heading out to do laundry........... then you came back after finishing the laundry............. lets talk    ","title":"We made eye contact several times......","url":"https://newyork.craigslist.org/wch/mis/d/we-made-eye-contact-several/6596629959.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is the longest of shots. I believe your name is Fabian Ortiz. My name is Kyle. We talked years ago.  I live in Ottawa.  We were super into each other.  I thought about you.  I remember that you played piano. Had muscles, didn't have much social media.  It never worked out between us.  Part of me wishes it had.  Are you out there somewhere, thinking of me?    ","title":"Fabian Ortiz? It's Kyle","url":"https://newyork.craigslist.org/mnh/mis/d/fabian-ortiz-its-kyle/6596623469.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nhello Ryan. i want to see you again. I miss you.    ","title":"Looking for Ryan Mandela","url":"https://newyork.craigslist.org/fct/mis/d/looking-for-ryan-mandela/6596613940.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIs it you? I hope so. I am sorry I didn't have the guts to say something. If it's you, email me saying why we started talking to prove your identity.    ","title":"Blue eyed kind blonde guitarist 85th and Columbus 10pm","url":"https://newyork.craigslist.org/mnh/mis/d/blue-eyed-kind-blonde/6596612478.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were are the same event I attended. We were both talking to different people, but kept exchanging glances. Maybe some other time and place?    ","title":"Brunette with glasses at Scandinavian house","url":"https://newyork.craigslist.org/mnh/mis/d/brunette-with-glasses-at/6596607176.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe sat next to each other tonight. You had a brown hat pulled just over your eyes, which gave me a chance to look at you without you knowing. Hope to see you again.    ","title":"Metro North","url":"https://newyork.craigslist.org/wch/mis/d/metro-north/6596557047.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaw you on the platform at Columbus Circle, thought you were beautiful. We sat next to each other on the B riding to Dekalb where we both got off. You walked upstairs I transferred to the R. You hit me by accident as you reached in your back pocket for your phone. We looked at each other, shared a smile and you apologized. You had a sweet smile and kind eyes. You had paint on your pants and read a book titled \"Sputnik Sweetheart\". I wanted to ask you about the book or the paint on your jeans, but I was too shy. I'm an artist as well and went to Pratt. Sputnik are you out there?    ","title":"Columbus Circle to Dekalb: Tuesday 8pm","url":"https://newyork.craigslist.org/brk/mis/d/columbus-circle-to-dekalb/6596526338.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSaw you on the platform at Columbus Circle, thought you were beautiful. We sat next to each other on the B riding to Dekalb where we both got off. You walked upstairs I transferred to the R. You hit me by accident as you reached in your back pocket for your phone. We looked at each other, shared a smile and you apologized. You had a sweet smile and kind eyes. You had paint on your pants and read a book titled \"Sputnik Sweetheart\". I wanted to ask you about the book or the paint on your jeans, but I was too shy. I'm an artist as well and went to Pratt. Sputnik are you out there?    ","title":"Columbus circle to Dekalb: Tuesday 8pm","url":"https://newyork.craigslist.org/mnh/mis/d/columbus-circle-to-dekalb/6596518553.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI've seen you a couple of times on bus that travel on 31 st. Q1**\nYou have beautiful long black hair. You're the best part of my morning. We spoke once when train broke and we had to stay in bus. \nYou probably never notice me but I've always wondered if you would let me buy you dinner or a drink. \nNever had the nerve to say hi. \nI notice your great sense of style. But you're eyes. They are mesmerizing. Even though I never had the courage to say something. \nYou will probably never see this but I wanted to say it or write it. \n\nMaybe I'll see you again. One can hope. \nSincerely \nMe    ","title":"31 st bus","url":"https://newyork.craigslist.org/que/mis/d/31-st-bus/6596510319.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou got up and walked past me, I thought you were gorgeous and you have brown eyes    ","title":"18 Ave stop, F train","url":"https://newyork.craigslist.org/brk/mis/d/18-ave-stop-train/6596504140.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nPretty woman on line at the juice press checkout this afternoon. I hesitate to divulge too much since this is such a long shot, but you did order soup    ","title":"Juice Press Tribeca","url":"https://newyork.craigslist.org/mnh/mis/d/juice-press-tribeca/6596502340.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were heading towards Queens on the E train. I got off at 53rd & Lexington before you did. You were wearing a sports jacket, red and black with black sweatpants. You also had a beard, and you had a man-bun. We made eye contact a few times, I was the Asian girl wearing a pink sweater, and I wish I had said hello.    ","title":"E Train, Man-Bun (W4M)","url":"https://newyork.craigslist.org/mnh/mis/d/train-man-bun-w4m/6596502069.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were sitting in front looking out window. You saw me walk by and smile. I looked back realizing you looked and smiled back. You acknowledged  it.  You have great smile. Kicking myself for not turning back to go in and say hi. \nDoubt youll see but heck i got to try.\n    ","title":"Gregorys 640pm. M4M","url":"https://newyork.craigslist.org/mnh/mis/d/gregorys-640pm-m4m/6596464525.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nyou were in line  for  ihop right after  us    you had on white  pants and  white top  you had your  two daughters or nieces  with you i wanted  to ask you for your  number  but out of  respect  i dare not  in front of  your  two young  ladies  , i would like  to meet  and  talk  and meet if  possible       i was  with  two of  my  family  members  there   having  b'fast  before  heading  over  to home depot send  me  a  email  if  you can  and  of course  you see this    ","title":"we smiled at each other Ihop in white plains","url":"https://newyork.craigslist.org/wch/mis/d/we-smiled-at-each-other-ihop/6596440113.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt's your first time in the city and you were looking for corny \"I Heart New York\" stuff, I pointed you in the direction of Chinatown. Wishing I'd asked for your number.\n\nIf you happen to see this, which I doubt, respond with what I warned you of when I saw you. It would be my pleasure to show you around.    ","title":"Vegas Girl at Duane Reade","url":"https://newyork.craigslist.org/mnh/mis/d/vegas-girl-at-duane-reade/6596423846.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe originally met at a bar a few years ago, at the time you were doing puppet shows, we used to have late night meet ups at your place in LES. If you know who this is get back with the name of the bar I worked at in the subject line. And if you want to have some more \"meet ups\"    ","title":"Puppet girl","url":"https://newyork.craigslist.org/mnh/mis/d/puppet-girl/6596392851.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe seen each other in a store,you was with your friend you told her I was gorgeous and I said the same about you,its Tuesday you wore a tan short skirt and glasses I ran after you but you disappeared.    ","title":"Shy beauty","url":"https://newyork.craigslist.org/mnh/mis/d/shy-beauty/6596274386.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI passed you on the corner of madison st & seneca ave, our eyes met and we shyly smiled at one another. You were wearing a band t-shirt, faded black jeans, and a baseball cap. I was wearing a red tee and black jeans, and had my headphones in listening to the magnetic fields' strange powers. I couldn't help but imagine the two of us riding the ferris wheel at coney island together, hands intertwined, eyes speaking volumes but mouths saying nothing, basking in the tender silence. \n\nHelp me make my dreams a reality? Reply with what band t-shirt you were wearing, and whether I was carrying a backpack or not.\n\n:)    ","title":"ridgewood honey in the baseball cap","url":"https://newyork.craigslist.org/que/mis/d/ridgewood-honey-in-the/6596277514.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI see you on most mornings, you get on at union square and get off at Bedford Ave. We occasionally make brief eye contact but nothing more. I'm too nervous to say hi so I just focus on whatever book I'm reading.    ","title":"Brooklyn bound L m4m","url":"https://newyork.craigslist.org/mnh/mis/d/brooklyn-bound-m4m/6596263235.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nGrey tshirt black jeans with holes in the knee.You were the hottest girl in the  audience.should have asked for your number.    ","title":"Springer Show","url":"https://newyork.craigslist.org/fct/mis/d/springer-show/6596224142.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nEvery morning I can't wait to see you get on the train  I always position myself in the area you're going to sit.  When you walk in my heart skips a beat,   something when you are reading on your iPhone I can't help but to stare at you. Especially when you tilt your head back and start listening to music I see the muscles in your forearms and I could tell when you grab something can't get away. let's have coffee sweetie    ","title":"CUTE GUY on F train","url":"https://newyork.craigslist.org/brk/mis/d/cute-guy-on-train/6596160229.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLooking for the very Beautiful and attractive woman walking down 125th street.  You had glasses on , burgundy shirt and gray pants with NYC work ID and sexy figure.  I'm the guy walking by you the whole time dressed in blue work uniform.  I was stuck and couldn't think and nothing to say.  If you see this... msg me.  I would love to chat with you.    ","title":"Just now 125th street Harlem","url":"https://newyork.craigslist.org/mnh/mis/d/just-now-125th-street-harlem/6596140821.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was running late to work so it was around 10am this morning. You were reading a magazine. I think the New Yorker? You had a reddish beard/mustache and a nice work bag. I was sitting across from you with red hair and glasses. We made eye contact a few times but I got off at 28th Street and you didn't chase after me. I would have given you my number!    ","title":"On the downtown W train this morning","url":"https://newyork.craigslist.org/mnh/mis/d/on-the-downtown-train-this/6596052673.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met on the Prospect Park Station on May 3rd. We got off on DeKalb Avenue. You were going to celebrate a birthday with your mom. \nYou were pleasant, proper and you were raised right.\nYou had a head scarf and eye liner.\nSo happy we met; can't forgive myself for not getting or giving contact information.\nPlease. If anyone knows who I am speaking about, PLEASE help!!    ","title":"I should have asked your number - May 3rd!","url":"https://newyork.craigslist.org/brk/mis/d/should-have-asked-your-number/6595916681.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were behind me in long line wearing white T.\nWe chatted about how busy it was.\nMarried here  but like to be friends. Felt like maybe you did too?\nLong shot but here goes...\nNever did this before!\n\n\n    ","title":"Key Food Carroll Gardens Monday","url":"https://newyork.craigslist.org/brk/mis/d/key-food-carroll-gardens/6595827337.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChagrin...snug, and slow as snail-mail screenname.....slugged me.    ","title":"Malnutrition","url":"https://newyork.craigslist.org/mnh/mis/d/malnutrition/6595724004.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTrying to reconnect with an old buddy from E 26th St.........\n\nThis Italian biwmm really misses our pre-dawn get togethers. getting your AOL IM always made my morning, would get it and be by you in 5.....\n\nLong shot but you know who you are...    ","title":"Trying to reconnect with an old friend Spellskipper","url":"https://newyork.craigslist.org/mnh/mis/d/trying-to-reconnect-with-an/6592158257.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis Italian biwmm misses our pre-dawn meetings at my office.......do you    ","title":"We met at my office","url":"https://newyork.craigslist.org/mnh/mis/d/we-met-at-my-office/6583950373.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis is ridiculous, but I wanted so badly to talk to you. I was with my mom; she's visiting the city. You were alone drinking Blue Moon at the bar. My mom and I were at the table near the door and got a few pitchers of beer before the creepy guys at the table next to us came over and wouldn't leave us alone. I was so embarrassed and should have done something about it. I've never posted anything here before, but if by some crazy chance you see this, then please let me know if we could drink together next time. :)    ","title":"BARO in Ktown Mon. 5/21 guy at the bar in grey shirt w/ duffle bag","url":"https://newyork.craigslist.org/mnh/mis/d/baro-in-ktown-mon-5-21-guy-at/6595696062.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was eating a salad in the cafe when I noticed you on the escalator, white paint-stained work pants, button up shirt, buzzed hair. I'm not the type to strike up unsolicited conversation with a stranger. I'm sure you have enough people who are a little too forward in wanting to get to know you. I made a point of walking by, but I doubt you noticed me. I have long curly hair, glasses, and was wearing a black shirt tucked into light blue jeans. I couldn't help but wonder what you do in your free time. I'd love to find out.    ","title":"Whole Foods painted work pants","url":"https://newyork.craigslist.org/brk/mis/d/whole-foods-painted-work-pants/6595695545.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe used to take the bus together all the time and you came over my house discreetly after school a couple times... I lost your number would really like to get together again. We can pick up where we left off. I am home alone this week my parents went on vacation. We were both young latinos we were both very into each other lol I can't believe I am doing this! :p    ","title":"Cardozo student from bus stop","url":"https://newyork.craigslist.org/que/mis/d/cardozo-student-from-bus-stop/6595665439.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was utterly wrong about.....\nI'm sorry for.....\nSome dets pls\n    ","title":"For D","url":"https://newyork.craigslist.org/mnh/mis/d/for/6595628041.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi,\n\nWe sat across from each other. On flight 103 from Abu Dhabi to NY. I wanted so badly to exchange numbers, and to see if you wanted to spend some time with me. I could not get the courage to talk to you. I cant stop thinking about you, and feeling like I missed an opporunity to start an amazing friendship. You are a extremely good looking Asian man. I love to travel, and I am open minded, but sonewhat conservative at the sametime. I am not sure how long you will be in NY. I think I heard you tell a flight attendant you are from Thailand. You were wearing Kaki pants and white sneakers, you were extremely good looking, and seemed to be very reserved. I like you alot.  And my eyes are longjng to see your face. I am here, hoping you see this, and that we could be friends.  We walked side by side for a little while in the airport. I was just not sure how you would respond.  I want to ask you out for movie, diner, and a walk along the promenade.  I would like to get to know you.    ","title":"Asian guy on Etihad flight from Abu dhabi to JFK this morning 103","url":"https://newyork.craigslist.org/que/mis/d/asian-guy-on-etihad-flight/6595650863.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAfter the performance, you struck up a conversation we my friend and I as we were waiting to say our hellos to the band. I was the taller of the two. Afterwards, I tried to see if you were still around, but like so much city magic, you were gone. Maybe a drink with a more extended conversation next time?    ","title":"Ars Nova Lisa Jackson show","url":"https://newyork.craigslist.org/mnh/mis/d/ars-nova-lisa-jackson-show/6595640719.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWhere in the world did you get the idea....for a one stop-shop shop, you bet her. Shop around.    ","title":"When Caldor comes back.","url":"https://newyork.craigslist.org/stn/mis/d/when-caldor-comes-back/6595558985.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe rode the train together across the bridge and I got off at Myrtle/broadway, you did not.\nYou had on denim overalls, vans sk8 hi's, septum ring, brown hair w bangs.\nI had on brown pants, slip on vans, black long-sleeve and glasses.\nI wanted to talk to you but you looked like you started to tear up. \n\n\n    ","title":"bk bound J train cute girl in overalls","url":"https://newyork.craigslist.org/brk/mis/d/bk-bound-train-cute-girl-in/6595615967.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHey again! We caught eachother on the platform at the Prospect stop juat after 4 o'clock. We glanced at eachother after you just came downstairs from Lincoln Road then we both turned around and passed again. This time you gave me a little smile lol. You had a bright red top, comfortable grey shoes and dark blond or light brown hair. You look like fun. Tell me something I had on? Let's go for cocktails?    ","title":"Girl in Bright Red","url":"https://newyork.craigslist.org/brk/mis/d/girl-in-bright-red/6595587084.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nthis morning i tripped about 6 times on the sidewalk in front of mr. kiwis - each time i tripped i gained momentum and ended up falling on my face in the middle of the road. \ndefinitely scary and embarrassing but mostly it was really, really funny.\nhope someone caught me on camera  - lookin 2 become a big internet star.    ","title":"i fell into traffic in bushwick - hoping someone got a video","url":"https://newyork.craigslist.org/brk/mis/d/fell-into-traffic-in-bushwick/6595584759.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWas dancing near you for a few hours during AVB set in the back right. You kept looking at me and acting like you wanted to dance but never made the move. You were with your crew of friends (a few blonde chicks and a few dudes, maybe one was gay). You are white, built and were wearing a black V-neck Tee. I was with a big redhead guy that maybe you thought was my boyfriend but he's not. Tell me what I was wearing....    ","title":"Brooklyn Mirage on Sunday","url":"https://newyork.craigslist.org/brk/mis/d/brooklyn-mirage-on-sunday/6595569616.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou're birthday is approaching \nI honestly hope you have a fun day\nActually, I hope everyday is happy and fun for you. \nI hold no grudges; I know you do though.\n    ","title":"Hey birthday boy","url":"https://newyork.craigslist.org/mnh/mis/d/hey-birthday-boy/6595561230.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt was in the morning today 052118 arounf 10 am, \nI was seated on park bench on the phone\nYou were walking in blue shorts \nI'm interested in meeting    ","title":"Walking on Bwy by Van Cortlandt m4m","url":"https://newyork.craigslist.org/brx/mis/d/walking-on-bwy-by-van/6595551499.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was headed home from work, and saw you on the train. You were quiet and looked at me, and I looked at you, but I turned away until it was time for you to get off.  Anway, I would like to see you again.  Maybe, dinner? drinks?  Something. Lol. Anyway, Im a young, darskin, tatted short dude.  Link me .    ","title":"That Beautiful, yet sad girl I saw on the J train headed to queens WYA","url":"https://newyork.craigslist.org/que/mis/d/that-beautiful-yet-sad-girl/6595492648.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou got on at Union Square, I think, and I was immediately taken with your eyes. They seemed like some mixture of patient and maybe slightly amused but also just over it (the commute/the day/those obnoxious people?), all at once.\n\nYou were clutching a small laundry bag, I think, and your hands seemed statuesque.\n\nYou got off at Morgan, but flashed me a look as you passed by. Was there anything to that?\n\nWhat did I look like/where was I in the train?    ","title":"L train Mn to Bk","url":"https://newyork.craigslist.org/brk/mis/d/train-mn-to-bk/6595516634.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLooking for a man who helped me to pass by a scary homeless yesterday night in tunnel at 191st. You seem to hurry up home so I was afraid to bother but I would like to have a cup of coffee with you :)    ","title":"Looking for a man who helped me pass by a homeless yesterday","url":"https://newyork.craigslist.org/brx/mis/d/looking-for-man-who-helped-me/6595507461.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe sat next to each other by chance. I was going to the Mets game, you were going to work. When you took your earphones off I took it as a green light to say hello. We had a nice talk. I saw something special in you, but my stop came up before I could ask for your number. I've been regretting it since. It's a very long shot, but hopefully you see this. \n\n    ","title":"LIRR to Penn Station - Saturday night 5/19/18","url":"https://newyork.craigslist.org/lgi/mis/d/lirr-to-penn-station-saturday/6595493937.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n'quila manjaro n isle n fiji bu musto son hing a bow la flavour - c.f.    ","title":"T.E.","url":"https://newyork.craigslist.org/mnh/mis/d/te/6595416083.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi- 'twas mid afternoon, the doors opened and I got in from the lobby.\n\nI hope I'm not way off here but I calls it like I sees it, and you just really caught my eye~~~\n\nHow about a 'hello'?\nWere we alone during the ride...?    ","title":"Winston Churchill Elevator","url":"https://newyork.craigslist.org/brx/mis/d/winston-churchill-elevator/6595401188.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou wore a white shirt and disdain for the trains' overcrowding. \n\nI had blue hair and thought I was stronger than inertia. \n\nYou offered your arm to keep me from falling, gave a coy smile and a wink.    ","title":"Saved on the downtown B train.","url":"https://newyork.craigslist.org/mnh/mis/d/saved-on-the-downtown-train/6595398338.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou walked by my table, we locked eyes... \nYou glanced back and I did the same... Then right before you turned into the other dining room area, you looked back yet again-- but this time I FROZE and didn't do the same---- sorry \n\nI keep replaying it though ALL day in my head... Can we maybe try it again ?  :-)    ","title":"Pizza Classica Wed afternoon","url":"https://newyork.craigslist.org/que/mis/d/pizza-classica-wed-afternoon/6590693791.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI saw you drinking gatorade, and a large bottle of smart water, and a coconut water while you were in line at a bodega buying juul replacement cartridges. \n\nYou were dressed really cool in all black, and looked to be about to get a really cool job.    ","title":"To the cool girl with all the liquids...","url":"https://newyork.craigslist.org/mnh/mis/d/to-the-cool-girl-with-all-the/6595168440.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi - We sat next to each other at a lunch spot on Crescent Street. We both had tuna melts. You had a seltzer water to drink. We made eyes a few times and I was completely turned on and attracted to you. I'm hoping you work in the neighborhood and see this. Would love to meet up.    ","title":"Monday Lunch in Long Island City M4M","url":"https://newyork.craigslist.org/que/mis/d/monday-lunch-in-long-island/6595137324.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were my favorite dom white top and I was your favorite asian boy. We lost contact a few months ago and it's been hard finding some one who likes getting their feet worshipped as much as you did. I miss you! You know who you are.    ","title":"Miss My Dom White Top :-(","url":"https://newyork.craigslist.org/brk/mis/d/miss-my-dom-white-top/6595100936.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou always brighten my day :)    ","title":"For the young woman I see getting on the train in Larchmont...","url":"https://newyork.craigslist.org/mnh/mis/d/for-the-young-woman-see/6595062631.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi Patricia,\n\nA long time ago, when I was just getting separated, we had a fantastic phone conversation, and you told me that you didn't want to date someone so newly single. Well you were right of course, that journey was difficult and I wasn't ready.\n\nBut I've been ready for a long time now, and I remember you as the sweetest kindest person. At the time I didn't know how rare that was.\n\nNow I wonder about us sometimes. I remember your amazingly goofy pictures and I think we might have really been a match.\n\nIf you read this, write to me.\n\nKyle    ","title":"PatriciaNYC on Match","url":"https://newyork.craigslist.org/mnh/mis/d/patricianyc-on-match/6570888470.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe met at the Apparatus party Saturday night.  One of you is a designer with an office in LA, the other commutes to NY/NJ for work.  Really enjoyed talking with you guys - meant to get your info but lost you in the crowd.\n\nHoping to reconnect; tell me what pattern was on my shirt :).    ","title":"Couple from Apparatus Party","url":"https://newyork.craigslist.org/mnh/mis/d/couple-from-apparatus-party/6595016481.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was waiting for a friend so I was not able to approach you. I would be very interested to see you again, maybe lunch?\n\nEmail me if you think this is you. I was wearing a blue suit.    ","title":"La Colombe Coffee Roasters on 40th - m4w","url":"https://newyork.craigslist.org/mnh/mis/d/la-colombe-coffee-roasters-on/6590851254.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWE WERE TALKING SAID YOU WERE GENERAL CONTRACTOR PAINT MY BATHROOM YOU WERE OLDER STOCKY WHITE MUSCULAR OVER 200    ","title":"MET AT TAPOUT FITNESS AM 57 LEAN MUSC YOU MATURE STOCKY MUSC","url":"https://newyork.craigslist.org/mnh/mis/d/met-at-tapout-fitness-am-57/6594892945.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt's crazy but thought I would give this a try. Saw you this Sunday on the L heading into Brooklyn around 11:30am.  You had a cool tropical T-shirt I asked where you purchased. We talked for a few minutes then I had to get off on Bedford. You tried showing me the tag of your shirt lol Really wanted to keep talking but I was running late. Would love to continue talking. Hope you read this cause this was a serious missed connection...    ","title":"L train this Sunday-cool flower T-shirt","url":"https://newyork.craigslist.org/brk/mis/d/train-this-sunday-cool-flower/6594896234.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLooking for the girl who was working at Carvel in Ridgefield last night (the 20th).  I have something of significant monetary value for you so please contact me if you see this!    ","title":"Carvel in Ridgefield","url":"https://newyork.craigslist.org/fct/mis/d/carvel-in-ridgefield/6594872574.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou got on the D train yesterday in Brooklyn - you had an instrument with you and sat down across from me and my partner, both tattooed guys in our 30s. You kept looking us over, and I gave you a smile when we got off at W4th. Whatever you were asking, the answer's probably yes - hit me up with more details to confirm if you think this is you.    ","title":"Uptown D train on Sunday - you sat across from me and my partner","url":"https://newyork.craigslist.org/mnh/mis/d/uptown-train-on-sunday-you/6594875443.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe saw each other on the Long Beach boardwalk near Lincoln beach last Sunday but never spoke . I'll be there today and on Saturday wearing a Mets cap.  Hope we can meet and talk this time    ","title":"Met in Long Beach M4M","url":"https://newyork.craigslist.org/lgi/mis/d/met-in-long-beach-m4m/6594856911.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was riding uptown on 8th Avenue on Citibike as were you. You alerted me to when I lost my baseball cap. We kept exchanging leads as we rode up 8th, then through the park to East 72nd Street. Once I turned uptown on Madison Avenue, you did also, and when we were on opposite sides of the street, you  smiled at me and yelled, \"Are you following me?\" and I said, \"Sure! Why WOULDN'T I?\"  You looked awfully good in tight jeans. Then you turned on East 70s and I continued on to the Met.    ","title":"Citibiking along 8th Avenue through Central Park to E.72nd","url":"https://newyork.craigslist.org/mnh/mis/d/citibiking-along-8th-avenue/6591191890.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nI was behind you in line and was captivated by the way your long hair was trailing down the back of your well fitting running jacket. I commented to you that it will be nice when spring finally arrives. You made a joke about a closet full of cute dresses that were going out of style.\n\nIf this sounds like it might be you and/or you think you'd be interested in further discussing weather and fashion over a drink or cup of coffee with a mid 40s married man, send me a reply with a favorite song in the subject line.\n    ","title":"Starbucks by Union Square","url":"https://newyork.craigslist.org/mnh/mis/d/starbucks-by-union-square/6583100423.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThis morning the train was packed and I was pressed up by the door next to you - a guy with a beard in a white shirt with red and white dots. I wanted to make a joke about being crammed together, but then the train cleared out and I didn't want to seem like a creep! Maybe I was imagining things. I doubt you'll ever see this, but if you do, hi.    ","title":"Crowded A train","url":"https://newyork.craigslist.org/brk/mis/d/crowded-train/6594841653.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe made eye contact a few times on the train, but didn't start talking until you laughed at the book I was reading (the new Michael Pollan), which you said you friend was just talking about. We talked for a minute but then you had to get off the train, and I wish I'd asked for your number.\n\nWrite me a note and tell me where your friend heard about the book?    ","title":"How to change your mind (m4w)","url":"https://newyork.craigslist.org/brk/mis/d/how-to-change-your-mind-m4w/6594792971.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nIt made me happy. Too bad you had to leave. Where did you go? \nCan't wait till Tuesday or contact me today.    ","title":"Hi Juan. It was a nice surprise to see you Sunday.","url":"https://newyork.craigslist.org/wch/mis/d/hi-juan-it-was-nice-surprise/6594761665.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nYou were flying Denver to Utah the next day. I was the pink haired girl from Denver. We became fast friends exchanged numbers and talked a bunch you said you would call April 3rd to make plans for me to visit you in NY. Some stuff happened and I was not able to answer my phone and had to change my number. For some reason my contacts weren't backed up so I dont have yours. I looked for you on Facebook but dont remember your last name. I think your first name is Darick, you work in the liquor industry, you use to own a restaurant. You shave your head and almost always ware a beret My name is Jazzy I would love to get back intouch with you I've really missed talking to you. Please contact me if you see this and just so i know its you tell me what the other persons that was sitting in our rows name was. If anyone reading this thinks they might know who i am talking about please tell him about this post. Thanks    ","title":"March flight Charlotte to Denver","url":"https://newyork.craigslist.org/mnh/mis/d/march-flight-charlotte-to/6594755026.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe danced together to Tauk at the Brooklyn Bowl Saturday night. You came up to me and I was really shy, you made the night much more interesting and exciting. You were so cool with me and kept trying to get my attention during the show but when I looked for you at the end of the night I couldn't find you. Sorry I was oblivious to some of your signals, you're a gorgeous gal and I'm a dummy for letting you slip away in those moments. I'll be forever kicking myself I didn't get your details, here's to hoping you felt the same way too.    ","title":"Saturday night at the Brooklyn Bowl","url":"https://newyork.craigslist.org/brk/mis/d/saturday-night-at-the/6594718793.html"}]