[{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nSakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our team. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tReceive all orders, update receiving log, liaise with managers to ensure order is put away properly\n•\tComplete daily organization of our warehouse space, walkin coolers, and freezer\n•\tOperate a pallet lifter and pallet jacks\n•\tPerform daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\n    ","title":"Warehouse Worker","url":"https://newyork.craigslist.org/brk/fbh/d/warehouse-worker/6592215521.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nAbout Sakara:\n Sakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our kitchen. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tMust be able to stand and/or sit for extended periods of time, with or without reasonable accommodation\n•\tExposure to refrigerated or freezer space for extended periods of time\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tAbility to work in multiple roles throughout kitchen and warehouse\n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tAssembling, labeling, and packaging meals and customer packages in a cold pack room\n•\tCooking and food prep tasks including: cleaning, chopping, cooking vegetables and fruit, making sauces, baking, etc.\n•\tPortioning soups, sauces, dressings\n•\tPerforming daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\nPlease send along a copy of your resume for review. \n\n    ","title":"Production Associate/Food Packer/Prep Cook","url":"https://newyork.craigslist.org/brk/fbh/d/production-associate-food/6592215881.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNueratrend Maids and Pros is looking for Professional Cleaners Full time and Part time. Apply Here: https://form.jotform.us/nueratrend/employment-application-form\n\nNueratrend Maids and Pros is a NYC based local cleaning and interior painting service that focuses on the cleaning and painting of residential and commercial properties. \n\nWe are looking for professional cleaning technicians to start this immediately this weeken! Full time and part time positions available. Work a flexible shift that fits your schedule. We are looking to hire at least 15 persons immediately! We seek high quality, professional cleaners.\nMust have:\n*Prior professional residential cleaning experience (however will train the right candidate)\n*Willing to work at least 30+ hours a week\n*Legally eligible to work in the United States\n*Able to travel all five Boroughs via subways, buses and trains\n\nOn the job Perks:\n- Stable hours, flexible shifts - up to 30 hours of work hours each week guaranteed.\n- Extra hours available if needed for all employees.\n- Compensation starts at $13.50 per hour but higher rate for weekends, holidays, etc.\n- All cleaning supplies provided by Nueratrend Maids and Pros.\n- Tips from most customers\n- Ongoing training (certificates for most training)\n- Recognition incentives (for job well done)\n- After 30 positive customer reviews, receive a handsome reward\n- Paid sick and vacation days.\n\nIf you are interested to apply, please fill out a cleaner application to become a full time professional cleaner with Nueratrend Maids and Pros. \n\nTo be considered, you:\n\nMust be able to speak and understand English\nCustomer friendly\nHigh School Diploma/GED required\nAbility to pass a background check and screening\nIf you are qualified and would like to be part of a growing cultural company, please do so by applying at: https://form.jotform.us/nueratrend/employment-application-form\n\n\n\n\n\n\n    ","title":"PROFESSIONAL  CLEANING TECHNICIANS NEEDED TO START THIS WEEKEND!","url":"https://newyork.craigslist.org/brk/lab/d/professional-cleaning/6592141462.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChefs Andrew Carmellini and Jason Hua are seeking PASTRY COOKS to join them at THE DUTCH, a roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal Candidates: \n*Have excellent baking skills. \n*At least 2 years of fine dining experience.\n*Have experience on dessert stations in the kitchen. \n*Are passionate about hospitality, pastry and baking. \n*Are able to lift 25 lbs or more. \n*Are able to prepare and execute key components of dishes. \n*Support their fellow cooks.\n\n\nBenefits: We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"PASTRY COOKS for THE DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-for-the-dutch/6591699611.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChefs Andrew Carmellini and Jason Hua are seeking LINE COOKS to join them at THE DUTCH, a roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal Candidates: \n*Have excellent knife skills. \n*Have knowledge of cooking procedures, safety and sanitation. \n*Have experience on multiple stations in the kitchen. \n*Are able to lift 25 lbs or more. \n*Prepare and execute key components of dishes. \n*Ensure quality and accuracy of products and dishes. \n*Support their fellow cooks.\n\n\nBenefits: We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"LINE COOKS for TH DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/line-cooks-for-th-dutch/6591696143.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house management team is seeking SERVERS, BUSSERS, RUNNERS, HOSTS to join them at LITTLE PARK, Chef Andrew Carmellini's seasonal restaurant highlighting the best ingredients from longtime partnerships with local farmers, anglers, vintners, ranchers and foragers, in the Smyth Hotel in TriBeCa.\n\nLittle Park was recently named one of Esquire's \"Best New Restaurants in America 2015,\" a highly coveted spot on the magazine's annual list.\n\n\nIdeal candidates possess: \n*Warmth and graciousness \n*The ability to function in a busy environment. \n*Create stellar guest experiences. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Well-versed in and able to sell our list of wine and spirits.\n*Morning Availability \n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.    ","title":"FOH TEAM MEMBERS for LITTLE PARK","url":"https://newyork.craigslist.org/mnh/fbh/d/foh-team-members-for-little/6591666756.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house management team is seeking DAYTIME HOSTS to join them at THE DUTCH, Chef Andrew Carmellini's roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal candidates possess: \n*A warm and welcoming delivery while processing our valued reserved and walk-in guests. \n*Comfort in a fast-paced, downtown environment. \n*Excellent customer service skills in person and over the phone. \n*Flexible availability on days and weekends.\n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n    ","title":"DAYTIME HOST for THE DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/daytime-host-for-the-dutch/6591469879.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nEmpire Today, LLC is an award winning home improvement company featuring quality name-brand carpet, flooring and window treatments. Our unique shop-at-home approach gives Sales Contractors the opportunity to make a difference and improve the daily lives of clients by helping them design their new living spaces.\n\nAs a company we are experiencing tremendous growth and are seeking dedicated, enthusiastic Outside Sales Contractors with an entrepreneurial drive! With average annual earnings at $50-$70K nationwide and top performers making over $100k, our independent Sales Contractors experience high rewards for strong performances.\n\nHere's why Outside Sales Contractors (In-Home Sales) are eager to work with us:\n\nReceive compensation while you learn the business.\nWarm leads provided, freeing up time to network and uncover self-generated leads which equal an even higher financial reward.\n100% commission based with unlimited earning potential.\nHigh performance culture.\nHigher commissions for hunters bringing in self-generated leads and cross-selling.\nThe support of Empire Today's strong, well-known brand and ongoing marketing efforts.\nAs an independent contractor, you decide how much you want to work.\nAs an Outside Sales Contractor (In Home Sales), you will be spending time with customers in their homes to determine their needs and discussing flooring options, while providing quality customer service.\n\nWe are looking for self-motivated, determined and focused talent, with professional sales experience, who embrace the challenges that come with responding to each customer's unique needs and desires. Communication, presentation, design and negotiating skills, where applicable, are utilized at each opportunity and offer exciting challenges to help transform a client's home while running your own business with the support of one of the strongest brands in home improvement - Empire Today.\n\nAdditional qualities of successful Outside Sales Contractors include:\n\nSales and design experience a plus, but not necessary\nMust be ambitious and results oriented\nAbility to network and self-generate a minimum of 2 sales per month\nAll Sales Contractors are independent 1099 contractors and are responsible for incorporating for themselves within 30 days if not already incorporated\nDriver's license, auto insurance, and vehicle required    ","title":"Outside Sales Representative","url":"https://newyork.craigslist.org/wch/sls/d/outside-sales-representative/6591459918.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nGreetings,\n\nAll are welcome to apply, including students looking for just a summer job. If you have a car and are bilingual, please include in your reply. But this is not absolutely necessary.\n\nI am a female therapist looking for an entry level receptionist / administrative assistant to assist with office support for my current small private practice as well as administrative support for my upcoming speed dating / speed dancing / speed friending / ladies night out event businesses as well as my upcoming brand consisting of matching apparel for children and pets. I will launch the event businesses as well as the clothing brand this summer. I need administrative support to prep for launch. Prior office experience not needed. I am willing to train.\n\nRequirements are:\nExcellent command of the English language\nAbility to type and proofread\nMicrosoft Word, Excel are preferred but not necessary.\n*Typing test via www.typingtest.com \n\nDuties include but not limited to:\n\nAnswering business lines\nScheduling appointments\nCollecting payments\nMaking bank deposits\nWashing and folding linens for the practice\nScreening candidates for employment\nInternet research\nSocial media \nPick up lunch for owner\nCheck prices for event venues and take photos of some venues\nCheck prices and book entertainment\nArrange travel and lodging \nUpdate business websites with content \nAssist with marketing and media platforms\nTrade show research and set up support\nAssist with any administrative office support requests\n\nFor the first month during your 30 day trial period, this will be an off the books part time position (20 hours a week) starting $11.00 an hour. After 30 days, this will be a 1099 independent contractor position. After 6 months, pay will be $12.00 an hour. After 6 months, position can be considered for full time after I launch the event and brand businesses. As my new businesses grow, you can grow with me. I am a fair an respectful manager, and will reward loyal and dedicated employees as my businesses grow.\n\nPlease submit your resume and an introduction email detailing why you feel like you would be a good fit for the position.\n\nThank you for your consideration\n    ","title":"Seeking part time administrative support","url":"https://newyork.craigslist.org/lgi/ofc/d/seeking-part-time/6591424100.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nPlease note this is a legitimate independent contractor position. There are no fees, and Brighten will never ask you for any money.\nLocation: NYC metro area\nContract Description:\n\nWelcome to Brighten Communications. Interested in earning up to $18 per hour while working from the convenience of your own home? Brighten Communications gives you the opportunity to work whatever hours you want from 8 a.m. east coast time through 5 p.m. west coast time, Monday through Friday. You provide the phone, computer with internet access, and the pleasant voice...we provide the client base, flexible hours, and a great hourly wage.\n\nAbout Brighten Communications:\n\nBrighten Communications is a business-to-business telemarketing company specializing in the outsourcing of lead generation. The clients you will be making calls on behalf of represent professional organizations in industries such as finance, brokerage, and high-tech. Our goal is to provide our clients with the highest quality source of new leads for their product or service and to provide you with an enjoyable way to produce income right from your home, paid to you weekly.\n\nBrighten Communications is headquartered in Phoenix, Arizona, and our corporate officers and board of directors have a lengthy history in management and marketing.\n\nRequirements:\n\nBrighten is looking for callers with previous telemarketing and cold calling experience.\nHigh speed Internet access with a dependable computer running Windows 7,8, or 10 (sorry no Apple Macs,etc.).\nYou will need a good working phone line (no cell phones or Skype, but Vonage, RingCentral, etc, ok) and have an unlimited flat rate long distance plan on your phone.\nYou will need a quiet working environment.\nYou may work as few as 20 hours weekly or as many as 32. Hours available depend upon your stats and Brighten's workload.\n\nCompensation / Pay:\n\nYou are paid weekly for the hours completed the previous week. The most common question asked of us is 'How can you pay me by the hour when I'm working from home ?'. The answer is that since we have so much experience in the industry and so many callers from across the nation calling each day, we know the approximate results you should get for each particular project. In addition all of your calls and activity is logged. The better you do, the higher your hourly reward can go.\n\nStarting pay is $12 per hour which is the starting point where you will learn our system online and see how your calls compare to our other nationwide callers. After that, your hourly reward will be determined by your results from calls compared to the other members of the team nationwide. We have many callers that have been with us for years that earn up to $18 hourly.\n\nEarnings are paid to you weekly as an independent contractor with a 1099 form at the end of the year. In addition, because you work as an independent contractor you may reap additional tax benefits and write offs. When you are chosen to work with our company you will get all of this information in writing so you can feel secure in what is expected of you and what the company will pay you.\n\nIf you wish to find out more or apply, please visit this link to our employment website. Applications are only accepted through the employment website listed below, so please do not call, email or fax resumes as they will be discarded.\n\nApply Online: https://www.brightenemployment.com/CallerInfo.aspx?s=cnyq&clid=165913931651&cat=cus&n=1    ","title":"$12/hr - B2B Appointment Setting / Telemarketing / Work from Home","url":"https://newyork.craigslist.org/brk/csr/d/12-hr-b2b-appointment-setting/6591393165.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\n\n\nBecome the Teacher You Imagine You Can Be!\nJoin the teaching team at Imagine Early Learning Centers.\nPosition: Pre-K Teacher/Assistant Director\nLocation: Brooklyn Heights, Brooklyn\nImagine Early Learning Centers seeks a Full-time Teacher/Assistant\nDirector for our Pre-K classroom at our Brooklyn Heights location in\nBrooklyn, NY. Our center is a safe, nurturing, fun and friendly\nenvironment\n\nWe are seeking an experienced, energetic, and creative professional\nlooking to join a team providing the highest quality childcare for\nworking families. While you will primarily serve as a UPK teacher and\nwork in the classroom, this position will be a dual role and is perfect\nfor someone looking to move up and develop expertise in education\nadministration. Most importantly, we are seeking a head teacher who is NYS\nCertified B-2.\nResponsibilities include: \n\nParticipating in planning and implementing developmentally\nappropriate curriculum\nEffective communication with families and co-teachers\nAbility to adhere to licensing and NAEYC guidelines\nEffective written communication skills\nAbility to meet physical requirements of position which include\nlifting children, pushing strollers/buggies, sitting on the floor and\nyear-round daily outdoor activities.\n\nCompetitive salaries and benefits including:\n\nPaid Vacation and Sick Time\nMedical, Dental, and Vision coverage\nFlexible spending accounts (FSA)\nSupplemental Insurance (NY Life, Aflac)\nTransit Chek (Commuter Benefit)\nTuition Reimbursement/Degree Incentive Reward\nEducational support programs available\nChildcare Discount where available\nProfessional Development\n\nAdditionally, in 2018 Imagine officially became an employee owned\ncompany through the creation of an ESOP (Employee Stock Ownership\nPlan). What this means is not only do we value and possess an ownership\nculture, all qualified employees at Imagine receive a retirement\nbenefit without paying any contributions to the fund themselves. \n\nQualifications\n\n\nMinimum of BA in Early Childhood, Elementary, Special Education\nor related field\nNY State B-2 Certification REQUIRED\nMA in Early Childhood, Elementary, Special Education or related\nfield, a plus\nPrevious experience teaching children in an Early Childhood\nprogram\nPrevious experience with NAEYC standards and the accreditation\nprocess a plus\n\nWho We Are: \nImagine Early Learning Centers, an employee owned child care\nmanagement company, operates ten high quality, full day licensed and\nNAEYC accredited Early Childhood centers in the NY metro area for\nchildren 6 weeks to 5-years-old. With state of the art facilities,\nprofessional development opportunities for promotion, a teamwork\napproach to classroom and center management, and a creative and\nrewarding work environment, Imagine maintains a satisfied and talented\nteacher staff. At Imagine, we know children, as well as staff and\nfamilies, thrive in a stimulating and nurturing environment. Staff,\nchildren and families alike are valued as individuals and as members of\nour diverse community.\nAdditional information\n\nImagine Early Learning Centers is an equal opportunity/affirmative\naction employer and will not discriminate against any employee or\napplicant on the basis of age, color, disability, gender, national\norigin, race, religion, sexual orientation, veteran status, or any\nclassification protected by federal, state, or local law.\n\n\nPlease apply online with Imagine Early Learning Centers at: https://imagineelc.hiringthing.com/job/67228/upk-teacher-assistant-director?s=cl\n\n    ","title":"UPK Teacher/Assistant Director","url":"https://newyork.craigslist.org/brk/edu/d/upk-teacher-assistant-director/6591223788.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nEmpire Today, LLC is an award winning home improvement company featuring quality name-brand carpet, flooring and window treatments. Our unique shop-at-home approach gives Sales Contractors the opportunity to make a difference and improve the daily lives of clients by helping them design their new living spaces.\n\nAs a company we are experiencing tremendous growth and are seeking dedicated, enthusiastic Outside Sales Contractors with an entrepreneurial drive! With average annual earnings at $50-$70K nationwide and top performers making over $100k, our independent Sales Contractors experience high rewards for strong performances.\n\nHere's why Outside Sales Contractors (In-Home Sales) are eager to work with us:\n\nReceive compensation while you learn the business.\nWarm leads provided, freeing up time to network and uncover self-generated leads which equal an even higher financial reward.\n100% commission based with unlimited earning potential.\nHigh performance culture.\nHigher commissions for hunters bringing in self-generated leads and cross-selling.\nThe support of Empire Today's strong, well-known brand and ongoing marketing efforts.\nAs an independent contractor, you decide how much you want to work.\nAs an Outside Sales Contractor (In Home Sales), you will be spending time with customers in their homes to determine their needs and discussing flooring options, while providing quality customer service.\n\nWe are looking for self-motivated, determined and focused talent, with professional sales experience, who embrace the challenges that come with responding to each customer's unique needs and desires. Communication, presentation, design and negotiating skills, where applicable, are utilized at each opportunity and offer exciting challenges to help transform a client's home while running your own business with the support of one of the strongest brands in home improvement - Empire Today.\n\nAdditional qualities of successful Outside Sales Contractors include:\n\nSales and design experience a plus, but not necessary\nMust be ambitious and results oriented\nAbility to network and self-generate a minimum of 2 sales per month\nAll Sales Contractors are independent 1099 contractors and are responsible for incorporating for themselves within 30 days if not already incorporated\nDriver's license, auto insurance, and vehicle required\n    ","title":"Outside Sales Representative","url":"https://newyork.craigslist.org/stn/sls/d/outside-sales-representative/6591156551.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nClassic Man Barber Lounge is a premium barbershop offering New York's professional and progressive gentlemen excellent grooming services in a therapeutic and multicultural environment.\n\nClassic Man Barber Lounge is a newly developed barbershop located in East Village (Lower Eastside / 10009); and we are looking for licensed / experienced barbers who have a great work ethic, easy-going attitude, and an appreciation for high quality client service.\n\nClassic Man Barber Lounge offers a premium location, positive and unique environment, routine technical training, and other professional development services.\n\nPosition Type / Pay Structure:\n---Full-Time / Part-Time Barbers\n---Commission and/or Fixed Based Rent (Monthly / Weekly)\n---Bonus and Reward Incentives\n\nRequired License / Certification\n---Valid New York Barber License\n\nRequired Technical Skills\n---Clippers/Scissor Haircuts, Straight Razor, Bread Trim, Hair Styling\n\nOther Requirements\n---Professional / Confident / Approachable / Easy-Going Demeanor\n---Great Communication / Client-Service Skills\n---Prior Work-Experience at a Barbershop / Salon (Minimum 1 Year)\n---Team-oriented / Willing to Work within Team Structure to Develop a New Barbershop Brand / Reputation\n\nPlease submit application via link below and/or email your resume.\n\nJob Types: Full-time, Part-time, Temporary, Commission    ","title":"Position on Barber / Stylist Team - Classic Man Barber Lounge","url":"https://newyork.craigslist.org/mnh/spa/d/position-on-barber-stylist/6590839162.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n• Perform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n• Maximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n• Support and implement strategic corporate brand marketing initiatives and promotional activities. \n• Strengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n• Maintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n• Monitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n• Participate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n• Initiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n• Professionally communicate with all peers, customers and management. \n• Plan and execute demo events, stores walks, trade shows, etc. \n• Develop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n• Bachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n• Valid driver's license required. \n• Relocation may be required for future promotional opportunities. \n• Ability to work nights and weekends. \n• Capable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n• Applicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\nSalary: Starting at $42,500, plus quarterly bonus potential. Includes company vehicle + Phone + 401k & benefits.\n\nPlease send resume through reply link through Craigslist.\n    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/lgi/sls/d/field-sales-representative/6590597985.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNoHo Hospitality Group is in search of a SERVICE MANAGER to join our growing team.\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\nThe Service Manager is responsible for the management of all aspects of the restaurant service for existing venues, and will assist in the development and opening of new venues in accordance with company standards. \n\nThe Service Manager will be an exemplary member of the company's hospitality philosophy. \n\nDuties include, but are not limited to: \n-Foster and maintain positive guest relations at all times and resolve guest complaints, ensuring guest satisfaction.\n-Anticipate guests' needs, respond promptly and acknowledge all guests, however busy and whatever time of day.\n-Responsible for the supervision of the Service Department. This includes recruiting and training in collaboration with Restaurant\nExecutives.\n-Maintain the training materials for the service team, revise when applicable collaborating with HR. Materials may include:\nManager Training Program, Certified Training Program per all job classes, update regularly all FOH materials per all job classes for A-La-Carte Server, In-Room-Dining, and Special Events.\n-Access all functions of the P.O.S. system in accordance to specifications, may include AVERO, Open Table, Hot Schedules, Online Applications, and Time and Attendance Systems.\n\n\nRequirements: \n-College degree\n-Minimum 3-5 years experience as a Dining Room Manager (or higher), preferably in a fine dining restaurant group.\n-Highly-developed knowledge of various food service styles.\n-Excellent written and verbal communication skills with fluency in English, multilingualism will be considered an asset.\n-Strong leadership skills, highly-developed organizational and multi-tasking abilities and sound administrative skills.\n-Excellent problem resolution skills and outstanding listening skills.\n-Ability to work flexible hours.\n-Perform job functions with attention to detail, speed, and accuracy.\n-Maintain confidentiality of guest information and pertinent company data.\n-Ascertain departmental training needs and provide such training.\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Short Term Disability, Life Insurance, Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n    ","title":"CORPORATE SERVICE MANAGER for NOHO HOSPITALITY GROUP","url":"https://newyork.craigslist.org/mnh/fbh/d/corporate-service-manager-for/6590458467.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nExperienced Dog Walker Position Available\n\nBrooklyn based dog walking company is currently looking for a mature, responsible and committed individual to join our dog walking team! \n\nThis is a rewarding job for a strong individual who likes the outdoors, LOVES dogs and enjoys working independently.\nWe prefer to work with creative people (artists, musicians, etc) who are looking to make a steady income. \n\nPLEASE RESPOND ONLY IF YOU MEET THE FOLLOWING REQUIREMENTS: \n\n- Possess previous experience as a dog walker.\n- Capacity to be punctual and show up on time ALWAYS.\n- Willing to work in the rain, snow, heat and humidity.\n- Comfort with and ability to handle dogs of all sizes.\n- Ability to commit to at least 6 months with our company.\n- Have excellent written and spoken communication skills.\n- Capacity to follow through with training techniques as advised by owners (positive reinforcement/reward based training only).\n- Patience with our special needs dogs (pups that don't like to walk, pups that jump or pull, elderly dogs with medical issues). \n- Capability to work Monday - Friday 11am to 6pm\n- You must have a cell phone with a contract.  It is very important that we can reach you at all times during work hours.\n\nRespond with a cover letter and your resume.  \nIf you do not respond properly we will not contact you.\n    ","title":"Experienced Dog Walker Needed","url":"https://newyork.craigslist.org/brk/lab/d/experienced-dog-walker-needed/6590188008.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n        The Conrad New York is currently hiring an Assistant Food & Beverage Manager at this award winning, AAA Four Diamond hotel located in the heart of Lower Manhattan. Named one of the ?Best Hotels in New York? by U.S. News & World Report, 2014 and 2015, the Conrad has won numerous travel industry awards and accolades since the hotel opened its doors.What will I be doing? As an Assistant Manager of Food and Beverage, you would be responsible for assisting in the daily management of activities and services of all hotel food and beverage operations (kitchens, restaurants, banquets, lounges, room service, coffee shops, etc.) in the hotel's continuing effort to deliver outstanding guest service and financial profitability. Specifically, you would be responsible for performing the following tasks to the highest standard:Assist in the management of all Food and Beverage operations to include, but not limited to, guest service, food and beverage quality, inventory management, outlet reservations and occupancy, systems management, budget and forecasting, marketing, report generation, department management and meeting participation and facilitationEnsure consistency in food quality and presentation and monitor cost and portion controlsAssist in monitoring and developing team member performance to include, but not limited to, providing supervision and professional development, scheduling, conducting counseling and evaluations and delivering recognition and rewardMeet and greet guests and respond to guest inquiries, requests and issues in a timely, friendly and efficient manner and resolve guest concernsMonitor and assess service and satisfaction trends, evaluate and address issues and make improvements accordinglyEnsure compliance with health, safety, sanitation and alcohol awareness standardsAssist in recruiting, interviewing and training team membersWhat are we looking for? Since being founded in 1919, Hilton has been a leader in the hospitality industry. Today, Hilton remains a beacon of innovation, quality, and success. This continued leadership is the result of our Team Members staying true to our Vision, Mission, and Values. Specifically, we look for demonstration of these Values:Hospitality - We're passionate about delivering exceptional guest experiences.Integrity - We do the right thing, all the time.Leadership - We're leaders in our industry and in our communities.Teamwork - We're team players in everything we do.Ownership - We're the owners of our actions and decisions.Now - We operate with a sense of urgency and disciplineIn addition, we look for the demonstration of the following key attributes:QualityProductivityDependabilityCustomer FocusAdaptabilityWhat will it be like to work for Hilton? Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision ?to fill the earth with the light and warmth of hospitality? unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!EOE/AA/Disabled/VeteransApply Now\n    ","title":"\n        Assistant Food & Beverage Manager - Conrad New York\n","url":"https://newyork.craigslist.org/mnh/fbh/d/assistant-food-beverage/6589067373.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nMeadowland Group Realty has excessive experience in buying, selling, and flipping homes for over 15 years, and is looking to reward honest, hard working, self motivated people who would like to invest in their Real Estate career. We are currently seeking new talent to train, develop and grow within our company. Job description will be explained more during interview.\n\nRequirements: \n- Strong People Skills and a Great Attitude a must \n- Ability to Learn Quickly and Execute Multiple Techniques \n- Strong Work Ethic and Dependable A Must\n- Self-motivated and Career driven individuals\n- Knowledge of Microsoft Office programs (ie: Word, Excel and Outlook)\n- Knowledge of Quickbooks!\n-Drivers license required \n- Bilingual a plus \n\n\nResponsibilities: \n- Maintain his/her own clientele\n- Generate outside meetings with clients and prospects\n- Conducting property research & locating information\n- Navigating the web - Real Estate platforms\n- Data Entry \n- Aggressive Outbound Phone Sales and Cold Calling\n- Ability to work both independently and in a team environment\n -No License/experience required\n\n\nPlease include a brief paragraph about yourself as well as your resume!\nWe will be conducting interviews for the next three weeks to find the perfect candidate. \n\nThank you    ","title":"Full Time Secretary/Specialist Needed Immediately","url":"https://newyork.craigslist.org/brk/rej/d/full-time-secretary/6588967285.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAre you a successful salesperson who is confident in your skills and ability to close business clients? Are you a self-starter that enjoys working independently, but strive in a team environment? Are you a leader with a drive to succeed both professionally and financially?\nIf you answered yes to the above questions, we have an OPPORTUNITY for you!!!!\n\nWe are presently looking for Marketing Reps. for our NEWARK location to be responsible for driving company profitability and growth while helping to manage sales teams to inform and educate our clients about reducing their environmental impact by going green.\nGreen energy (sometimes called renewable or sustainable energy) comes from natural sources like wind, water, and sunlight. Because green energy can be produced with little pollution, it's far more environmentally-friendly than other types of energy, and it doesn't contribute to climate change or global warming like traditional energy sources. Plus, unlike fossil fuels such as coal and oil, green energy sources are renewable, meaning they replenish naturally and are in continuous supply.\n\nWe are looking for successful professionals who:\n- Have an entrepreneurial spirit and are coach-able \n- Can quickly absorb and retain product knowledge \n- Ability to manage deadlines and operate with a sense of urgency\n- Professional appearance \n- Excellent communication skills \n- Outgoing personality \n\nWhat's in it for you?\n- Full Paid Training \n- Competitive Base salary and uncapped earnings\n- Spend your time in a great culture and working environment \n- Great working hours \n- Immediate start available \n- Travel Opportunities\n- Driving Bonus (your gas and toll are covered) up to $600/mth\n\nJob Description:\n- Enthusiastically represent the company its services\n- Work on highly competitive responses in a primary authorship role \n- Successfully translate complicated information for customers\n- Closing business in compliance with a weekly, monthly, and annual goal \n- Weighing risk and reward in qualifying and disqualifying opportunities in conjunction with Management\n- Actively participate in relevant conferences and trade associations \n- Assist with staff training\n\n\n If you think you meet the challenge, please hit the REPLY button and put the ad title in subject line or call us to see if you meet the requirements to set up an interview at @  347-252-4531...\"Please Copy and Paste your Resume to the add\"...    ","title":"YOU THINK YOU HAVE WHAT IT TAKES ? PROVE IT !!","url":"https://newyork.craigslist.org/mnh/rej/d/you-think-you-have-what-it/6588908007.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nRooftop Bartender\nAs a Rooftop Bartender, naturally you are enthusiastic, optimistic and treat everyone with respect. You work together with your fellow ambassadors to deliver exceptional service for our guests!\n\nyour main tasks are:\nwelcoming our guests to the world of citizenM\nserve and prepare great cocktails, wine, beer and keep your bar on stock\nserve dishes from the bar menu\ninform guests on the best places to be, eat, shop or club\nensure that the bar area looks amazing at all times\n\nyou:\nare fluent in English\ncan multi-task\nhave at least 1 year of bartending experience\ndo not need to have specific hotel experience\nlove to meet and greet different people\nare passionate about the things you're doing\n\nwe:\noffer you a mobile job, never dull or standard\noffer you a special training program and a personal development plan\nreward you for good performance\ngive you an exclusive citizenM outfit\n\nyour shift:\nfulltime\nflexible and late night hours are required\n\napply via:\nhttps://www.citizenm.com/jobs/joblisting/bowery-cloudm-rooftop-ambassador\n\n    ","title":"Rooftop Bartender","url":"https://newyork.craigslist.org/mnh/fbh/d/rooftop-bartender/6588846955.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOvernight Hotel Ambassador\nAs an overnight ambassador, naturally you are enthusiastic, optimistic and treat everyone with respect. You work together with your fellow ambassadors to deliver exceptional service for our guests!\n\nyour main tasks are:\nwelcoming our guests to the world of citizenM\nassist guests at check-in, during their stay and check-out \ninform guests on the best places to be, eat, shop or club\nserve a signature sandwich, salad or warm dish\nprepare a super coffee and delicious cocktails\nensure that the hotel areas look amazing at all times \nexecute administrative night-audit dutie\n\nyou:\nare fluent in English \nhave a great sense of responsibility\ndo not need to have specific hotel experience \nlove to meet and greet different people\nare passionate about the things you're doing \n\nwe:\noffer you a mobile job, never dull or standard\noffer you a special training program and a personal development plan\nreward you for good performance\ngive you an exclusive citizenM outfit\n\nyour shift:\nfulltime   \n11:00 PM - 07:30 AM\n\nApply:\nhttps://www.citizenm.com/jobs/joblisting/night-ambassadornewyork\n\n    ","title":"Overnight Hotel Ambassador","url":"https://newyork.craigslist.org/mnh/fbh/d/overnight-hotel-ambassador/6588848278.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHotel Day Ambassador\nAs a day ambassador, naturally you are enthusiastic, optimistic and treat everyone with respect. You work together with your fellow ambassadors to deliver exceptional service for the guests. \n\nYour main tasks are: \nwelcoming our guests to the world of citizenM\nassist guests at check-in, during their stay and check-out \ninform guests on the best places to be, eat, shop or club\nserve a signature sandwich, salad or warm dish\nprepare a super coffee and delicious cocktails in our bar\nensure that the hotel areas look amazing at all times \n\nYou: \nare fluent in English \ncan multi-task\ndo not need to have specific hotel experience \nlove to meet and greet different people\nare passionate about the things you're doing \n\nWe: \noffer you a mobile job, never dull, or standard\noffer you a special training program and a personal development plan reward you for good performance\ngive you an exclusive citizenM outfit \n\nYour shift: \nfull-time \n7 AM - 3:30 PM\n3 PM -11.30 PM\n\nApply via:\nhttps://www.citizenm.com/jobs/joblisting/ambassador-new-york\n\n    ","title":"Hotel Day Ambassador","url":"https://newyork.craigslist.org/mnh/fbh/d/hotel-day-ambassador/6588844541.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house team is looking for gracious and friendly BARTENDERS, RUNNERS & LEAD HOST to join them at BAR PRIMI , our Italian pasta shop on the border of NoHo and the East Village.\n\n\nIdeal candidates possess: \n*Well-versed in wine & spirits culture. \n*Warm and gracious service approach, and the ability to create stellar guest experiences. \n*Ability to assume full responsibility for menu content and deliver excellent service. Micros POS experience a plus. \n*The ability to function comfortably in busy environments.\n\n\nBenefits: We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room and Rye Street Tavern in Baltimore.\n\n\n    ","title":"FOH TEAM MEMBERS for BAR PRIMI","url":"https://newyork.craigslist.org/mnh/fbh/d/foh-team-members-for-bar-primi/6588723035.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSous Chef | M&G Foodstuff Catering and Events | East Village Manhattan\n\n. . . Why haven't you applied already?\nGreat $$, epic holiday benefits, life changing experience\nNo nights or weekends!!\n\n\nThe Venue | M&G Foodstuff Catering and Events\n\nM&G Foodstuff is not your regular catering company we are a young dynamic food company with a unique approach.\n\nWe create vibrant, seasonal and health centric food with ALWAYS a focus on quality!\n\nWe work with the top producers, photographers and fashion labels in NYC and we are looking to grow our team with other like-minded individuals.\n\nThe Role:\n\nWe are looking for a passionate strong full time Sous Chefs who has had exposure to fast-paced high volume kitchens. Catering experience is highly preferred. \n  \nThis is a kitchen manager position and there is a high level of administration expected. You will be overseeing the daily kitchen production, managing staff, running kitchen teams at events, ordering and liaise with clients.\n  \nAs Sous Chef at M&G Foodstuff you;\n\nMust be able to work well under pressure and can work autonomously;\nHave a broad range of kitchen skills in all sections including basic baking and pastry;\nHave a passion for food and the hospitality industry;\nAre ALWAYS punctual with NO exceptions;\nCan follow instruction and carry out your daily tasks efficiently and cleanly;\nCan communicate professionally with people and have great relationship building skills and also problem solving skills;\nPride yourself on your clean and professional appearance with impeccable personal hygiene;\nMaintain consistent quality of work;\nMust have food handlers certificate;\nMust have experience with DOH inspections;\nMust understand the product and vision of the company while striving to become better;\nOn Offer\n\nGreat salary plus company benefits;\n2 consecutive days off;\nGreat hours, No nights or weekends\nCross training through multiple areas;\nOngoing training and development;\nWhat we expect from you:\n\n• Be you, be UNIQUE\n• Deliver EXCEPTIONAL food quality LIKE NO OTHER\n• MAKE a DIFFERENCE\n• RESPECT everyone\n• Celebrate the WINS\n• ENJOY every day\n\nThe Reward: \n\nPlenty of work, great pay, on-the-job training, career opportunities when you realize you don't ever want to leave. \n\nStop thinking and start applying! \n\nNew Day. Every Day.    ","title":"SOUS CHEF - DAYS ONLY. NO NIGHTS OR WEEKENDS","url":"https://newyork.craigslist.org/mnh/fbh/d/sous-chef-days-only-no-nights/6588589826.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Brian Nasworthy's team is looking for passionate, hard-working LINE COOKS to join them at LAFAYETTE Grand Cafe & Bakery in NoHo.\n\n\nLAFAYETTE is an everyday grand cafe and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan. Our market-driven bistro menu is a worldly homage to the genre that spans a variety of regions, from Provence to Normandy to neighboring Mediterranean coasts, offering a re-mastery of traditional dishes we love and some signatures.\n\n\nIdeal Candidates:\n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Are able to lift 25 lbs or more.\n*Ensure quality and accuracy of products and dishes.\n*Support their fellow cooks.\n\nBenefits: \n*Competitive wages\n*Medical, dental, and vision benefits (after 90 days of employment for full time employees)\n*401(k)\n*Paid Time Off\n*Employee Dining Discount\n*Additional Discounts: ZipCar, SkinSpa, Gym Membership, YogaWorks and more!\n*Transit Benefit Program\n*Continuing Education Classes  \n*Referral Reward Program and more!\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\nNoHo Hospitality Group recently made the coveted, annual Inc. 5000 list for 2016 of the fastest growing private companies in America.\n\n    ","title":"LINE COOKS for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/line-cooks-for-lafayette/6588517055.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's team is looking for friendly, hard-working TOURNANTS that are eager to learn in an energetic downtown environment.\n\n\nLAFAYETTE  is an everyday grand café and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan.\n\n\nIdeal Candidates:  \n*Have excellent knife skills \n*Have knowledge of cooking procedures, safety and sanitation \n*Have experience on multiple stations in the kitchen \n*Are able to lift 25 lbs or more \n*Prepare and execute key components of dishes \n*Ensure quality and accuracy of products and dishes \n*Support their fellow cooks\n\n\nBenefits:  We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"TOURNANT for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/tournant-for-lafayette/6588517345.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Brian Nasworthy's team is looking for passionate, hard-working BANQUET COOKS to join them at LAFAYETTE Grand Cafe & Bakery in NoHo.\n\n\nLAFAYETTE is an everyday grand cafe and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan. Our market-driven bistro menu is a worldly homage to the genre that spans a variety of regions, from Provence to Normandy to neighboring Mediterranean coasts, offering a re-mastery of traditional dishes we love and some signatures.\n\n\nIdeal Candidates:\n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Are able to lift 25 lbs or more.\n*Ensure quality and accuracy of products and dishes.\n*Support their fellow cooks.\n\nBenefits: \n*Competitive wages\n*Medical, dental, and vision benefits (after 90 days of employment for full time employees)\n*401(k)\n*Paid Time Off\n*Employee Dining Discount\n*Additional Discounts: ZipCar, SkinSpa, Gym Membership, YogaWorks and more!\n*Transit Benefit Program\n*Continuing Education Classes  \n*Referral Reward Program and more!\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\nNoHo Hospitality Group recently made the coveted, annual Inc. 5000 list for 2016 of the fastest growing private companies in America.\n\n    ","title":"BANQUET COOKS for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/banquet-cooks-for-lafayette/6588518089.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo View this Job and Apply: Click Here\n\n\nKeyMe is a New York City startup revolutionizing the locksmith industry with innovative robotics and mobile technology.\n\nDescription\n\n\n\nWe've raised $105 million to date from top-tier investors, include Comcast Ventures, Battery Ventures, 7-Eleven, and White Star Capital.\nAbout the Role:\nKeyMe's Customer Service team is the public face of a fast-growing key-copying and locksmith startup.\n You'll handle a high volume of calls, chats, and emails from existing customers, as well as people in tough lockout situations who need fast, safe, and reliable help. This role offers career skills development and a lot of room for growth within the company.\nRequirements:\n\nAt least 1 year in a customer service role. Startup experience not required! Retail, hospitality, etc. are great backgrounds for this role.\nAvailability for evening and weekend shifts (please indicate your availability in the Q&A).\nFluency in Spanish and English is preferred, but not required.\nPrior experience in an office environment a plus, but not required.\nExperience handling a high volume of calls and emails from customers or clients a plus.\nSales experience is relevant as well.\nExperience using Zendesk, Talkdesk, and/or Google Docs a plus.\nGenuine empathy and tough skin!\n\nBenefits:\n\nHealth, dental, and vision insurance.\nFlexible Spending Account (FSA).\nHealth Savings Account (HSA).\nSnacks and drinks in the office!\nKeyMe Fun Activities Committee (KFAC).\n401K plan and stock options.\nPaid Time Off and Commuter Benefits.\nMonthly team contests to reward top performers!\n\n\n\n\n\n\n\n\n\n\n\nKeyMe is revolutionizing the locksmith industry with innovative robotics and mobile technology. They're hiring Customer Service Associates with at least 1 year of customer service experience -- retail, hospitality, and other backgrounds welcome! You'll handle a high volume of calls, chats, and emails from existing customers as well as people in tough lockout situations who need fast, safe, and reliable help. Candidates bilingual in English and Spanish are especially encouraged to apply!\n\n\n\n\n\n\nTo View this Job and Apply: Click Here\n\nPowered by Planted, where young professionals find awesome jobs at high-growth startups. Learn more about Planted on our website and in the New York Times.    ","title":"Customer Service Associate role at HIGH GROWTH TECH STARTUP","url":"https://newyork.craigslist.org/mnh/csr/d/customer-service-associate/6588510928.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSummary\nThe Hospitality & Travel Services Assistant provides administrative support to the department, which includes Charitable Contributions, Travel, Corporate Card, Catering & Conference Services and Firm Events). The position will report to the Director of Hospitality & Travel Services, but may take guidance and direction from other managers within the team. \n\nA primary focus of the role is the coordination of Firm Charitable Contributions, with balance of role supporting the overall department.\n\nEssential duties and responsibilities include the following. Other duties may be assigned.\nCHARITABLE CONTRIBUTIONS - 50%:\n Research new requests and provide prior history to Partner in charge.\n Process related invoices, prepare letters to organizations, provide copies to requesting Partners,\nmaintain thorough file for audit and tax purposes.\n Work with Graphics department to create Journal Ads as needed.\n Work with internal contacts to fill tables at Charitable events as needed.\n Track YTD spend and contributions\n\nTRAVEL & CORPORATE CARD - 15%\n Monthly audit process to identify Air & Rail refunds to corporate cards (Access Database).\n Ongoing corporate card maintenance - Departing/arriving lawyers cardmember email notifications; deliver new cards upon arrival; cancel cards for departing cardmembers and update Amex Card profiles; ensure zero balances upon departure by notifying and communicating with cardmember.\n Track Membership Reward usage and firm savings (Access Database).\n Produce year-end Hotel Savings Report (Access Database).\n\nCATERING & CONFERENCE SERVICES - 15%\n Processing and tracking related invoices.\n Maintain daily CMS reports, report high peaks in abandoned calls and RONA activity.\n Track weekly ad-hoc global MyConference requests from TCS.\n Run quarterly conference dining activity reports, compare YoY.\n Run Seamless reports for each department twice monthly.\n\nFIRM EVENTS - 20%:\n Work with event planners to gather and maintain invitee lists for events as necessary, including combining/reformatting lists from multiple sources, eliminating duplicates, researching records\nwithout email addresses or undeliverable.\n Configure and print name badges.\n Supporting the event team in tracking event calendar and spend in the Event Management System -\nincluding:\no Entering event data and invoices in EMS\no Creating and running reports with various event statistics and spend\nSupervisory responsibilities - N/A\n\nQualifications\n Candidate must be service-oriented, collegial and able to communicate effectively with all levels of\nthe Firm.\n Professional demeanor and strong written and verbal communication skills.\n Strong attention to detail, organizational, time management, and prioritization skills.\n Ability to work independently, meet multiple deadlines and respond well to change.\n Knowledge of general office support functions required.\n Technical Skills:\n Proficient in a range of computer software applications, including programs and databases\nsuch as, MS-Word, MS-Excel, MS-PowerPoint.\n Knowledge of SharePoint, Access and MS Publisher a plus.\n Knowledge of Microsoft Dynamics or other contact management database preferred.\n Experience with Cvent Event Management software preferred.\n\nEducation and/or experience\nBachelor's Degree and a minimum of 2-3 years of work experience in a professional environment required. Law firm and/or financial services experience preferred.\n\nWork Environment\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n    ","title":"Hospitality & Travel Services Assistant","url":"https://newyork.craigslist.org/mnh/ofc/d/hospitality-travel-services/6588498371.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's front-of-house team is seeking SERVERS, HOSTS, and BUSSERS to join them at LOCANDA VERDE, our neighborhood taverna serving Chef Andrew Carmellini's soul-satisfying urban Italian menu located in Robert DeNiro's TriBeCa hotel, The Greenwich.\n\n\nOur bustling corner restaurant has been welcoming New Yorkers morning, noon and night with a warm and comfortable atmosphere, leisurely Italian spirit and heartfelt cooking.\n\n\nIdeal candidates possess: \n*Warmth and graciousness; The ability to function highly in a busy environment. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Create stellar guest experiences. \n*Well-versed in and able to sell our list of wine and spirits.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n**NoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.    ","title":"FOH TEAM MEMBERS for LOCANDA VERDE","url":"https://newyork.craigslist.org/mnh/fbh/d/foh-team-members-for-locanda/6588480401.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nSAT/ACT Tutoring Part-Time with PrepScholar - Flexible Online Tutoring\nBoston company PrepScholar is looking for talented tutors to teach the SAT and ACT. If you've mastered these tests, are an engaging teacher, want to be part of a growing startup, and have at least 15 hours per week to offer, we want you.\n-----\nWhy Join Us:\n+ Flexible Hours: We know that you might be busy as a graduate student or with other jobs. You have the flexibility to take on as much tutoring as you can handle.  While we request applicants with at least 15 hours to offer, you may take 40 hours of tutoring or more if you prefer.\n\n+ Flexible Location: Your teaching will be done all online via Skype or similar software, with students across the country. Enjoy the flexibility of teaching anywhere that's convenient for you.\n\n+ Great Pay: At PrepScholar, we believe that our tutoring is only as good as the teacher. We reward great teaching with great pay and routinely give bonus rates for great teaching.  Rates start at $30/hour and go up to $50/hour or more.\n\n+ Technology-Enhanced Tutoring: Each of your students will be studying with our online prep product, which is a comprehensive program with over 1600 questions and adaptive technology. No need to prepare your own materials. \n\n+ Improve Your Teaching: We're passionate about high quality teaching and getting our students results. We'll guide you through our teaching philosophies and mentor you to become the best teacher you can be.\n\n-----\nAbout Us:\n+ We're making education more effective through customization. We learn each student's strengths and weaknesses and create tailored learning programs through technology.\n\n+ Our program has proven results that lead the prep industry, and tutoring makes it even better. \n\n+ We're passionate about delivering an unparalleled student experience. A lot of companies are trying smart education; almost none are doing it well.\n\n+ Learn more at www.prepscholar.com\n\n-----\nWe're Looking For:\n+ 99%ile SAT or ACT score. 2300+ and 34+ preferred. You know the test inside and out.\n\n+ Highly selective undergraduate or graduate institution preferred.\n\n+ Great teaching skills. You understand how to identify weak points in a student's thinking. You know how to customize your teaching to the student and break down tough questions into concepts. You also know how to engage with and build rapport with students.\n\n+ Serious commitment and reliability. You take great pride in your work and never phone it in. You always pull through and deliver. You're rarely the one late to a meeting.\n\n+ College graduates preferred (undergrads can apply but you are expected to have consistent schedule openings).\n\n+ At least 15 hours of availability every week to offer students. \n\n-----\nHourly Rate:\n$30/hr to $50/hour or more.\n\nWe want to hear from you. \n\nTo submit a full application to be a PrepScholar tutor, email with your cover letter, resume, SAT/ACT scores and any other standardized test scores (e.g. GRE, GMAT, LSAT). For verification of your scores, you can just send a screenshot of your online score report for now, with full verification upon starting.\n\n    ","title":"SAT/ACT Tutoring Part-Time or Full Time - Flexible Online Tutoring","url":"https://newyork.craigslist.org/mnh/edu/d/sat-act-tutoring-part-time-or/6588438574.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Anthony Ricco's team is looking for hard-working, a passionate SOUS CHEF  to join their team at LEUCA! \n\n\nLEUCA is a neighborhood restaurant serving Chef Andrew Carmellini's Southern Italian-inspired menu in the heart of Williamsburg at The William Vale. Leuca offers a menu of wood-fired coastal Italian dishes, and is open for breakfast, lunch and dinner.\n\n\nThis opportunity has tremendous growth potential within our hospitality family.\n\n\nIdeal Candidates Possess:  \n*1-3 years experience as a Sous Chef. \n*Highly-developed knowledge of various culinary styles and mastery of all line level cooking stations. \n*A professional and polished approach to leadership. \n*Excellent verbal and written communication skills. \n*The ability to comfortably lead a team in a busy atmosphere. \n*DOH Food Protection certified.\n\n\nBenefits:  We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore\n\n    ","title":"SOUS CHEF for LEUCA (Williamsburg)","url":"https://newyork.craigslist.org/brk/fbh/d/sous-chef-for-leuca/6588435787.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTrion Real Estate Management is a leading property management company and owner in NY and CT. At Trion we believe that we are only as good as our employees and we contribute our success, in large part, to them. Our employees work as a team, think \"outside the box\", and take pride in their position. Our goal is to reward their efforts with competitive pay, benefits, professional growth and development opportunities.\n\nAn immediate opportunity is available for a Property Manager with New York City experience. We are looking for someone that is looking to grow with our company. The position is available immediately and requires a 3+ years' experience in NYC or Westchester County property management. We require that this individual is well organized, personable and able to communicate well with a diverse group of people.\n\nJob Description:\n\nOversee all building operations, maintenance services and outside contractors/vendors.\nAttend all monthly and annual meetings\nDirect Contact for all resident concerns or requests.\nAssist in creating and maintaining the Annual budgets for each of the properties responsible for.\nApprove all purchase orders to confirm all large purchases are necessary and accounted for.\nTrack and approve all maintenance work orders\nImplement cost saving and revenue increasing initiatives\nPerform weekly quality assurance inspections for each of the buildings to ensure onsite building staff is properly maintaining the site and curb appeal is immaculate.\nImplement an in-depth review of the properties documents (By-Laws, House Rules, Offering Plans, & Proprietary Lease) to operate the properties in accordance with these legal documents.\nAnswer and appropriately direct concerned owner phone calls or inquiries to the proper management department for resolution.\nUpdate all Property Handbooks annually and create annual calendars per building.\nHandle emergency issues afterhours associated with properties.\n\n\nJob Requirements:\n\nMust have a minimum of 3+ years experience in property management.\nExcellent verbal and written communication and customer service skills.\nMust be a fast learner and a self-starter with the ability to problem solve.\nMust be able to work independently, self-manage, and be extremely organized.\nValid driver's license and reliable transportation.\n\n\nQualifications:\n\nEducation: Bachelor's Degree. Additional Property management certificates are a plus.\nStrong working knowledge of Excel, Word, and Outlook.\nYardi Voyager Property Management software knowledge is a plus.\n\n\nWhat Trion Provides:\n\nIn house training and exposure to a diverse portfolio of properties across Westchester County, Connecticut, and NYC.\nOpportunity to grow quickly.\nDirect Supervision and support provided by Account Executive.\nCompensation for this position will be $55,000.00 to $85,000 based on experience and portfolio size. Including benefits.\n\n\nJob Type: Full-time\n\nSalary: $55,000.00 to $85,000.00 /year    ","title":"Property Manager","url":"https://newyork.craigslist.org/brx/rej/d/property-manager/6588365201.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAdministrative Assistant\n\ncompensation: TBD\nemployment type: full-time\n\nJob Summary\n\nTrion Real Estate Management is a leading residential property management company and owner in NY and CT. At Trion we believe that we are only as good as our employees and we contribute our success, in large part, to them. Our employees work as a team, think \"outside the box\", and take pride in their position. Our goal is to reward their efforts with competitive pay, benefits, professional growth and development opportunities.\n\nAn immediate opportunity is available for an Administrative Assistant. We are looking for someone that is looking to grow within our company. The position is available immediately and requires a minimum of 3 years experience in NYC or Westchester County property management. We require that this individual is well organized, personable and able to communicate well with a diverse group of people.\n\nJob Description:\n\n• Assist Property Manager with all resident related/ vendor related issues\n• Maintain a positive relationship with clients, tenants, management team, vendors, and property staff\n• Respond to all requests via phone, email or in person\n• Answer all incoming calls and create work order requests\n• Filing and all front office clerical\n• Update all Property Handbooks annually and update annual calendars per building.\n\nJob Requirements:\n• Must have a minimum of 3 years experience.\n• Excellent verbal and written communication and customer service skills, English and Spanish.\n• Must be a fast learner and a self-starter with the ability to problem solve.\n• Must be able to work independently, self-manage, and be extremely organized.\n• Valid driver's license and reliable transportation\n*\nQualifications:\n• Education: Minimum Associates College Degree. Additional Property management certificates are a plus.\n• Strong working knowledge of Excel, Word, and Outlook.\n• Yardi Voyager Property Management software knowledge is a strong plus.    ","title":"Administrative Assistant","url":"https://newyork.craigslist.org/brx/rej/d/administrative-assistant/6588351605.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our team. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tReceive all orders, update receiving log, liaise with managers to ensure order is put away properly\n•\tComplete daily organization of our warehouse space, walkin coolers, and freezer\n•\tOperate a pallet lifter and pallet jacks\n•\tPerform daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n    ","title":"Warehouse Associate/Food Packer","url":"https://newyork.craigslist.org/brk/fbh/d/warehouse-associate-food/6588319167.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nAbout Sakara:\n Sakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our kitchen. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tMust be able to stand and/or sit for extended periods of time, with or without reasonable accommodation\n•\tExposure to refrigerated or freezer space for extended periods of time\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tAbility to work in multiple roles throughout kitchen and warehouse\n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tAssembling, labeling, and packaging meals and customer packages in a cold pack room\n•\tCooking and food prep tasks including: cleaning, chopping, cooking vegetables and fruit, making sauces, baking, etc.\n•\tPortioning soups, sauces, dressings\n•\tPerforming daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\nPlease send along a copy of your resume for review.\n    ","title":"Production Associate/Prep Cook/Food Packer","url":"https://newyork.craigslist.org/brk/fbh/d/production-associate-prep/6588319313.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNueratrend Maids and Pros is looking for Professional Cleaners. Apply Here: https://form.jotform.us/nueratrend/employment-application-form\n\nNueratrend Maids and Pros is a NYC based local cleaning and interior painting service that focuses on the cleaning and painting of residential and commercial properties. \n\nWe are looking for professional cleaning technicians immediately! Full time and part time positions available. Work a flexible shift that fits your schedule. We are looking to hire at least 15 persons immediately! We seek high quality, professional cleaners.\nMust have:\n*Prior professional residential cleaning experience (however will train the right candidate)\n*Willing to work at least 30+ hours a week\n*Legally eligible to work in the United States\n*Able to travel all five Boroughs via subways, buses and trains\n\nOn the job Perks:\n- Stable hours, flexible shifts - up to 30 hours of work hours each week guaranteed.\n- Extra hours available if needed for all employees.\n- Compensation starts at $13.50 per hour but higher rate for weekends, holidays, etc.\n- All cleaning supplies provided by Nueratrend Maids and Pros.\n- Tips from most customers\n- Ongoing training (certificates for most training)\n- Recognition incentives (for job well done)\n- After 30 positive customer reviews, receive a handsome reward\n- Paid sick and vacation days.\n\nIf you are interested to apply, please fill out a cleaner application to become a full time professional cleaner with Nueratrend Maids and Pros. \n\nTo be considered, you:\n\nMust be able to speak and understand English\nCustomer friendly\nHigh School Diploma/GED required\nAbility to pass a background check and screening\nIf you are qualified and would like to be part of a growing cultural company, please do so by applying at: https://form.jotform.us/nueratrend/employment-application-form\n\n\n\n\n\n\n    ","title":"PROFESSIONAL  CLEANING TECHNICIANS NEEDED","url":"https://newyork.craigslist.org/brk/lab/d/professional-cleaning/6587390207.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nStaten Island residents only please. NYC is too far a drive from our NJ location\n\nText Dave the owner at 973 647 7769\n\nThere is nothing more reliable than Plumbing, Heating and Air conditioning, they can't export a trade to India! LOL!!! The sky is the limit, maybe even own your own company someday! Our last \"Salsy\" Tech cleared 120K two years running before moving out of state to start his own business. Between his regular hourly pay, overtime pay and bonus/reward money he averaged $52 hr!\n\nHVAC Technician \"Golden Ticket\" Opportunity! The free training alone is worth tens of thousands of dollars and a career in this field can bring you hundreds of thousands of dollars over the years! We have the Best trucks, Best people, Paid training, Fastest career path and Compensation. We keep our HVAC Techs busy year round, because our people are crossed trained do basic plumbing calls too! (HVAC Techs in trucks with Lead Plumbers in slow season) Some even go on to receive their Master Plumbers license! \n\nIf you lie, cheat, steal or do hard drugs, please skip further reading this Craig's list post, as it's not for you. However, if you truly live a clean lifestyle, have life goals and would like to enjoy the benefits of working with an elite team where honesty, organization and good character thrive, please read on!\n\nBeing a great communicator is a requirement. Diagnosing, selling, repairing and servicing residential equipment a must. Your current employer WILL NOT be contacted. At Good Tidings, we understand your desire to not waste time with interviews that are not likely to pan out. Why get dressed up and drive to a business location, only to spend even more time being paraded around the office? There's a better way!\n\nWith the convenience of your laptop, you can now \"Interview\" from the comfort and privacy of your home. If you want a career where you can make more money and leave the daily frustrations of your current job behind, then why not accept my invitation by clicking this link? http://goodtidings.applybyweb.com (Click the Technician / Plumber tab)\n\nTo get the most attention, text or call the owner at 973 647 7769 \n\nVisit:\nwww.goodtidingscomfort.com\nwww.facebook.com/GoodTidingsComfort\nhttps://youtu.be/fJRjZyjQfBA\n\nWe're currently searching for a great communicator who is interested in getting more out of life; more time off, more money, more career opportunity, more training, more support, more appreciation and more fulfillment. We are looking for someone who can appreciate the work/life balance that our company can deliver for them.\n\nQuote from one employe:\n\"I started working a few months ago, came in with no experience and they welcomed me with opened arms. They are more than willing to teach and accommodate my learning curve. Everyone from the office to the warehouse and the Technicians are all a big family. The guys in the field really get along together, want to see each other succeed and its great to be around that environment. I enjoy working here; it's a real family atmosphere. Also, learning from these Technicians that are such masters or their craft is something to strive for!\"\n~ Steve P\n\nBetter yet, here is what Adam had to share:\nLess than 2 years ago I started with Good Tidings and now I am on my way to becoming a full technician. I'm so excited, I just returned from a week of paid sales and customer service training in California and I'm looking forward to using my new skills! The motivation, training and pay increases come along with every step of the way, and you are most certainly not alone when help is needed because we are a team. All the technicians and office staff are like a second family and everyone is there to help out if the going gets tuff. I couldn't have pictured a better environment to learn and grow in this trade, and for that I am truly grateful. \n~ Adam M.\n\nOK, this next part is ONLY for you Doubting Thomas's out there.\n\nI've been hearing from some applicants lately who took years before reaching out to me. They were thinking the Craig's list ad was too good to be true and likely the work of a recruiter. A positive, straight forward, honest, cutting edge Plumbing, Heating and Air-conditioning company here in NJ? Applicants quickly expressed their relief after speaking with me and wished they'd reached out sooner, instead of wrongly thinking that the ad was the product of some scam. \n\nWorse yet, they might have been thinking I was like the big, unethical, money hungry, state wide, corporate owned, get away with whatever I can, \"Teach and reward my people for lying\", soon to be in the papers and speaking and with the Attorney General for ripping off the elderly, type of company (Can you tell how I feel just yet?).\n\nIn an effort to get ahead of these thoughts, please know that I am a very real family man, a 2nd generation Master Plumber, HVAC businessman and license holder. I built my company from scratch, and i care about my company, its people and my customers, enormously. \n\nI'm honest, ethical, integrity filled and unafraid. The cost of which, in the past, going through peak times with trucks sitting idle and the office turning lots of work away. Why turn all of that work and money away??? Because it was the right thing to do, in light of the lack of quality and character of the available workmen, which was way below what my customers expected and deserved for their hard-earned money. It's hard for most people to believe, but I value my faith and integrity above profits.\n\nFor you sceptics out there, I'm climbing out on a limb here, by sharing a very personal account of faith in the workplace. My goal is to put away any doubt or speculation out of your mind and have you see for yourself, what it's been like NOT to be held captive by money and to do the \"right thing\" in business, no matter what the cost. To God be the glory\n\nhttps://youtu.be/BZZQkxULXAo\n\nHonesty matters\n~ Dave\n29 years of faith filled family service!    ","title":"Make your Mother Happy! Land a Career not just a job! Up to $40 Hr!","url":"https://newyork.craigslist.org/stn/trd/d/make-your-mother-happy-land/6587358951.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house team is looking for gracious and friendly BARTENDERS, RUNNERS & LEAD HOST to join them at BAR PRIMI , our Italian pasta shop on the border of NoHo and the East Village.\n\n\nIdeal candidates possess: \n*Well-versed in wine & spirits culture. \n*Warm and gracious service approach, and the ability to create stellar guest experiences. \n*Ability to assume full responsibility for menu content and deliver excellent service. Micros POS experience a plus. \n*The ability to function comfortably in busy environments.\n\n\nBenefits: We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room and Rye Street Tavern in Baltimore.\n\n\n    ","title":"FOH TEAM MEMBERS for BAR PRIMI","url":"https://newyork.craigslist.org/mnh/fbh/d/foh-team-members-for-bar-primi/6586392199.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and the front-of-house management team are seeking an AM FOOD RUNNER  to join them at LEUCA!\n\n \nLeuca is a neighborhood restaurant serving Chef Andrew Carmellini's Southern Italian-inspired menu in the heart of Williamsburg at The William Vale. Leuca offers a menu of wood-fired coastal Italian dishes, and is open for breakfast, lunch and dinner.\n\n\nIdeal candidates possess:\n*Experience with specialty coffee. \n*Warm and gracious service approach, and the ability to create stellar guest experiences. \n*Ability to assume full responsibility for cafe menu items and delier excellent service. Micros POS experience a plus. \n*The ability to function comfortably in busy environments.\n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"AM FOOD RUNNER for LEUCA (Williamsburg)","url":"https://newyork.craigslist.org/brk/fbh/d/am-food-runner-for-leuca/6586261101.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house management team is seeking a MAITRE'D to join them in welcoming guests to THE DUTCH, Chef ANDREW CARMELLINI's roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal candidates possess: \n- Plan the seating of the dining room via Open Table.\n- Oversee the dining room and make it a warm and welcoming place.\n- Ensure all guests have an exemplary dining experience.\n- Actively take and process reservations.\n- Answer incoming calls and questions.\n- Assist in coordinating the activities of dining room personnel to provide fast friendly service to guests.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n\n    ","title":"MAITRE'D for THE DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/maitred-for-the-dutch/6586216694.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nLocation: Nosara, Costa Rica\n\nWant to make serious money while living in paradise? If you're a beach lover who gets satisfaction from selling a genuine product you can be proud of, with the potential of making $175,000+ annually, you've found your dream career.   \n\nJOB Description: \nConsultative Face-to-Face Sales Representative for our unmatched home ownership opportunity on the Gold Coast of Costa Rica. No need to search for clients. We provide you with a continual supply of clients who have put down a deposit to tour our homes and community.\n\nAre you an experienced opener and closer?\nDo you have experience selling face-to-face?\nAre you interested in earning top commissions?\nDo you understand the difference between Consultative Sales Vs. High-pressure Sales?\nDo you have what it takes to earn $175,000+ annually?\n\nNo Real Estate Experience? No problem. We will train you the RIGHT, EASY WAY.\nKalia Luxury Living is a Top Award-Winning Homebuilder, in Costa Rica's leading sustainable estate communities on the pristine Pacific \"Gold Coast\" - with breathtaking ocean views. We're one of the most unique homebuilders in the country and our award-winning home designs have gained international recognition. While you may not know us, you probably may have heard of our brand. We construct the finest new homes in Central America.\n\nRESPONSIBILITIES:\nCOMMISSIONED FACE-TO-FACE SALES REPRESENTATIVE - NOSARA, COSTA RICA\nAs a member of the Kalia Sales Team your goal is simple, to sell homes in our upscale resort-style community, offering the best lifestyle and value unmatched anywhere else in Central America! After a comprehensive training program designed to maximize your success, you will be assigned to work in our beautiful model home communities.\nOur mission is to provide a superior sales experience that will create loyal Kalia Homeowners. No real estate license is required! Bring your successful sales skills to a new level.\n\nQualified applicants should have a professional appearance. High-energy, positive, out-going, friendly individuals with strong verbal communication skills WILL succeed as a Sales Associate at Kalia Luxury Living.\n\nThe right candidate for this position will be a results-driven individual who can use a consultative sales strategy to effectively understand our customer's needs, communicate the value of our product and continuously close new business.\nSpecific areas of responsibility will include:\n\nInfluence the sales process and home-buying decision\nBuild excitement and urgency for the customer\nMaintain the overall image of Kalia's award-winning model homes and community\nCommunicate value to our buyers through in-depth needs analysis\nDemonstrate and tour the model homes and available home sites\nDine and wine with the clients\nUtilize your strong closing techniques in order to make the sale\nReview blueprints and site plans\nPre-qualify buyers for financing\nPresent purchase agreements\nEstablish and maintain long-term relationships with clients\nUse your creative ability to initiate referrals\n\nCORPORATE TRAINING\nSales Training Program will consist of hands-on learning, supplemented with extensive training on the job and in the employee's Division. Our program is designed so that within a maximum of 21 days you will be on your own making money and selling at your best potential.\n\nQUALIFICATIONS\nThe ideal sales candidate will have:\n\nReal estate sales experience (with excellent closing records) \nThree+ years of demonstrated, successful sales experience.\nExcellent leadership skills.\nExcellent communication skills.\nStrong closing skills.\nHigh degree of emotional intelligence.\nStrong problem solving and communication skills.\nCurrent Driver's License.\n\nAs an employee of an industry leader, we reward you with:\nExcellent Earnings and Strong Commission Opportunities (Average representative can make $175,000+ per year)\nOutstanding Career Growth Potential \nVacations and Holidays\nHome Purchase Discount\n\nIt takes a strong team to build a successful company; now build your dream career with us.\n    ","title":"Sales Rep for Luxury Coastal Community. Face-to-face.","url":"https://newyork.craigslist.org/mnh/sls/d/sales-rep-for-luxury-coastal/6586063815.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur pastry team at Bar Boulud is growing! We are looking for pastry cooks who are interested in learning and growing with us at Chef Daniel Boulud's Lyonnaise-inspired French bistro. Experience is not a necessity, but the desire and passion to serve quality pastry is.\n\nSkills & Requirements: \n•\tMust have schedule flexibility (including nights and weekends) \n•\tAbility to work as part of a team \n•\tPassion for both classic and contemporary approaches to Pastry \n•\tAbility to multi-task in a face-paced environment\n\nBenefits: \n•\tTeam-Oriented Environment that Cares About One Another \n•       Paid Time Off \n•\tEmployee Referral Reward Program \n•\tMedical, Dental and Vision Insurance \n•\t401 (k) with Company Match \n•\tEmployee Dining Discount\n\nif you would like to join the team, please send an updated resume to Chef Daniel Kleinhandler at DKleinhandler@danielnyc.com    ","title":"Pastry Cooks - Bar Boulud/Boulud Sud","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-bar-boulud/6586017670.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe're looking for Team Members and Shift Managers for our PORT CHESTER, NY location! Must love people, have experience in the restaurant industry and want to be a part of the largest restaurant company in the world! If you want to build a great career while providing fast, fun and friendly service to our customers, Taco Bell is the perfect place to learn, grow and succeed!\n\n Details...\n\n Crew Members start at $11.75 per hour!\n\n Shift Managers start at $13-15+ depending on experience PLUS up-to $200 MONTHLY performance bonus potential!\n\n We offer the following:\n A commitment to promote from within\n Excellent training programs\n Reward and recognition culture\n Family friendly environment\n Flexible Schedule\n The ideal candidates must want to have fun serving great food to our customers!\n\n We are looking to hire and start great talent immediately this week at our Taco Bell in Port Chester, NY located in Westchester county minutes from Metro North and Westchester bus system public transportation. We will host open call ALL WEEK by appointment ONLY!\n\n PLEASE REPLY with your resume today to schedule your interview!    ","title":"Taco Bell OPEN CALL in PORT CHESTER, NY ASAP! Mgrs & Crew!","url":"https://newyork.craigslist.org/wch/fbh/d/taco-bell-open-call-in-port/6585618620.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Jesse Hinkson are seeking passionate, dedicated BANQUET COOKS to join them at THE WILLIAM VALE, a luxury boutique hotel in the heart of Brooklyn's most desired neighborhood, Williamsburg.\n\nThe William Vale includes Westlight, a rooftop bar with an elevated bar dining menu inspired by New York City's street food, Leuca, a Southern Italian restaurant featuring wood-fired coastal dishes, and Mister Dips, a retrofitted Airstream serving burgers, fries and dairy dips as well as a multi-faceted banquet and catering department.\n\n\nIdeal candidates possess: \n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Have experience on multiple stations in the kitchen.\n*Are able to lift 25 lbs or more.\n*Prepare and execute key components of dishes while ensuring quality and accuracy.\n*Support their fellow cooks.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"BANQUET COOKS for THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/banquet-cooks-for-the-william/6585112570.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDo you have a knack for well-crafted cocktails?  Do you find change and challenge exhilarating and do you like to solve problems? Do you enjoy dressing sharp but don't take yourself too seriously? Do you find great reward in managing a team? Are you extremely flexible and able to work autonomously? Do you have a work history that demonstrates your dependability and reliability?  \n\nBoqueria Restaurants is hiring a Rooftop Bar Manager for new rooftop bar Castell in Marriot's A/C Hotel in Midtown West!  The ideal candidate must have solid experience managing a high-volume restaurant or bar. The Bar Manager is to ensure that every guest has an amazing experience, that the bar team is motivated and cohesive, and that the bar meets or exceeds its financial targets. They will collaborate with our Beverage Director to deliver thoughtfully crafted cocktails, so extensive beverage knowledge is ideal. The Bar Manager is responsible for building an extraordinary service team, ensuring they are well trained, consistently supported, and led by example throughout service.\n\nTo apply for this exciting opportunity, click link below to be considered.  Please no resumes with photos - unfortunately, they will not be considered.\n\nhttps://careers.hireology.com/boqueriarestaurants/169954/description\n\nWe are an equal opportunity employer. We do not base our employment decisions on an applicant's race, sex, sexual orientation, age, color, national origin, citizenship, disability, handicap, veteran status, or any other factor prohibited by local, state, or federal law.    ","title":"Growing Restaurant Group Seeks Rooftop Bar  Manager!","url":"https://newyork.craigslist.org/mnh/fbh/d/growing-restaurant-group/6585088572.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Anthony Ricco are seeking passionate, dedicated OVERNIGHT COOKS to join them at THE WILLIAM VALE, a luxury boutique hotel in the heart of Brooklyn's most desired neighborhood, Williamsburg.\n\nThe William Vale includes Westlight, a rooftop bar with an elevated bar dining menu inspired by New York City's street food, Leuca, a Southern Italian restaurant featuring wood-fired coastal dishes, and Mister Dips, a retrofitted Airstream serving burgers, fries and dairy dips as well as a multi-faceted banquet and catering department.\n\n\nIdeal candidates possess: \n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Have experience on multiple stations in the kitchen.\n*Are able to lift 25 lbs or more.\n*Prepare and execute key components of dishes while ensuring quality and accuracy.\n*Support their fellow cooks.\n*Looking for breakfast and afternoon cooks. \n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"OVERNIGHT COOKS for THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/overnight-cooks-for-the/6584258189.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\n\n\nJob Description\n\nBecome the Teacher You Imagine You Can Be!\nJoin the teaching team at Imagine Early Learning Centers.\nPosition: Pre-K Teacher\nLocation: Brooklyn Heights, Brooklyn\nImagine Early Learning Centers seeks a Full-time Teacher for our\nPre-K classroom at our Brooklyn Heights location in Brooklyn. It is a\nmixed age group ranging from 3-5 years old. \nWe are seeking an experienced, energetic and creative professional\nto join a team providing the highest quality childcare for working\nfamilies. Our center is a safe, nurturing, fun and friendly\nenvironment. Most importantly, we are seeking a head teacher who is NYS\nCertified B-2.\nResponsibilities include: \n\nParticipating in planning and implementing developmentally\nappropriate curriculum\nEffective communication with families and co-teachers\nAbility to adhere to licensing and NAEYC guidelines\nEffective written communication skills\nAbility to meet physical requirements of position which include\nlifting children, pushing strollers/buggies, sitting on the floor and\nyear-round daily outdoor activities.\n\nCompetitive salaries and benefits including:\n\nPaid Vacation and Sick Time\nMedical, Dental, and Vision coverage\nFlexible spending accounts (FSA)\nSupplemental Insurance (NY Life, Aflac)\nTransit Chek\nTuition Reimbursement/Degree Incentive Reward\nEducational support programs available\nChildcare Discount where available\nProfessional Development\n\nQualifications\n\n\nMinimum of BA in Early Childhood, Elementary, Special Education\nor related field\nNY State B-2 Certification REQUIRED\nMA in Early Childhood, Elementary, Special Education or related\nfield, a plus\nPrevious experience teaching children in an Early Childhood\nprogram\nPrevious experience with NAEYC standards and the accreditation\nprocess a plus\n\nWho We Are: \nImagine Early Learning Centers, LLC, operates ten high quality, full\nday licensed and NAEYC accredited Early Childhood centers in the NY\nmetro area for children 6 weeks to 5-years-old. With state of the art\nfacilities, professional development opportunities for promotion, a\nteamwork approach to classroom and center management, and a creative\nand rewarding work environment, Imagine maintains a satisfied and\ntalented teacher staff. At Imagine, we know children, as well as staff\nand families, thrive in a stimulating and nurturing environment. Staff,\nchildren and families alike are valued as individuals and as members of\nour diverse community.\n\nAdditional information\n\nImagine Early Learning Centers is an equal opportunity/affirmative\naction employer and will not discriminate against any employee or\napplicant on the basis of age, color, disability, gender, national\norigin, race, religion, sexual orientation, veteran status, or any\nclassification protected by federal, state, or local law.\n\n\nPlease apply online with Imagine Early Learning Centers at: https://imagineelc.hiringthing.com/job/67228/upk-teacher?s=cl\n\n    ","title":"UPK Teacher","url":"https://newyork.craigslist.org/brk/edu/d/upk-teacher/6583960855.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAbout Sakara:\n Sakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our kitchen. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tMust be able to stand and/or sit for extended periods of time, with or without reasonable accommodation\n•\tExposure to refrigerated or freezer space for extended periods of time\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tAbility to work in multiple roles throughout kitchen and warehouse\n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tAssembling, labeling, and packaging meals and customer packages in a cold pack room\n•\tCooking and food prep tasks including: cleaning, chopping, cooking vegetables and fruit, making sauces, baking, etc.\n•\tPortioning soups, sauces, dressings\n•\tPerforming daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\nPlease send along a copy of your resume for review. \n\n\n    ","title":"Production Associates/Prep Cook/Food Packer $13-$15/hr","url":"https://newyork.craigslist.org/brk/fbh/d/production-associates-prep/6583554448.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our team. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tReceive all orders, update receiving log, liaise with managers to ensure order is put away properly\n•\tComplete daily organization of our warehouse space, walkin coolers, and freezer\n•\tOperate a pallet lifter and pallet jacks\n•\tPerform daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n    ","title":"Warehouse/Food Packer","url":"https://newyork.craigslist.org/brk/fbh/d/warehouse-food-packer/6583555158.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house management team is seeking SERVERS to join them at THE DUTCH, Chef Andrew Carmellini's roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal Candidates:\n*Warmth and graciousness; The ability to function highly in a busy environment. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Create stellar guest experiences. \n*Well-versed in and able to sell our list of wine and spirits..\n\n\nBenefits: \n*Competitive wages\n*Medical, dental, and vision benefits (after 90 days of employment for full time employees)\n*401(k)\n*Paid Time Off\n*Employee Dining Discount\n*Additional Discounts: ZipCar, SkinSpa, Gym Membership, YogaWorks and more!\n*Transit Benefit Program\n*Continuing Education Classes  \n*Referral Reward Program and more!\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n    ","title":"SERVERS for THE DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/servers-for-the-dutch/6583450839.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are looking for Business Professionals with experience in Marketing/Sales to take advantage of this Home-Based Business opportunity, and plug into their database and offer our products and services to their clientele. This Business includes a Start-Up Fee and it offers you leverage to build lasting financial legacy and also earn residual income . Commission will be paid based on production only. The benefits of our services are numerous and our incentives include: \n💥Unlimited Earning Potential (Check/Direct Deposit)\n💥$100,000 Life Insurance Policy\n💥Continuous Personal Development \n💥Qualify for Luxurious Car Reward Program\n💥Qualify for an All-Expense Paid Cruise Trip    ","title":"Business Professionals Needed: Realtors, Tax Preparers, etc","url":"https://newyork.craigslist.org/mnh/bus/d/business-professionals-needed/6582589554.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are looking for Business Professionals with experience in Marketing/Sales to take advantage of this opportunity, and plug into their database and offer our products and services to their clientele. This opportunity offers additional income when included to their list of businesses. The benefits of our services are numerous and our incentives include: \n💥Unlimited Earning Potential (Check/Direct Deposit)\n💥$100,000 Life Insurance Policy \n💥Qualify for Luxurious Car Reward Program\n💥All-Expense Paid Cruise Trip    ","title":"Business Professionals Needed: Realtors, Tax Preparers, etc","url":"https://newyork.craigslist.org/mnh/sls/d/business-professionals-needed/6582589558.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef  ANDREW CARMELLINI and the front-of-house management team are seeking FOH TEAM MEMBERS to join them at LEUCA! \n\n\nLEUCA, a neighborhood restaurant serving Chef Andrew Carmellini's Southern Italian-inspired menu in the heart of Williamsburg at The William Vale. LEUCA offers a menu of wood-fired coastal Italian dishes, and is open for breakfast, lunch and dinner.\n\nPositions Include:\n*SERVERS\n*BUSSERS\n*RUNNERS\n\n\nIdeal candidates possess:\n*Warmth and graciousness; The ability to function highly in a busy environment. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Create stellar guest experiences. \n*Well-versed in and able to sell our list of wine and spirits.\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n\n\n    ","title":"FOH TEAM MEMBERS for LEUCA (Williamsburg)","url":"https://newyork.craigslist.org/brk/fbh/d/foh-team-members-for-leuca/6582222928.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Anthony Ricco's team is looking for hard-working, passionate LINE COOKS & BREAKFAST COOKS to join their team at LEUCA!\n\nLEUCA is a neighborhood restaurant serving Chef Andrew Carmellini's Southern Italian-inspired menu in the heart of Williamsburg at The William Vale. Leuca offers a menu of wood-fired coastal Italian dishes, and is open for breakfast, lunch and dinner.\n\nIdeal candidates possess: \n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Have experience on multiple stations in the kitchen.\n*Are able to lift 25 lbs or more.\n*Prepare and execute key components of dishes while ensuring quality and accuracy.\n*Support their fellow cooks.\n*Looking for breakfast and afternoon cooks. \n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"LINE COOKS for LEUCA (Williamsburg)","url":"https://newyork.craigslist.org/brk/fbh/d/line-cooks-for-leuca/6582204496.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Anthony Ricco's team are seeking DISHWASHERS/PORTERS  to join them at THE WILLIAM VALE , a luxury boutique hotel in the heart of Brooklyn's most desired neighborhood, Williamsburg.\n\n\nThe William Vale features an all-day restaurant on the ground floor, a rooftop cocktail bar boasting panoramic views of Manhattan, Brooklyn and Queens, as well as a multi-faceted banquet and catering department.\n\n\nIdeal candidates possess:  \n*Positive attitude and strong work ethic. \n*Must be able to lift up to 50 pounds. \n*Comfort in a fast-paced, busy environment. \n*Great communication skills with management. \n*Flexible availability on nights and weekends.\n\n\n\nBenefits:  \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.    ","title":"DISHWASHERS/PORTERS for THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/dishwashers-porters-for-the/6582201806.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Anthony Ricco's team are seeking RECEIVERS  to join them at THE WILLIAM VALE , a luxury boutique hotel in the heart of Brooklyn's most desired neighborhood, Williamsburg.\n\n\nThe William Vale features an all-day restaurant on the ground floor, a rooftop cocktail bar boasting panoramic views of Manhattan, Brooklyn and Queens, as well as a multi-faceted banquet and catering department.\n\n\nIdeal candidates possess:  \n*Strong product knowledge. \n*Basic understanding of purchasing. \n*Basic understanding of kitchen inventory. \n*Must be able to lift up to 50 pounds. \n*Ability to receive and organize all of the products that enter the restaurant. \n*Positive attitude and strong work ethic. \n*Great communication skills with management.\n*Food Protection Certificate Holder.\n\n\nBenefits:  \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"RECEIVERS for THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/receivers-for-the-william-vale/6582197013.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are a top rated financial company looking for sales executives  for our Wall Street Office. If you have sales/customer service/telemarketing experience in anywhere in the world and can speak English well, you can be a good fit for our company. An average salesperson earns $10,000+ per month easily in our company. We can sponsor qualified candidates for Green Card  also.\n\nJob duties:\n\n-Make outbound calls to a significant number of business owners to generate new business.\n-Consistently close new business.\n-Maintain and follow up with pipeline daily.\n\nQualifications:\n\n-Positive attitude.\n-Energy and drive to succeed.\n-Excellent communication skills.\n-Accountable with the ability to work independently and as part of a team.\n-Bilingual is a PLUS. ( Spanish, Chinese, Japanese, Russian, Korean,Vietnamese,Hindi, Urdu, etc)\n\nWe Offer:\n\n-Fun fast paced environment, which will both challenge and reward you.\n-Unlimited earning potential.\n-Great work environment where your success is our focus.\n-Potential to grow within the company.\n-We will train and will provide leads\n- Commission only. Plus Year End Bonus and other incentives.\n- Qualified candidates will get draws/advances.\n\nNewcomers,Students/Interns are also welcome. Be a superstar in sales/finance industry and make your dream six figure income with us.\n    ","title":"Bilingual Sales Executive Wanted","url":"https://newyork.craigslist.org/mnh/sls/d/bilingual-sales-executive/6582170620.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's front-of-house team is seeking SERVERS to join them at LOCANDA VERDE, our neighborhood taverna serving Chef Andrew Carmellini's soul-satisfying urban Italian menu located in Robert DeNiro's TriBeCa hotel, The Greenwich.\n\n\nOur bustling corner restaurant has been welcoming New Yorkers morning, noon and night with a warm and comfortable atmosphere, leisurely Italian spirit and heartfelt cooking.\n\n\nIdeal candidates possess: \n*Warmth and graciousness; The ability to function highly in a busy environment. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Create stellar guest experiences. \n*Well-versed in and able to sell our list of wine and spirits.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n**NoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"SERVERS for LOCANDA VERDE","url":"https://newyork.craigslist.org/mnh/fbh/d/servers-for-locanda-verde/6582151113.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur pastry team at Bar Boulud is growing! We are looking for pastry cooks who are interested in learning and growing with us at Chef Daniel Boulud's Lyonnaise-inspired French bistro. Experience is not a necessity, but the desire and passion to serve quality pastry is.\n\nSkills & Requirements: \n•\tMust have schedule flexibility (including nights and weekends) \n•\tAbility to work as part of a team \n•\tPassion for both classic and contemporary approaches to Pastry \n•\tAbility to multi-task in a face-paced environment\n\nBenefits: \n•\tTeam-Oriented Environment that Cares About One Another \n•       Paid Time Off \n•\tEmployee Referral Reward Program \n•\tMedical, Dental and Vision Insurance \n•\t401 (k) with Company Match \n•\tEmployee Dining Discount\n\nif you would like to join the team, please send an updated resume to Chef Daniel Kleinhandler at DKleinhandler@danielnyc.com    ","title":"Pastry Cooks - Bar Boulud/Boulud Sud","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-bar-boulud/6582134187.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChefs Andrew Carmellini and James Belisle are seeking BAKERS  to join the team at LAFAYETTE  Grand Café and Bakery in NoHo.\n\n\nLafayette is an everyday grand café and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan. Open morning, noon and night, the space houses a 160-seat dining room, rotisserie bar, two private dining suites and an all-day boulangerie-pâtisserie.\n\n\nIdeal Candidates Possess:  \n*Prior bread baking experience including mixing, shaping and baking dough. \n*Passion for bread baking and a strong work ethic. \n*The ability to ensure quality & accuracy. \n*The ability to lift 25 lbs or more.\n\n\nBenefits:  \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of New York's most well-known and loved restaurants. They include Locanda Verde, The Dutch, Joe's Pub & The Library at the Public, Lafayette Grand Café & Bakery, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House,  The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"BAKERS for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/bakers-for-lafayette/6582131401.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nAbout Sakara:\n Sakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our kitchen. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tMust be able to stand and/or sit for extended periods of time, with or without reasonable accommodation\n•\tExposure to refrigerated or freezer space for extended periods of time\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tAbility to work in multiple roles throughout kitchen and warehouse\n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tAssembling, labeling, and packaging meals and customer packages in a cold pack room\n•\tCooking and food prep tasks including: cleaning, chopping, cooking vegetables and fruit, making sauces, baking, etc.\n•\tPortioning soups, sauces, dressings\n•\tPerforming daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\nPlease send along a copy of your resume for review. \n\n\n    ","title":"Prep Cook/Food Packer/Production Associate","url":"https://newyork.craigslist.org/brk/fbh/d/prep-cook-food-packer/6581831329.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nHi there job seekers,\nWe are a busy laundry service in lower and midtown Manhattan\nWe need a person with outstanding attendance, with little to none call outs.\n\nYou need to have:\n1. Some English\n2. Drivers License and Driving experience of 4 years or more\n3. Smartphone\n4. Very punctual personality\n5. No drama\n6. Fit to lift heavy bags and dry cleaning hanger packs.\n7. Laundry delivery experience will be a HUGE PLUS\n\nWe will provide\n1. Steady employment\n2. Steady pay ($650 cash weekly + cash tips)\n3. Weekly work (8-9 hours Monday to Friday, 3 hours on Saturday)\n4. Cool family like atmosphere\n5. We pay for gas and provide car for work,\n6. Will reward drivers who receive no parking tickets or have 1 a month (driver responsible for parking tickets outside of the work hours and areas).\n\nPlease apply at this link HERE\n\n\nWe will schedule an interview and talk in person\nGood Luck with Job Hunting    ","title":"Driver for Laundry/Dry Cleaning Service","url":"https://newyork.craigslist.org/mnh/lab/d/driver-for-laundry-dry/6580852405.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nPA needed in medical office conveniently located on Queens Blvd in Rego Park, Queens focused on Nephrology and Internal Medicine. Possibility of working full time or part time. We will work with the right candidate to construct a schedule that works for both sides. Weekend hours also available if desired.  \n\nBoth experienced candidates and recent graduates are welcome. We will provide training/guidance in Nephrology/hypertension/kidney disease which is a major focus of our practice. \n\nPleasant work environment with no on-call duties. Competitive compensation with growth potential that will reward developing and meeting the goals of the practice. Will arrange for Health Benefits, tax-deferred retirement savings plan, malpractice, vacation, time off on all federal holidays, and CME. \n\nRequirements:\n\n-New York State active, unrestricted PA license prior to start date is required. \n-Must be knowledgeable in EHR, medical documentation.\n-Must have excellent written English, communication and customer service skills.\n-Medical Spanish a plus. \n\nPLEASE RESPOND WITH YOUR RESUME AND CONTACT INFO AND WE WILL GET BACK TO YOU.  \nIF YOU HAVE QUESTIONS OR WISH TO DISCUSS, PLEASE \nCALL (347) 530-0319.\n    ","title":"PA (PHYSICIAN ASSISTANT), FOR QUEENS MEDICAL OFFICE","url":"https://newyork.craigslist.org/que/hea/d/pa-physician-assistant-for/6580555949.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNOW HIRING School Crossing Guards for IMMEDIATE OPENINGS at schools in FREEPORT, NEW YORK!\n\nEarn $44.25 for 3 hours work TOTAL per day! MUST work an AM and PM shift each day. This is very important and rewarding PART-TIME employment protecting children as they walk to and from school. We work on school days only -- NO nights, NO weekends, NO holidays!\n\nRetirees and students (over 18 years old) welcomed!\n\n*FREE UNIFORMS* \n*EMPLOYEE REFERRAL REWARD OPPORTUNITIES* \n*DIRECT DEPOSIT*\n\nMINIMUM REQUIREMENTS:\nMust have reliable transportation. \nMust successfully complete Criminal Background Check. \nMust have availability to work a shift before school AND a shift after school.\n\nFind out more about opportunities in your area, and join our family!\n\nAPPLY HERE! http://acmssafety.com/employment    ","title":"SCHOOL CROSSING GUARDS - Part Time - FREEPORT, NY","url":"https://newyork.craigslist.org/lgi/lab/d/school-crossing-guards-part/6580201284.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNOW HIRING School Crossing Guards for IMMEDIATE OPENINGS at schools in RYE, NY!\n\nEarn $54.00 for 2 hours work total per day! MUST work an AM and PM shift each day.This is very important and rewarding PART-TIME employment protecting children as they walk to and from school. We work on school days only -- NO nights, NO weekends, NO holidays!\n\nRetirees and students (over 18 years old) welcomed!\n\n*FREE UNIFORMS* \n*EMPLOYEE REFERRAL REWARD OPPORTUNITIES* \n*DIRECT DEPOSIT*\n\nMINIMUM REQUIREMENTS:\nMust live within area applying to work in.\nMust have reliable transportation. \nMust successfully complete Criminal Background Check. \nMust have availability to work a shift before school AND a shift after school.\n\nFind out more about opportunities in your area, and join our family!\n\nAPPLY HERE! http://acmssafety.com/employment    ","title":"SCHOOL CROSSING GUARDS - Part Time - RYE, NY","url":"https://newyork.craigslist.org/wch/lab/d/school-crossing-guards-part/6580200487.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house management team is seeking a MAITRE'D to join them in welcoming guests to THE DUTCH, Chef ANDREW CARMELLINI's roots-inspired American restaurant, bar and oyster room in SoHo named the \"Best New Restaurant\" to open in 2011 by The New York Times.\n\n\nIdeal candidates possess: \n- Plan the seating of the dining room via Open Table.\n- Oversee the dining room and make it a warm and welcoming place.\n- Ensure all guests have an exemplary dining experience.\n- Actively take and process reservations.\n- Answer incoming calls and questions.\n- Assist in coordinating the activities of dining room personnel to provide fast friendly service to guests.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n\n    ","title":"MAITRE'D for THE DUTCH","url":"https://newyork.craigslist.org/mnh/fbh/d/maitred-for-the-dutch/6580013598.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChefs ANDREW CARMELLINI'S team is looking for friendly, hard-working PASTRY COOKS that are eager to learn in an energetic downtown environment at LITTLE PARK; a seasonal restaurant highlighting the best ingredients from longtime partnerships with local farmers, anglers, vintners, ranchers and foragers, in the Smyth Hotel in TriBeCa.\n\n\nIdeal Candidates:\n*Have excellent baking skills.\n*Have experience on dessert stations in the kitchen.\n*Are able to lift 25 lbs or more.\n*Prepare and execute key components of dishes.\n*Are well versed in restaurant operations, food handling and safety.\n*Support their fellow cooks and contribute to leading a team in a busy atmosphere.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n    ","title":"PASTRY COOKS for LITTLE PARK","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-for-little-park/6579986674.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSeasonal Tennis Pro Shop Assistant (Light court and facility maintenance) at Richmond County Country Club, Staten Island, NY\n\n***HIRING NOW***\n\nTENNIS BACKGROUND Preferred\n\n2018 Seasonal Tennis Pro Shop Assistant (we close in October)\nCompensation: $13/hour \nEmployment type: part-time \n\nTENNIS BACKGROUND Preferred \n\nTENNIS JOB OPENING \nPrefer tennis playing or working background. Must be available to work shifts between 7:30AM-9PM Monday-Sunday in Summer and after school during the school year.  Must be available and egger to work all summer.  We are looking for someone who is professional and who constantly works to make the Club environment a better place. This job is busy and an active outgoing person is required. Must like working hard and finding ways to improve our Club.\n\nJob entails handling incoming phone calls, making calls to promote events, answer questions and lesson appointments. Tennis assistant will groom our tennis courts and perform light cleaning/maintenance jobs. The position requires a professional, friendly and outgoing personality and a neat appearance. Our work environment is busy and there is frequent tasks are needed to be performed by the tennis assistants. Must have computer knowledge. Having experience in the service industry preferred as well as tennis playing or working experience. Applicants who are outgoing, well groomed, and available weekdays and weekends are well suited for this position. No phone calls please. Please list any tennis background when applying.\n\nWe are looking for a very strong workers who knows how to deal with member needs and who will help out whenever they can. Having a background in tennis is very helpful to understand the environment here.\n\nMust be able to lift up to 80 pounds at times.\n\nWe have two shifts per day.  NOTE: With fall and spring schedules, we alter the schedule a bit due to limited hours of play as we have no tennis court lights. We will be closing for the season in October and strong employees will be invited to return in the spring of 2019.\n\nStaff here need to be focused on member service and keeping the place as clean and stocked up with various supplies and amenities for members as possible.\n\nWe reward the hardest workers with more hours, higher pay, and future employment. We are seeking to find regular staff to help over the next few years if possible.\n\nNOTE: Applicants will NOT be contacted unless a short letter of interest is included and addressed to Scott Nagle. This will help ensure that interested candidates receive the most attention.\n\n\n    Principals only. Recruiters, please don't contact this job poster.\n    do NOT contact us with unsolicited services or offers\n\n\n    ","title":"Tennis Office Assistant+Court Care+Light Maintenance+Food Service","url":"https://newyork.craigslist.org/stn/fbh/d/tennis-office-assistantcourt/6579762330.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTo View this Job and Apply: Click Here\n\n\nKeyMe is a New York City startup revolutionizing the locksmith industry with innovative robotics and mobile technology.\n\nDescription\n\n\n\nWe've raised $105 million to date from top-tier investors, include Comcast Ventures, Battery Ventures, 7-Eleven, and White Star Capital.\nAbout the Role:\nKeyMe's Customer Service team is the public face of a fast-growing key-copying and locksmith startup.\n You'll handle a high volume of calls, chats, and emails from existing customers, as well as people in tough lockout situations who need fast, safe, and reliable help. This role offers career skills development and a lot of room for growth within the company.\nRequirements:\n\nAt least 1 year in a customer service role. Startup experience not required! Retail, hospitality, etc. are great backgrounds for this role.\nAvailability for evening and weekend shifts (please indicate your availability in the Q&A).\nFluency in Spanish and English is preferred, but not required.\nPrior experience in an office environment a plus, but not required.\nExperience handling a high volume of calls and emails from customers or clients a plus.\nSales experience is relevant as well.\nExperience using Zendesk, Talkdesk, and/or Google Docs a plus.\nGenuine empathy and tough skin!\n\nBenefits:\n\nHealth, dental, and vision insurance.\nFlexible Spending Account (FSA).\nHealth Savings Account (HSA).\nSnacks and drinks in the office!\nKeyMe Fun Activities Committee (KFAC).\n401K plan and stock options.\nPaid Time Off and Commuter Benefits.\nMonthly team contests to reward top performers!\n\n\n\n\n\n\n\n\n\n\n\nKeyMe is revolutionizing the locksmith industry with innovative robotics and mobile technology. They're hiring Customer Service Associates with at least 1 year of customer service experience -- retail, hospitality, and other backgrounds welcome! You'll handle a high volume of calls, chats, and emails from existing customers as well as people in tough lockout situations who need fast, safe, and reliable help. Candidates bilingual in English and Spanish are especially encouraged to apply!\n\n\n\n\n\n\nTo View this Job and Apply: Click Here\n\nPowered by Planted, where young professionals find awesome jobs at high-growth startups. Learn more about Planted on our website and in the New York Times.    ","title":"Customer Service Associate role at HIGH GROWTH TECH STARTUP","url":"https://newyork.craigslist.org/mnh/csr/d/customer-service-associate/6579605189.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur pastry team at Bar Boulud is growing! We are looking for pastry cooks who are interested in learning and growing with us at Chef Daniel Boulud's Lyonnaise-inspired French bistro. Experience is not a necessity, but the desire and passion to serve quality pastry is.\n\nSkills & Requirements: \n•\tMust have schedule flexibility (including nights and weekends) \n•\tAbility to work as part of a team \n•\tPassion for both classic and contemporary approaches to Pastry \n•\tAbility to multi-task in a face-paced environment\n\nBenefits: \n•\tTeam-Oriented Environment that Cares About One Another \n•       Paid Time Off \n•\tEmployee Referral Reward Program \n•\tMedical, Dental and Vision Insurance \n•\t401 (k) with Company Match \n•\tEmployee Dining Discount\n\nif you would like to join the team, please send an updated resume to Chef Daniel Kleinhandler at DKleinhandler@danielnyc.com    ","title":"Pastry Cooks - Bar Boulud/Boulud Sud","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-bar-boulud/6579503201.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nClassic Man Barber Lounge is a premium barbershop offering New York's professional and progressive gentlemen excellent grooming services in a therapeutic and multicultural environment.\n\nClassic Man Barber Lounge is a newly developed barbershop located in East Village (Lower Eastside / 10009); and we are looking for licensed / experienced barbers who have a great work ethic, easy-going attitude, and an appreciation for high quality client service.\n\nClassic Man Barber Lounge offers a premium location, positive and unique environment, routine technical training, and other professional development services.\n\nPosition Type / Pay Structure:\n---Full-Time / Part-Time Barbers\n---Commission and/or Fixed Based Rent (Monthly / Weekly)\n---Bonus and Reward Incentives\n\nRequired License / Certification\n---Valid New York Barber License\n\nRequired Technical Skills\n---Clippers/Scissor Haircuts, Straight Razor, Bread Trim, Hair Styling\n\nOther Requirements\n---Professional / Confident / Approachable / Easy-Going Demeanor\n---Great Communication / Client-Service Skills\n---Prior Work-Experience at a Barbershop / Salon (Minimum 1 Year)\n---Team-oriented / Willing to Work within Team Structure to Develop a New Barbershop Brand / Reputation\n\nPlease submit application via link below and/or email your resume.\n\nJob Types: Full-time, Part-time, Temporary, Commission    ","title":"Position on Barber / Stylist Team - Classic Man Barber Lounge","url":"https://newyork.craigslist.org/mnh/spa/d/position-on-barber-stylist/6579395043.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\n\n\nJob Description\n\nBecome the Teacher You Imagine You Can Be!\nJoin the teaching team at Imagine Early Learning Centers, an\nEmployee Owned Company.\nPosition: Assistant Teacher\nLocation: Upper East Side, Manhattan\nImagine Early Learning Centers seeks a Full-Time Assistant\nTeacher for our childcare center located on the Upper East\nSide. Our center is a safe, nurturing, fun and friendly environment.\nClassroom ages run from infant to PreK.\nWe are seeking an experienced, energetic and creative professional\nto join a team providing the highest quality childcare for working\nfamilies. \nResponsibilities include: \n\nParticipating in planning and implementing developmentally\nappropriate curriculum\nEffective communication with families and co-teachers\nAbility to adhere to licensing and NAEYC guidelines\nEffective written communication skills\nAbility to meet physical requirements of position which include\nlifting children, pushing strollers/buggies, sitting on the floor and\nyear-round daily outdoor activities.\n\nCompetitive salaries and benefits including:\n\nPaid Time Off (Vacation and Sick)\nMedical, Dental, and Vision coverage\nFlexible Spending Account (FSA)\nRetirement Benefits (Employee Stock Ownership Plan)\nSupplemental Insurance (NY Life, Aflac)\nTransit Chek\nTuition Reimbursement/Degree Incentive Reward\nEducational Support Programs available\nChildcare Discount where available\nProfessional Development\n\nAdditionally, in 2018 Imagine officially became an employee owned\ncompany through the creation of an ESOP (Employee Stock Ownership\nPlan). What this means is not only do we value and possess an ownership\nculture, all qualified employees at Imagine receive a retirement\nbenefit without paying any contributions to the fund themselves.\n\nQualifications\n\n\nMinimum of CDA or AA in Early Childhood, Elementary, Special\nEducation or related field required (or in progress)\nPrevious experience teaching children in an Early Childhood\nprogram required\nBA in Early Childhood, Elementary, Special Education or related\nfield a plus\nPrevious experience with NAEYC standards and the accreditation\nprocess preferred\n\nWho We Are \nImagine Early Learning Centers, an employee owned child care\nmanagement company, operates ten high quality, full day licensed and\nNAEYC accredited Early Childhood centers in the NY metro area for\nchildren 6 weeks to 5-years-old. With state of the art facilities,\nprofessional development opportunities for promotion, a teamwork\napproach to classroom and center management, and a creative and\nrewarding work environment, Imagine maintains a satisfied and talented\nteacher staff. At Imagine, we know children, as well as staff and\nfamilies, thrive in a stimulating and nurturing environment. Staff,\nchildren and families alike are valued as individuals and as members of\nour diverse community.\nAdditional information\n\nImagine Early Learning Centers is an equal opportunity/affirmative\naction employer and will not discriminate against any employee or\napplicant on the basis of age, color, disability, gender, national\norigin, race, religion, sexual orientation, veteran status, or any\nclassification protected by federal, state, or local law.\n\n\nPlease apply online with Imagine Early Learning Centers at: https://imagineelc.hiringthing.com/job/61670/assistant-teacher-early-childhood?s=cl\n\n    ","title":"Assistant Teacher (Early Childhood)","url":"https://newyork.craigslist.org/mnh/edu/d/assistant-teacher-early/6579391720.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\n\n\nJob Description\n\nBecome the Teacher You Imagine You Can Be!\nJoin the teaching team at Imagine Early Learning Centers.\nPosition: Pre-K Teacher\nLocation: Brooklyn Heights, Brooklyn\nImagine Early Learning Centers seeks a Full-time Teacher for our\nPre-K classroom at our Brooklyn Heights location in Brooklyn. It is a\nmixed age group ranging from 3-5 years old. \nWe are seeking an experienced, energetic and creative professional\nto join a team providing the highest quality childcare for working\nfamilies. Our center is a safe, nurturing, fun and friendly\nenvironment. Most importantly, we are seeking a head teacher who is NYS\nCertified B-2.\nResponsibilities include: \n\nParticipating in planning and implementing developmentally\nappropriate curriculum\nEffective communication with families and co-teachers\nAbility to adhere to licensing and NAEYC guidelines\nEffective written communication skills\nAbility to meet physical requirements of position which include\nlifting children, pushing strollers/buggies, sitting on the floor and\nyear-round daily outdoor activities.\n\nCompetitive salaries and benefits including:\n\nPaid Vacation and Sick Time\nMedical, Dental, and Vision coverage\nFlexible spending accounts (FSA)\nSupplemental Insurance (NY Life, Aflac)\nTransit Chek\nTuition Reimbursement/Degree Incentive Reward\nEducational support programs available\nChildcare Discount where available\nProfessional Development\n\nQualifications\n\n\nMinimum of BA in Early Childhood, Elementary, Special Education\nor related field\nNY State B-2 Certification REQUIRED\nMA in Early Childhood, Elementary, Special Education or related\nfield, a plus\nPrevious experience teaching children in an Early Childhood\nprogram\nPrevious experience with NAEYC standards and the accreditation\nprocess a plus\n\nWho We Are: \nImagine Early Learning Centers, LLC, operates ten high quality, full\nday licensed and NAEYC accredited Early Childhood centers in the NY\nmetro area for children 6 weeks to 5-years-old. With state of the art\nfacilities, professional development opportunities for promotion, a\nteamwork approach to classroom and center management, and a creative\nand rewarding work environment, Imagine maintains a satisfied and\ntalented teacher staff. At Imagine, we know children, as well as staff\nand families, thrive in a stimulating and nurturing environment. Staff,\nchildren and families alike are valued as individuals and as members of\nour diverse community.\n\nAdditional information\n\nImagine Early Learning Centers is an equal opportunity/affirmative\naction employer and will not discriminate against any employee or\napplicant on the basis of age, color, disability, gender, national\norigin, race, religion, sexual orientation, veteran status, or any\nclassification protected by federal, state, or local law.\n\n\nPlease apply online with Imagine Early Learning Centers at: https://imagineelc.hiringthing.com/job/67228/upk-teacher?s=cl\n\n    ","title":"UPK Teacher","url":"https://newyork.craigslist.org/brk/edu/d/upk-teacher/6579387934.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI is looking for friendly, hard-working LINE COOKS to join their team at MISTER DIPS and THE POOL at THE WILLIAM VALE HOTEL.\n\n\nMISTER DIPS, a retrofitted 1974 Airstream serving burgers, fries and seasonal Dairy Dips, is the main attraction of Vale Park, The William Vale hotel's 20,000-square-foot public outdoor park overlooking Wythe Avenue in Williamsburg.\n\n\nIdeal Candidates: \n*Expect to work multiple stations: cook, cashier, runner. \n*Take food and drink orders, prepare food and receive payment from customers. \n*Ensure quality and accuracy of products and dishes. \n*Have knowledge of cooking procedures, safety and sanitation. \n*Are able to lift 25 lbs or more. \n*Support their fellow cooks.\n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Educational Courses and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House,The Cannon Room, and Rye Street Tavern in Baltimore.\n\n    ","title":"LINE COOKS for MISTER DIPS & THE POOL at THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/line-cooks-for-mister-dips/6578995543.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and the front-of-house management team are seeking BARTENDERS, RUNNERS, BUSSERS, BARBACKS, & HOSTS to join them at THE TURF CLUB at THE WILLIAM VALE! \n\n\nTHE TURF CLUB is a summer pop up venue on the 23rd Floor rooftop of The William Vale hotel in the heart of Williamsburg, features sweeping views of the five boroughs and beyond, serving rare spirits, craft cocktails and an elevated bar dining menu inspired by New York City's street food.\n\n\nIdeal candidates possess: \n*Positive attitude and strong work ethic with the mentality of a team player. \n*Great communication skills. \n*The ability to function comfortably in busy environments. \n*Interest in food, wine and spirits culture.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Short Term Disability, Life Insurance, Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House, The Cannon Room, and Rye Street Tavern in Baltimore.\n\n    ","title":"FOH TEAM MEMBERS for THE TURF CLUB at THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/foh-team-members-for-the-turf/6578931337.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNoHo Hospitality Group Is Hiring an Office Administrator!\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\n\nThe Office Administrator supervises and coordinates all administrative activities for NoHo Hospitality Group Headquarters. Aptitude for administration, organization, clear communication and follow through on tasks in accordance with NoHo Hospitality Group company vision and standards is essential.\n\n\nResponsibilities: \n*Day-to-day office operations, maintenance and organization. \n*Manage the reception area to ensure effective telephone and email communications both internally and externally. \n*Provide office guests with a hospitable experience. \n*Purchase office supplies, furniture and office equipment for office. \n*Book travel arrangements for partners and operations team. \n*Participate as needed in special office projects.\n\n\nRequirements: \n*Bilingual (English/Spanish)\n*Outstanding organizational, communication and time-management skills. \n*Detail-oriented, excellent multi-tasking abilities. \n*A warm and friendly delivery while welcoming guests to the office. \n*Strong proficiency in Microsoft Office.\n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n    ","title":"OFFICE ADMINISTRATOR for NOHO HOSPITALITY GROUP","url":"https://newyork.craigslist.org/mnh/fbh/d/office-administrator-for-noho/6578728626.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAmazing office in Dobbs Ferry looking for a new addition to our team! We are looking for someone to greet patients and make them feel welcome and comfortable. Assist your office manager with administrative duties. Someone who is dependable, on time, energetic, happy and a team player. Experience is a must! Must have Dentrix, dental insurance and billing experience. Must be able to verify insurance benefits, collect copays, schedule patients, answer phones and willing to work independently.\n\nThe hours of the position are: Monday - Tuesday 10:45am - 8:00pm\n                                                Wednesday - Friday 7:45am - 5:00pm\n\nWe offer a competitive salary based upon experience, along with monthly bonus potential that is based upon meeting or exceeding monthly operational goals.\n\nYour commitment to our office is the key to our success. In turn, we'll reward you with a benefits package that shows we care about you and your future.\n\nPlease forward your resume and cover letter via email please include your salary requirement and your available start date for immediate consideration.\n\nJob Type: Full-time\n    ","title":"Dental Front Desk Receptionist","url":"https://newyork.craigslist.org/wch/hea/d/dental-front-desk-receptionist/6578629496.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's team is looking for friendly, hard-working TOURNANTS that are eager to learn in an energetic downtown environment.\n\n\nLAFAYETTE  is an everyday grand café and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan.\n\n\nIdeal Candidates:  \n*Have excellent knife skills \n*Have knowledge of cooking procedures, safety and sanitation \n*Have experience on multiple stations in the kitchen \n*Are able to lift 25 lbs or more \n*Prepare and execute key components of dishes \n*Ensure quality and accuracy of products and dishes \n*Support their fellow cooks\n\n\nBenefits:  We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"TOURNANT for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/tournant-for-lafayette/6577922643.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Brian Nasworthy's team is looking for passionate, hard-working LINE COOKS to join them at LAFAYETTE Grand Cafe & Bakery in NoHo.\n\n\nLAFAYETTE is an everyday grand cafe and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan. Our market-driven bistro menu is a worldly homage to the genre that spans a variety of regions, from Provence to Normandy to neighboring Mediterranean coasts, offering a re-mastery of traditional dishes we love and some signatures.\n\n\nIdeal Candidates:\n*Have excellent knife skills.\n*Have knowledge of cooking procedures, safety and sanitation.\n*Are able to lift 25 lbs or more.\n*Ensure quality and accuracy of products and dishes.\n*Support their fellow cooks.\n\nBenefits: \n*Competitive wages\n*Medical, dental, and vision benefits (after 90 days of employment for full time employees)\n*401(k)\n*Paid Time Off\n*Employee Dining Discount\n*Additional Discounts: ZipCar, SkinSpa, Gym Membership, YogaWorks and more!\n*Transit Benefit Program\n*Continuing Education Classes  \n*Referral Reward Program and more!\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\nNoHo Hospitality Group recently made the coveted, annual Inc. 5000 list for 2016 of the fastest growing private companies in America.\n\n    ","title":"LINE COOKS for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/line-cooks-for-lafayette/6577923033.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNoHo Hospitality Group Is Hiring an Office Administrator!\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\n\nThe Office Administrator supervises and coordinates all administrative activities for NoHo Hospitality Group Headquarters. Aptitude for administration, organization, clear communication and follow through on tasks in accordance with NoHo Hospitality Group company vision and standards is essential.\n\n\nResponsibilities: \n*Day-to-day office operations, maintenance and organization. \n*Manage the reception area to ensure effective telephone and email communications both internally and externally. \n*Provide office guests with a hospitable experience. \n*Purchase office supplies, furniture and office equipment for office. \n*Book travel arrangements for partners and operations team. \n*Participate as needed in special office projects.\n\n\nRequirements: \n*Bilingual (English/Spanish)\n*Outstanding organizational, communication and time-management skills. \n*Detail-oriented, excellent multi-tasking abilities. \n*A warm and friendly delivery while welcoming guests to the office. \n*Strong proficiency in Microsoft Office.\n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n    ","title":"OFFICE ADMINISTRATOR for NOHO HOSPITALITY GROUP","url":"https://newyork.craigslist.org/mnh/fbh/d/office-administrator-for-noho/6576829122.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential. Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/brk/bus/d/field-sales-representative/6576640542.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential. Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/brk/mar/d/field-sales-representative/6576640543.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential. Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/brk/sls/d/field-sales-representative/6576640548.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential.  Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com\n    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/que/bus/d/field-sales-representative/6576632603.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential.  Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com\n    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/que/mar/d/field-sales-representative/6576632605.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential.  Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com\n    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/que/ret/d/field-sales-representative/6576632606.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nFIELD SALES & MARKETING REPRESENTATIVE - Techtronic Industries, NA (TTI) \n\nAbout Us: \n\nTTI is a world-class leader in design, manufacturing and marketing of power tools and accessories, outdoor product equipment and floor care for consumers, professional and industrial users in the home improvement, repair and construction industries. Our unrelenting strategic focus on powerful brands, innovative products, operational excellence and exceptional people drives our culture. This focus and drive provides TTI with a powerful platform for sustainable leadership and strong growth. \nOur brands and products are recognized worldwide for their deep heritage, superior quality, outstanding performance and compelling innovation. Our products include professional power tools and accessories, outdoor power equipment and floor care. Brands represented include Milwaukee®, AEG®, Ryobi®, Homelite®, Hoover®, Dirt Devil®, Oreck ® and Vax®. \nTTI is fast-paced, our team is high energy, and we reward out-of-the-box thinking to foster innovation in order to be the best in our industry. We provide a multi-faceted training program and hands-on field experience that will stimulate, challenge and reward you! \n\nDuties and Responsibilities: \n•\tPerform best-in-class sales and service to consumers while demonstrating knowledge and enthusiasm for TTi products. \n•\tMaximize sell through of Ryobi®, Homelite®, and Milwaukee® brands by properly merchandising point of purchase material. \n•\tSupport and implement strategic corporate brand marketing initiatives and promotional activities. \n•\tStrengthen and maintain positive relationships with customers, Team TTi Management, and The Home Depot. \n•\tMaintain regular contact with assigned Home Depot store associates and management to cultivate strong relationships. \n•\tMonitor weekly sales and analyze monthly results to identify additional opportunities and understand the competition. \n•\tParticipate in the Leadership Development Training Program and implement all acquired skills to deliver results. \n•\tInitiate and provide in-store product training sessions and demonstrations to educate store associates, management and customers. \n•\tProfessionally communicate with all peers, customers and management. \n•\tPlan and execute demo events, stores walks, trade shows, etc. \n•\tDevelop primary knowledge of the market place (users, applications, products, competition, and channels) to effectively analyze market potential and communicate competitor market data. \n\nNote: Employee's duties and responsibilities are not limited by the above. Other duties may be assigned as deemed necessary by employee's supervisor. In addition to the basic requirements of the position, all employees are expected to meet the company's goals of continual improvement in the areas of knowledge, skills, processes and quality. \n\nEducation and Experience Requirements \n•\tBachelor degree or equivalent work experience in retail sales, field sales or customer service required. \n•\tValid driver's license required. \n•\tRelocation may be required for future promotional opportunities. \n•\tAbility to work nights and weekends. \n•\tCapable of lifting and transporting heavy tools (up to 50 lbs.) and requesting assistance as needed. Capable of reaching and/or lifting overhead in addition to ascending/descending ladders to move product. Capable of using hands to maneuver small objects, assemble tools and build displays. \n•\tApplicant should be self-motivated and a team player with strong organizational, planning and time management skills. \n\n\nSalary: Starting at $42,500, plus quarterly bonus potential.  Includes company vehicle + Phone + 401k & benefits.\n\nIf interested, please send resume to Thomas.kentouris@ttigroupna.com\n    ","title":"FIELD SALES REPRESENTATIVE -MILWAUKEE, HOOVER, RYOBI","url":"https://newyork.craigslist.org/que/sls/d/field-sales-representative/6576632607.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nStaten Island residents only please. NYC is too far a drive from our NJ location\n\nText Dave the owner at 973 647 7769\n\nThere is nothing more reliable than Plumbing, Heating and Air conditioning, they can't export a trade to India! LOL!!! The sky is the limit, maybe even own your own company someday! Our last \"Salsy\" Tech cleared 120K two years running before moving out of state to start his own business. Between his regular hourly pay, overtime pay and bonus/reward money he averaged $52 hr!\n\nHVAC Technician \"Golden Ticket\" Opportunity! The free training alone is worth tens of thousands of dollars and a career in this field can bring you hundreds of thousands of dollars over the years! We have the Best trucks, Best people, Paid training, Fastest career path and Compensation. We keep our HVAC Techs busy year round, because our people are crossed trained do basic plumbing calls too! (HVAC Techs in trucks with Lead Plumbers in slow season) Some even go on to receive their Master Plumbers license! \n\nIf you lie, cheat, steal or do hard drugs, please skip further reading this Craig's list post, as it's not for you. However, if you truly live a clean lifestyle, have life goals and would like to enjoy the benefits of working with an elite team where honesty, organization and good character thrive, please read on!\n\nBeing a great communicator is a requirement. Diagnosing, selling, repairing and servicing residential equipment a must. Your current employer WILL NOT be contacted. At Good Tidings, we understand your desire to not waste time with interviews that are not likely to pan out. Why get dressed up and drive to a business location, only to spend even more time being paraded around the office? There's a better way!\n\nWith the convenience of your laptop, you can now \"Interview\" from the comfort and privacy of your home. If you want a career where you can make more money and leave the daily frustrations of your current job behind, then why not accept my invitation by clicking this link? http://goodtidings.applybyweb.com (Click the Technician / Plumber tab)\n\nTo get the most attention, text or call the owner at 973 647 7769 \n\nVisit:\nwww.goodtidingscomfort.com\nwww.facebook.com/GoodTidingsComfort\nhttps://youtu.be/fJRjZyjQfBA\n\nWe're currently searching for a great communicator who is interested in getting more out of life; more time off, more money, more career opportunity, more training, more support, more appreciation and more fulfillment. We are looking for someone who can appreciate the work/life balance that our company can deliver for them.\n\nQuote from one employe:\n\"I started working a few months ago, came in with no experience and they welcomed me with opened arms. They are more than willing to teach and accommodate my learning curve. Everyone from the office to the warehouse and the Technicians are all a big family. The guys in the field really get along together, want to see each other succeed and its great to be around that environment. I enjoy working here; it's a real family atmosphere. Also, learning from these Technicians that are such masters or their craft is something to strive for!\"\n~ Steve P\n\nBetter yet, here is what Adam had to share:\nLess than 2 years ago I started with Good Tidings and now I am on my way to becoming a full technician. I'm so excited, I just returned from a week of paid sales and customer service training in California and I'm looking forward to using my new skills! The motivation, training and pay increases come along with every step of the way, and you are most certainly not alone when help is needed because we are a team. All the technicians and office staff are like a second family and everyone is there to help out if the going gets tuff. I couldn't have pictured a better environment to learn and grow in this trade, and for that I am truly grateful. \n~ Adam M.\n\nOK, this next part is ONLY for you Doubting Thomas's out there.\n\nI've been hearing from some applicants lately who took years before reaching out to me. They were thinking the Craig's list ad was too good to be true and likely the work of a recruiter. A positive, straight forward, honest, cutting edge Plumbing, Heating and Air-conditioning company here in NJ? Applicants quickly expressed their relief after speaking with me and wished they'd reached out sooner, instead of wrongly thinking that the ad was the product of some scam. \n\nWorse yet, they might have been thinking I was like the big, unethical, money hungry, state wide, corporate owned, get away with whatever I can, \"Teach and reward my people for lying\", soon to be in the papers and speaking and with the Attorney General for ripping off the elderly, type of company (Can you tell how I feel just yet?).\n\nIn an effort to get ahead of these thoughts, please know that I am a very real family man, a 2nd generation Master Plumber, HVAC businessman and license holder. I built my company from scratch, and i care about my company, its people and my customers, enormously. \n\nI'm honest, ethical, integrity filled and unafraid. The cost of which, in the past, going through peak times with trucks sitting idle and the office turning lots of work away. Why turn all of that work and money away??? Because it was the right thing to do, in light of the lack of quality and character of the available workmen, which was way below what my customers expected and deserved for their hard-earned money. It's hard for most people to believe, but I value my faith and integrity above profits.\n\nFor you sceptics out there, I'm climbing out on a limb here, by sharing a very personal account of faith in the workplace. My goal is to put away any doubt or speculation out of your mind and have you see for yourself, what it's been like NOT to be held captive by money and to do the \"right thing\" in business, no matter what the cost. To God be the glory\n\nhttps://youtu.be/BZZQkxULXAo\n\nHonesty matters\n~ Dave\n29 years of faith filled family service!    ","title":"HVAC Techs NOT getting enough hours? Up to $40 Hr. year round!","url":"https://newyork.craigslist.org/stn/trd/d/hvac-techs-not-getting-enough/6576332096.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSince 2012 ICN Group, a mother company of Dream IT, has transformed tens of thousands of careers through providing various services like global internship programs, corporation visit, job placement, and language training. As the whole world changes fast in many ways and requires new human resource that can serve the fast pace society, we have recently established Dream IT, a vocational training school, where today's most in-demand skills are learned.  The mission of Dream IT is to provide our students the tools to build a better life through a high quality technical and workforce-readiness education in a structured environment that will ensure their success. \n\nWe're looking for competent program director & experienced instructors in our Midtown Manhattan location. Successful candidates will have a well-rounded background in subject courses:  \n1.\tWeb Programming  \n2.\tDatabase Management & Analysis  \n3.\tDigital Marketing  \n4.\tE-Commerce  \n5.\tMobile Development  \n\nYou should have experience of teaching one of these subjects\n\nRequirements\n•\tHave working knowledge of Competency Based Education\n•\tUnderstanding the best practices associated with online pedagogy and course design\n•\tExcellent oral, written, and interpersonal communication skills\n•\tCritical thinking and problem solving\n•\tAbility to create effective lesson plans\n•\tManage student data-tracking database\n•\tInspire students to persevere through the challenges of solving problems.\n•\tAbility to work effectively with a diverse population\n•\tSupport students as they drive their own continued learning beyond the curriculum\n•\tFacilitate a dynamic and collaborative classroom community\n•\tMust be able to commute \n\nEducation / Experience \n•\tMaster's degree in computer related majors\n•\tPreference will be given to PhD candidates with majors related to the subject areas above\n•\tThree years minimum hands on experience & teaching\n•\t5 years in leadership role in related area (director) \n\nDream IT offers competitive compensation in the market. \nSend your resume with a cover letter to jimmyj@icncareer.com\n    ","title":"Web, DB, App Instructors / Program director","url":"https://newyork.craigslist.org/mnh/edu/d/web-db-app-instructors/6576096565.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSince 2012 ICN Group, a mother company of Dream IT, has transformed tens of thousands of careers through providing various services like global internship programs, corporation visit, job placement, and language training. As the whole world changes fast in many ways and requires new human resource that can serve the fast pace society, we have recently established Dream IT, a vocational training school, where today's most in-demand skills are learned.  The mission of Dream IT is to provide our students the tools to build a better life through a high quality technical and workforce-readiness education in a structured environment that will ensure their success. \n\nWe're looking for competent program director & experienced instructors in our Midtown Manhattan location. Successful candidates will have a well-rounded background in subject courses:  \n1.\tWeb Programming  \n2.\tDatabase Management & Analysis  \n3.\tDigital Marketing  \n4.\tE-Commerce  \n5.\tMobile Development  \n\nYou should have experience of teaching one of these subjects\n\nRequirements\n•\tHave working knowledge of Competency Based Education\n•\tUnderstanding the best practices associated with online pedagogy and course design\n•\tExcellent oral, written, and interpersonal communication skills\n•\tCritical thinking and problem solving\n•\tAbility to create effective lesson plans\n•\tManage student data-tracking database\n•\tInspire students to persevere through the challenges of solving problems.\n•\tAbility to work effectively with a diverse population\n•\tSupport students as they drive their own continued learning beyond the curriculum\n•\tFacilitate a dynamic and collaborative classroom community\n•\tMust be able to commute \n\nEducation / Experience \n•\tMaster's degree in computer related majors\n•\tPreference will be given to PhD candidates with majors related to the subject areas above\n•\tThree years minimum hands on experience & teaching\n•\t5 years in leadership role in related area (director) \n\nDream IT offers competitive compensation in the market. \nSend your resume with a cover letter to jimmyj@icncareer.com\n    ","title":"Web, DB, App Instructors / Program director","url":"https://newyork.craigslist.org/mnh/sof/d/web-db-app-instructors/6576096573.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSince 2012 ICN Group, a mother company of Dream IT, has transformed tens of thousands of careers through providing various services like global internship programs, corporation visit, job placement, and language training. As the whole world changes fast in many ways and requires new human resource that can serve the fast pace society, we have recently established Dream IT, a vocational training school, where today's most in-demand skills are learned.  The mission of Dream IT is to provide our students the tools to build a better life through a high quality technical and workforce-readiness education in a structured environment that will ensure their success. \n\nWe're looking for competent program director & experienced instructors in our Midtown Manhattan location. Successful candidates will have a well-rounded background in subject courses:  \n1.\tWeb Programming  \n2.\tDatabase Management & Analysis  \n3.\tDigital Marketing  \n4.\tE-Commerce  \n5.\tMobile Development  \n\nYou should have experience of teaching one of these subjects\n\nRequirements\n•\tHave working knowledge of Competency Based Education\n•\tUnderstanding the best practices associated with online pedagogy and course design\n•\tExcellent oral, written, and interpersonal communication skills\n•\tCritical thinking and problem solving\n•\tAbility to create effective lesson plans\n•\tManage student data-tracking database\n•\tInspire students to persevere through the challenges of solving problems.\n•\tAbility to work effectively with a diverse population\n•\tSupport students as they drive their own continued learning beyond the curriculum\n•\tFacilitate a dynamic and collaborative classroom community\n•\tMust be able to commute \n\nEducation / Experience \n•\tMaster's degree in computer related majors\n•\tPreference will be given to PhD candidates with majors related to the subject areas above\n•\tThree years minimum hands on experience & teaching\n•\t5 years in leadership role in related area (director) \n\nDream IT offers competitive compensation in the market. \nSend your resume with a cover letter to jimmyj@icncareer.com\n    ","title":"Web, DB, App Instructors / Program director","url":"https://newyork.craigslist.org/mnh/web/d/web-db-app-instructors/6576096576.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are growing and looking for a Real Estate Salesperson to join our team.\n\nWe offer:\n-\tYear round professional sales training with national speaker,\n-\tInside support (We have 3 full-time assistants),\n-\tWe feed you leads daily,\n-\tOur listings are updated daily,\n-\tWe have a pre-listing agreement to help you close sales,\n-\tWe have a lot of apartments for rent and properties for sale.\n\nWe are looking for:\n-\tA motivated self starter who is good with people,\n-\tHas at least 1 year of experience in real estate,\n-\tWilling to work full-time,\n\n- We Recruit Selectively\n- We Market Aggressively\n- We Train & Coach Extensively\n- We Reward Handsomely\n\nWe are having a Recruitment Seminar at 12:00 pm on Friday, May 25th.\nIf you are interested, please call us at 347-450-3577 to set up the appointment. \n\nSelling Real Estate is not easy but can be very profitable.\nIf you feel that you have what it takes, call us today!\n\nWe are located in the heart of Williamsburg where the real estate market is HOT! The broker, Robert Napolitano, has 25 years experience in real estate. Contact him in confidence today at 917-225-7584.\n\nCapri Jet Realty CORP.\n533 Metropolitan Ave.\nBrooklyn, NY 11211\nwww.CapriJetRealty.com    ","title":"We are looking for Real Estate Salespeople! Recruitment Seminar 5/25","url":"https://newyork.craigslist.org/brk/rej/d/we-are-looking-for-real/6576063740.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nTHE EMPLOYER\n\nThe Brattle Group provides consulting and expert testimony in economics, finance, and regulation to corporations, law firms, and governments around the world. Our Principals are internationally recognized experts, and we have strong partnerships with leading academics and highly credentialed industry specialists around the world. For the fourth consecutive year, Brattle has been recognized in the Vault Consulting 50 as a top 10 consulting firm to work for and the highest among economic consulting firms. We have offices in Boston, MA; New York, NY; San Francisco, CA; Washington, DC; Toronto, ON; London, UK; Madrid, ES; Rome, IT; and Sydney, NSW.\n\nOur New York office is conveniently located in the heart of Midtown Manhattan and accessible by multiple subway, train, and bus lines. \n\nTHE POSITION\n\nAre you an experienced administrative professional who is looking for a challenging new role?  Does a fast-paced, dynamic, collaborative, and fun culture interest you?  We have an exciting opportunity for someone who is looking to immerse him/herself in an environment where they are able and encouraged to contribute to many facets of our daily business. We are seeking someone with senior/executive level administrative experience (5+ years) to join the Business Support Services (BSS) team as a Senior Administrative Assistant in our New York office. The ideal candidate is motivated, flexible, and energized by providing top-notch client service.  \n\nThis full-time position directly supports the Director of Global Development as well as a Principal in the areas of coordination of communications, business development, project coordination and other various administrative responsibilities such as travel, expenses, and monthly billing. As a member of the BSS team, the Senior Administrative Assistant also shares responsibility in keeping the office environment tidy, well stocked and provides meeting coordination and set-up.  Additionally, this position reports to and takes day-to-day direction from the Director and Principal and secondarily reports to a BSS Manager. \n\nSome of the day-to-day responsibilities of this role include:\n\n•\tPrepares, revises, formats, and finalizes a wide variety of documents, including but not limited to testimony, reports, memoranda, articles, and presentations;\n•\tTranscribes formal dictations from Director to produce daily client and firm correspondence and manages voicemail and email inboxes as requested by Director; \n•\tActs as gatekeeper of Director's calendar, manages scheduling and ensures that Director is on schedule and appropriately prepared;\n•\tManages Principal's and Director's day-to-day schedules/tasks, maximizing their time and efficiency; keep calendars updated; \n•\tUpdates and maintains client contact information and research and update current and potential client profiles, under the direction of Director and Senior Business Development Consultant;\n•\tActs as point of contact for clients on behalf of project teams;\n•\tManages project files, budgets, expenses, and monthly invoicing with project managers;\n•\tPrepares and submits expense reports on behalf of Director and Principal;\n•\tCoordinates all meetings including larger committee meetings as applicable; coordinates catering and meeting set up;\n•\tCoordinates all domestic and international business travel;\n•\tPerforms copying, binding, faxing, scanning, and materials distribution as requested;\n•\tInteracts with other Corporate Services departments in the firm such as IT, Accounting, HR, and Marketing to ensure applicable information is communicated to the Director, Principal, and other BSS team members.\n\nTHE CANDIDATE\n\nThe position requires demonstrated organizational, time management, and communication skills as well as the ability to prioritize and execute numerous projects and deliverables.  The ideal candidate will be a self-directed individual who thrives in a dynamic environment that also provides autonomy and accountability.\n\nOther requirements include: \n\n•\tBachelor's Degree preferred;\n•\tRequires a minimum of five (5) years of executive/senior-level administrative experience and project coordination, preferably in a law firm or other professional services firm;\n•\tExceptional customer service skills and an eagerness to go above and beyond;\n•\tWillingness to work in a collegial team environment;\n•\tAdvanced knowledge of Microsoft Word, PowerPoint, and Outlook is required;\n•\tAdvanced proficiency formatting documents in Microsoft Word and minimum typing speed of 70 words per minute required;\n•\tProficient use of MS Excel expected;\n•\tDatabase and budget tracking experience desired;\n•\tAbility to effectively manage time across all projects and deliverables;\n•\tAbility to exercise flexibility and appropriate judgment and to maintain confidentiality;\n•\tAcute attention to detail and ability to produce visually appealing and error-free work;\n•\tAbility to adapt easily to change;\n•\tAbility to work overtime, including night and weekend work as necessary;\n•\tOccasional travel.\n\nTHE PACKAGE\n\nWe offer a generous compensation and benefits package, including medical, dental, 401K/profit sharing, life and disability insurance, paid time off, and internal professional development and training programs, designed to reward success at all levels. Details regarding compensation will be based on the candidate's knowledge, skills, and experience. \n\nIn order to be considered for this position, Please apply through the Careers section of our website (http://www.brattle.com/careers) by submitting a cover letter and resume. \n\nThe Brattle Group is an equal opportunity employer: Minority/Female/Veteran/Disabled\n\n    ","title":"Senior Administrative Assistant","url":"https://newyork.craigslist.org/mnh/ofc/d/senior-administrative/6575758698.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur pastry team at Bar Boulud is growing! We are looking for pastry cooks who are interested in learning and growing with us at Chef Daniel Boulud's Lyonnaise-inspired French bistro. Experience is not a necessity, but the desire and passion to serve quality pastry is.\n\nSkills & Requirements: \n•\tMust have schedule flexibility (including nights and weekends) \n•\tAbility to work as part of a team \n•\tPassion for both classic and contemporary approaches to Pastry \n•\tAbility to multi-task in a face-paced environment\n\nBenefits: \n•\tTeam-Oriented Environment that Cares About One Another \n•       Paid Time Off \n•\tEmployee Referral Reward Program \n•\tMedical, Dental and Vision Insurance \n•\t401 (k) with Company Match \n•\tEmployee Dining Discount\n\nif you would like to join the team, please send an updated resume to Chef Daniel Kleinhandler at DKleinhandler@danielnyc.com    ","title":"Pastry Cooks - Bar Boulud/Boulud Sud","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-bar-boulud/6575683152.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe Are:\nA small, yet energetic team that works together to solve difficult problems. We value and reward hard work, but we also believe in a strong work-life balance. Our company focuses on helping developers make money through non-intrusive advertising. We are seeking a highly motivated individual for the position of Account Manager.\n\nYou are: \nA hunter - ambitious, and persistent. You know how to communicate well and are able to build strong and long lasting relationships. You are able to quickly find available opportunities and plan around them.\n\n\nJob Responsibilities:\n    Find prospective mobile clients who are looking to gain new users to their app\n    Conduct sales calls and meeting with clients\n    Travel to trade shows to meet with potential and existing advertisers\n    Understand a client's goals and find how they may align with AdGate Media's offerings\n    Manage and optimize clients' advertising campaigns on the AdGate Media platform\n    Work with our internal teams to help meet client needs\n\nRequirements\n    Strong oral and written communication abilities\n    Strong analytical skills\n    Ability to work independently\n    Exceptional organizational skills\n\nBonuses:\n    Experience working with digital advertising\n    Any relevant experience working with mobile apps\n\nPerks:\n    Health, Dental, and Vision insurance\n    Flexible work schedule\n    Weekly catered lunches\n    Casual work environment\n    Travel opportunities\n\n\nPlease apply here: http://careers.adgatemedia.com/o/account-manager-mobile?source=craigslist    ","title":"Account Manager, Mobile Adtech Company","url":"https://newyork.craigslist.org/mnh/mar/d/account-manager-mobile-adtech/6575671969.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nSakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our team. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tReceive all orders, update receiving log, liaise with managers to ensure order is put away properly\n•\tComplete daily organization of our warehouse space, walkin coolers, and freezer\n•\tOperate a pallet lifter and pallet jacks\n•\tPerform daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\n\n    ","title":"Warehouse Associate/Food Packer","url":"https://newyork.craigslist.org/brk/fbh/d/warehouse-associate-food/6575645707.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAbout Argo Tea\nArgo Tea's success is built on the dedicated work of our TeaMembers. That's why we strive to create a warm, inspiring work environment that rewards for their continous contributions. As part of this effort, we offer a full range of incentives and benefits:\n\n* Comprehensive medical, dental, vision, life and AD&D insurance programs for eligible employees and their dependents\n* Bonus and incentive programs intended to reward TeaMembers' outstanding performance, to motivate a collaborative spirit and TeaMwork\n* Product Entitlements. All TeaMembers get free drinks plus a discount on all other products\n* Prizes and contests intended to reward exceptional performance as well as to encourage healthy competition among our Team\n* 401K Retirement plan for eligible TeaMembers\n* Vacation Time for eligible TeaMembers\n* Stock Options for eligible TeaMembers\n* Sick Time for eligible TeaMembers\n* TeaMember Referral Bonuses\n* Education and Development Classes\n* Wellness programs, sports Teams, health & fitness classes \n\nFor all Argo Tea Positions in NYC\nApply Here    ","title":"Now Hiring: Argo Tea (All Positions)","url":"https://newyork.craigslist.org/mnh/fbh/d/now-hiring-argo-tea-all/6575643727.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nJOIN THE MERCHANT CASH ADVANCE INDUSTRY AND MAKE $100K YOUR FIRST YEAR. JOIN OUR BROKER TRAINEE PROGRAM -- PAID TRAINING PROVIDED WHILE YOU LEARN THE INS AND OUTS OF THE INDUSTRY. IF YOU CAN MAKE IT THROUGH THE PROGRAM YOU WILL MAKE $100K AND UP YOUR FIRST YEAR IN THIS BUSINESS.\n\nIf you have phone sales experience in any of the following industries this will get you to the front of the line:\n\nStockbrokers\n\nMortgage Brokers\n\nDebt Collectors\n\nCurrency Brokers\n\nWe are a Miami-Based ISO building out our NYC office. You have the opportunity to get in on the ground floor and run the show in 6 months. Learn to prospect, fund and renew merchants with the best in the industry while building a sustainable book of business that will reward you for months and years to come. If you have what it takes -- you'll make $100k or more your first year here.\n\nPLEASE BE AWARE THAT THIS IS A TREMENDOUSLY DIFFICULT UNDERTAKING AND IF YOU'RE PRONE TO WHINING OR COMPLAINING OR LEAVING WORK AT 6PM THIS ISN'T FOR YOU. IF YOU CAN PUT IN 12 HOUR DAYS AND YOU AREN'T SCARED OF REJECTION THEN CALL US SO YOU CAN START THE REST OF YOUR LIFE.\n\nSend in your resume and we'll be in contact to setup an interview. This is the kind of opportunity where 1 in 100 get to the finish line. If you have what it takes -- give us a call.\n\nBROKERS : Join a winning team. Experienced MCA brokers are encouraged to apply. We offer aggressive payouts and we always pay our brokers. You can work from home or build a team in our office.    ","title":"*MERCHANT CASH ADVANCE* SALARY + COMMISSION TRAINING PROGRAM","url":"https://newyork.craigslist.org/mnh/sls/d/merchant-cash-advance-salary/6575609339.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNueratrend Maids and Pros is looking for Professional Cleaners. Apply Here: https://form.jotform.us/nueratrend/employment-application-form\n\nNueratrend Maids and Pros is a NYC based local cleaning and interior painting service that focuses on the cleaning and painting of residential and commercial properties. \n\nWe are looking for professional cleaning technicians immediately! Full time and part time positions available. Work a flexible shift that fits your schedule. We are looking to hire at least 15 persons immediately! We seek high quality, professional cleaners.\nMust have:\n*Prior professional residential cleaning experience (however will train the right candidate)\n*Willing to work at least 30+ hours a week\n*Legally eligible to work in the United States\n*Able to travel all five Boroughs via subways, buses and trains\n\nOn the job Perks:\n- Stable hours, flexible shifts - up to 30 hours of work hours each week guaranteed.\n- Extra hours available if needed for all employees.\n- Compensation starts at $13.50 per hour but higher rate for weekends, holidays, etc.\n- All cleaning supplies provided by Nueratrend Maids and Pros.\n- Tips from most customers\n- Ongoing training (certificates for most training)\n- Recognition incentives (for job well done)\n- After 30 positive customer reviews, receive a handsome reward\n- Paid sick and vacation days.\n\nIf you are interested to apply, please fill out a cleaner application to become a full time professional cleaner with Nueratrend Maids and Pros. \n\nTo be considered, you:\n\nMust be able to speak and understand English\nCustomer friendly\nHigh School Diploma/GED required\nAbility to pass a background check and screening\nIf you are qualified and would like to be part of a growing cultural company, please do so by applying at: https://form.jotform.us/nueratrend/employment-application-form\n\n\n\n\n\n\n    ","title":"PROFESSIONAL  CLEANING TECHNICIANS NEEDED","url":"https://newyork.craigslist.org/brk/lab/d/professional-cleaning/6575405370.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\nAbout Sakara:\n Sakara Life is a rapidly growing organic meal delivery company headquartered in NYC, with kitchens in Brooklyn and Los Angeles. Our organic meal delivery program is based on the science behind a whole-food, plant-rich diet. Each meal is nutritionally designed to contain the optimal amount of plant-based protein, hydrating fresh produce and nutrient-dense superfoods to help balance, restore and heal the body, so our clients can look and feel their absolute best.  \n\nWe are currently seeking passionate, positive and hardworking team players to join our kitchen. We are a performance-based culture and reward hard work and exceptional results with competitive compensation and opportunities for growth. \n\nRequirements:\n•\tMust be at least 18 years old\n•\tMust be eligible to work in the U.S. \n•\tMust be able to work weekends, holiday and overtime as required\n•\tAt least 1 year of related experience preferred\n•\tComfortable working in a fast-paced warehouse and kitchen environment with strict deadlines\n•\tMust be able to stand and/or sit for extended periods of time, with or without reasonable accommodation\n•\tExposure to refrigerated or freezer space for extended periods of time\n•\tExcellent \"can-do\" attitude, strong work ethic, and great team spirit\n•\tMust be able to bend and lift up to 49 pounds \n•\tAbility to work in multiple roles throughout kitchen and warehouse\n•\tMust satisfactorily complete a background check upon conditional offer\n\nJob Functions:\n•\tAssembling, labeling, and packaging meals and customer packages in a cold pack room\n•\tCooking and food prep tasks including: cleaning, chopping, cooking vegetables and fruit, making sauces, baking, etc.\n•\tPortioning soups, sauces, dressings\n•\tPerforming daily kitchen/warehouse maintenance and cleaning tasks\n\nWhat you get:\n•\tCompetitive hourly wages\n•\tHealth and dental benefits\n•\tPaid sick leave and vacation\n•\tExcellent opportunity for advancement at a growing company\n\nSakara Life is an equal opportunity employer\n\nJob Type: Full-time\n\nSalary: $13.00 to $15.00 /hour\n\nPlease send along a copy of your resume for review. \n\n\n    ","title":"Production Associate/Prep Cook/Food Packer","url":"https://newyork.craigslist.org/brk/fbh/d/production-associate-prep/6575354200.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nAre you a successful salesperson who is confident in your skills and ability to close business clients? Are you a self-starter that enjoys working independently, but strive in a team environment? Are you a leader with a drive to succeed both professionally and financially?\nIf you answered yes to the above questions, we have an OPPORTUNITY for you!!!!\n\nWe are presently looking for Marketing Reps. for our NEWARK location to be responsible for scheduling qualified sales, driving company profitability and growth while helping to manage sales teams to inform and educate our clients about reducing their environmental impact by going green.\nGreen energy (sometimes called renewable or sustainable energy) comes from natural sources like wind, water, and sunlight. Because green energy can be produced with little pollution, it's far more environmentally-friendly than other types of energy, and it doesn't contribute to climate change or global warming like traditional energy sources. Plus, unlike fossil fuels such as coal and oil, green energy sources are renewable, meaning they replenish naturally and are in continuous supply.\n\nWe are looking for successful professionals who:\n- Have an entrepreneurial spirit and are coach-able \n- Can quickly absorb and retain product knowledge \n- Ability to manage deadlines and operate with a sense of urgency\n- Professional appearance \n- Excellent communication skills \n- Outgoing personality \n\nWhat's in it for you?\n- Full Paid Training \n- Competitive Base salary and uncapped earnings\n- Spend your time in a great culture and working environment \n- Great working hours \n- Immediate start available \n- Travel Opportunities\n- Driving Bonus (up to $600/mth)\n\nJob Description:\n- Enthusiastically represent the company its services\n- Work on highly competitive responses in a primary authorship role \n- Successfully translate complicated information for customers\n- Closing business in compliance with a weekly, monthly, and annual goal \n- Weighing risk and reward in qualifying and disqualifying opportunities in conjunction with Management\n- Actively participate in relevant conferences and trade associations \n- Assist with staff training\n\n\n If you think you meet the challenge, please hit the REPLY button and put the ad title in subject line or call us to see if you meet the requirements to set up an interview at @  347-252-4531 \"PLEASE COPY AND PASTE RESUME TO THE ADD\"    ","title":"YOU THINK YOU HAVE WHAT IT TAKES ? PROVE IT !!","url":"https://newyork.craigslist.org/mnh/mar/d/you-think-you-have-what-it/6573391020.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef JASON CASEY are looking for friendly, hard-working ICE CREAM SPECIALIST to join their team at MISTER DIPS. \n\n\nMISTER DIPS, a retrofitted 1974 Airstream serving burgers, fries and seasonal Dairy Dips, is the main attraction of Vale Park, The William Vale hotel's 20,000-square-foot public outdoor park overlooking Wythe Avenue in Williamsburg.\n\n\nIdeal Candidates: \n*Expect to work multiple stations: cook, cashier, runner. \n*Take food and drink orders, prepare ice cream and receive payment from customers. \n*Ensure quality and accuracy of products and dishes. \n*Have knowledge of cooking procedures, safety, and sanitation. \n*Maintain inventory and quality assurance of the truck. \n\n\nBenefits:\nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Educational Courses and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House,The Cannon Room, and Rye Street Tavern in Baltimore\n\n    ","title":"ICE CREAM SPECIALIST for MISTER DIPS (The William Vale)","url":"https://newyork.craigslist.org/brk/fbh/d/ice-cream-specialist-for/6573342283.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nThe front-of-house team is looking for gracious and friendly BUSSERS/RUNNERS & LEAD HOST to join them at BAR PRIMI , our Italian pasta shop on the border of NoHo and the East Village.\n\n\nIdeal candidates possess: \n*Well-versed in wine & spirits culture. \n*Warm and gracious service approach, and the ability to create stellar guest experiences. \n*Ability to assume full responsibility for menu content and deliver excellent service. Micros POS experience a plus. \n*The ability to function comfortably in busy environments.\n\n\nBenefits: We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n\n\n    ","title":"FOH TEAM MEMBERS for BAR PRIMI","url":"https://newyork.craigslist.org/mnh/fbh/d/foh-team-members-for-bar-primi/6573284442.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef ANDREW CARMELLINI and Chef Jason Casey's team is looking for hard-working, passionate PASTRY COOKS to join their team at LEUCA!\n\n\nLEUCA is a neighborhood restaurant serving Chef Andrew Carmellini's Southern Italian-inspired menu in the heart of Williamsburg at The William Vale. Leuca offers a menu of wood-fired coastal Italian dishes, and is open for breakfast, lunch and dinner.\n\n\nIdeal Candidates:\n*Have excellent baking skills.\n*Have experience on dessert stations in the kitchen.\n*Are able to lift 25 lbs or more.\n*Prepare and execute key components of dishes.\n*Are well versed in restaurant operations, food handling and safety.\n*Support their fellow cooks and contribute to leading a team in a busy atmosphere.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n    ","title":"PASTRY COOKS for LEUCA (Williamsburg)","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-for-leuca/6573164469.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Jason Casey are seeking OVERNIGHT BAKERS to join the back-of-house team of THE WILLIAM VALE.\n\n\nIdeal Candidates:\n*Have excellent baking skills with experience on dessert stations in the kitchen. \n*Are passionate about hospitality, pastry and baking. \n*Are able to lift 25 lbs or more. \n*Are able to prepare and execute key components of dishes. \n*Support their fellow cooks.\n*Overnight availability. \n\n\nBenefits: \n*Competitive wages\n*Medical, dental, and vision benefits (after 90 days of employment for full time employees)\n*401(k)\n*Paid Time Off\n*Employee Dining Discount\n*Additional Discounts: ZipCar, SkinSpa, Gym Membership, YogaWorks and more!\n*Transit Benefit Program\n*Continuing Education Classes  \n*Referral Reward Program and more!\n\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.\n    ","title":"OVERNIGHT BAKERS for THE WILLIAM VALE (Williamsburg)","url":"https://newyork.craigslist.org/brk/fbh/d/overnight-bakers-for-the/6573116029.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's front-of-house team is seeking HOSTS to join them at  LOCANDA VERDE, our neighborhood taverna serving Chef Andrew Carmellini's soul-satisfying urban Italian menu located in Robert DeNiro's TriBeCa hotel, The Greenwich.\n\n\nOur bustling corner restaurant has been welcoming New Yorkers morning, noon and night with a warm and comfortable atmosphere, leisurely Italian spirit and heartfelt cooking.\n\n\nIdeal candidates possess: \n*A warm and welcoming delivery while processing our valued reserved and walk-in guests. \n*Comfort in a fast-paced, downtown environment. \n*Excellent customer service skills in person and over the phone. \n*Flexible availability on nights and weekends.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n**NoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"HOSTS for LOCANDA VERDE","url":"https://newyork.craigslist.org/mnh/fbh/d/hosts-for-locanda-verde/6573085045.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDo you have a knack for well-crafted cocktails? Are you a maitre'd at heart that loves to create regulars? Do you find change and challenge exhilarating and do you like to solve problems? Do you enjoy dressing sharp but don't take yourself too seriously? Do you find great reward in managing a team? Are you extremely flexible and able to work autonomously? Do you have a work history that demonstrates your dependability and reliability?  \n\nBoqueria Restaurants is hiring a Lounge Service Manager for new rooftop lounge concept to open at the beginning of May! The ideal candidate must have solid experience managing a high-volume restaurant or bar. The Lounge Service Manager is to ensure that every guest has an amazing experience, that the bar team is motivated and cohesive, and that the bar meets or exceeds its financial targets. They will collaborate with our Beverage Director to deliver thoughtfully crafted cocktails, so extensive beverage knowledge is ideal. The Lounge Service Manager is responsible for building an extraordinary service team, ensuring they are well trained, consistently supported, and led by example throughout service.\n\nTo apply for this exciting opportunity, click link below to be considered.  Please no resumes with photos - unfortunately, they will not be considered.\n\nhttps://careers.hireology.com/boqueriarestaurants/169954/description\n\nWe are an equal opportunity employer. We do not base our employment decisions on an applicant's race, sex, sexual orientation, age, color, national origin, citizenship, disability, handicap, veteran status, or any other factor prohibited by local, state, or federal law.    ","title":"Growing Restaurant Group Seeks Rooftop Lounge Service Manager!","url":"https://newyork.craigslist.org/mnh/fbh/d/growing-restaurant-group/6573063129.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nOur pastry team at Bar Boulud is growing! We are looking for pastry cooks who are interested in learning and growing with us at Chef Daniel Boulud's Lyonnaise-inspired French bistro. Experience is not a necessity, but the desire and passion to serve quality pastry is.\n\nSkills & Requirements: \n•\tMust have schedule flexibility (including nights and weekends) \n•\tAbility to work as part of a team \n•\tPassion for both classic and contemporary approaches to Pastry \n•\tAbility to multi-task in a face-paced environment\n\nBenefits: \n•\tTeam-Oriented Environment that Cares About One Another \n•       Paid Time Off \n•\tEmployee Referral Reward Program \n•\tMedical, Dental and Vision Insurance \n•\t401 (k) with Company Match \n•\tEmployee Dining Discount\n\nif you would like to join the team, please send an updated resume to Chef Daniel Kleinhandler at DKleinhandler@danielnyc.com    ","title":"Pastry Cooks - Bar Boulud/Boulud Sud","url":"https://newyork.craigslist.org/mnh/fbh/d/pastry-cooks-bar-boulud/6572995616.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNOW HIRING School Crossing Guards for IMMEDIATE OPENINGS at schools in FREEPORT, NEW YORK!\n\nEarn $44.25 for 3 hours work TOTAL per day! MUST work an AM and PM shift each day. This is very important and rewarding PART-TIME employment protecting children as they walk to and from school. We work on school days only -- NO nights, NO weekends, NO holidays!\n\nRetirees and students (over 18 years old) welcomed!\n\n*FREE UNIFORMS* \n*EMPLOYEE REFERRAL REWARD OPPORTUNITIES* \n*DIRECT DEPOSIT*\n\nMINIMUM REQUIREMENTS:\nMust have reliable transportation. \nMust successfully complete Criminal Background Check. \nMust have availability to work a shift before school AND a shift after school.\n\nFind out more about opportunities in your area, and join our family!\n\nAPPLY HERE! http://acmssafety.com/employment    ","title":"SCHOOL CROSSING GUARDS - Part Time - FREEPORT, NY","url":"https://newyork.craigslist.org/lgi/lab/d/school-crossing-guards-part/6572715648.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nNOW HIRING School Crossing Guards for IMMEDIATE OPENINGS at schools in RYE, NY!\n\nEarn $54.00 for 2 hours work total per day! MUST work an AM and PM shift each day.This is very important and rewarding PART-TIME employment protecting children as they walk to and from school. We work on school days only -- NO nights, NO weekends, NO holidays!\n\nRetirees and students (over 18 years old) welcomed!\n\n*FREE UNIFORMS* \n*EMPLOYEE REFERRAL REWARD OPPORTUNITIES* \n*DIRECT DEPOSIT*\n\nMINIMUM REQUIREMENTS:\nMust have reliable transportation. \nMust successfully complete Criminal Background Check. \nMust have availability to work a shift before school AND a shift after school.\n\nFind out more about opportunities in your area, and join our family!\n\nAPPLY HERE! http://acmssafety.com/employment    ","title":"SCHOOL CROSSING GUARDS - Part Time - RYE, NY","url":"https://newyork.craigslist.org/wch/lab/d/school-crossing-guards-part/6572714787.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's front-of-house team is seeking SERVERS to join them at LOCANDA VERDE, our neighborhood taverna serving Chef Andrew Carmellini's soul-satisfying urban Italian menu located in Robert DeNiro's TriBeCa hotel, The Greenwich.\n\n\nOur bustling corner restaurant has been welcoming New Yorkers morning, noon and night with a warm and comfortable atmosphere, leisurely Italian spirit and heartfelt cooking.\n\n\nIdeal candidates possess: \n*Warmth and graciousness; The ability to function highly in a busy environment. \n*Full responsibility for food and beverage knowledge; Micros POS experience a plus. \n*Great communication skills. \n*Ability to manage a large and busy section in a popular restaurant. \n*Create stellar guest experiences. \n*Well-versed in and able to sell our list of wine and spirits.\n\n\nBenefits: \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\n**NoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"SERVERS for LOCANDA VERDE","url":"https://newyork.craigslist.org/mnh/fbh/d/servers-for-locanda-verde/6572173031.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nGreat $$, epic work perks, no nights or weekends, fun and vibrant young company!!\nYou will not find another hospitality job like this in NYC....so why haven't you applied already?\n\nTHE VENUE | M&G FOODSTUFF CATERING AND EVENTS\nM&G Foodstuff is not your regular catering company we are a young dynamic food company with a unique approach. \nWe create vibrant, seasonal and health centric food with ALWAYS a focus on quality! \nWe work with the top producers, photographers and fashion labels in NYC and we are looking to grow our team with other like-minded individuals.\n\nTHE ROLE:\nWe are looking for a passionate, full time Catering Driver who has had exposure to fast-paced high volume food businesses. \n\nYou will be involved in delivering to events, setting up, packing, liaising with clients and other production related tasks.\n\nAs Catering Driver at M&G Foodstuff you;\n- Must be able to work well under pressure and can work autonomously;\n- Have a NYS drivers license;\n- Have a passion for food and the hospitality industry;\n- Are ALWAYS punctual with NO exceptions;\n- Can follow instruction and carry out your daily tasks efficiently and cleanly;\n- Can communicate professionally with people and have great relationship building skills and also problem solving skills;\n- Maintain consistent quality of work.\n\nOn Offer:\n- Great Hourly rate plus company benefits;\n- 2 consecutive days off;\n- Great hours, No nights or weekends\n- Ongoing training and development;\n\nWhat we expect from you:\n- Be you, be UNIQUE\n- Deliver EXCEPTIONAL food with quality LIKE NO OTHER\n- MAKE a DIFFERENCE\n- RESPECT everyone\n- Celebrate the WINS\n- ENJOY every day\n\nThe Reward: \nPlenty of work, great pay, on-the-job training, career opportunities when you realize you don't ever want to leave. \n\nIt's a New Year! Stop thinking and start applying!\n    ","title":"CATERING DRIVER| M&G Foodstuff Catering and Events | IMMEDIATE START!!","url":"https://newyork.craigslist.org/mnh/fbh/d/catering-driver-mg-foodstuff/6572155370.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini and Chef Anthony Ricco's team are seeking RECEIVERS  to join them at THE WILLIAM VALE , a luxury boutique hotel in the heart of Brooklyn's most desired neighborhood, Williamsburg.\n\n\nThe William Vale features an all-day restaurant on the ground floor, a rooftop cocktail bar boasting panoramic views of Manhattan, Brooklyn and Queens, as well as a multi-faceted banquet and catering department.\n\n\nIdeal candidates possess:  \n*Strong product knowledge. \n*Basic understanding of purchasing. \n*Basic understanding of kitchen inventory. \n*Must be able to lift up to 50 pounds. \n*Ability to receive and organize all of the products that enter the restaurant. \n*Positive attitude and strong work ethic. \n*Great communication skills with management.\n*Food Protection Certificate Holder.\n\n\nBenefits:  \nWe offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"RECEIVERS for THE WILLIAM VALE","url":"https://newyork.craigslist.org/brk/fbh/d/receivers-for-the-william-vale/6572031518.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWe are now looking to fulfill immediately:\n\n(Please indicate what position you are applying for).   This job is in Norwalk, CT.\n\nHead Servers/Bartender:\n\nMost know about wine and drinks preferred full time or part time to be part of our team; Responsible for FOH: staff, schedule, recruiting, training and supervising.\nPlease have at least two years experience in fine dining restaurant.\n\nOur optimum candidate needs:\n\n- A minimum of 3 years mixed casual/fine dining in well-respected restaurants\n-Warm, friendly and confident with a smile.\n-Willingness to be coached, and a strong desire to be part of a team.\n\n\n\nSalad/Pantry station:\n\nPreparing salads, cheese plates and other cold appetizers, including desserts.\nPlease have at least two years experience in fine dining restaurant.\n\nSalary hourly. TBD - full time/part time\n\nBasso Cafe Restaurant, Mediterranean fusion cuisine in Norwalk, Ct. Rated \"very good\" restaurant in New York Times and #1 Mediterranean cuisine in Norwalk, CT by Zagat.\nYou must be passionate about guest service, good communication skills a must, reliable, motivated, friendly, enthusiastic, a team player and professional hard working with (experienced minimum 2 years in fine dining restaurant preferably).\n\nBASSO CAFE's Restaurant associates work in an environment that demands exceptional performance yet reaps great rewards. Whether it's a career opportunity, job enrichment or a supportive work environment, if you are ready for our challenge, then we are ready for you.\n\nIf you would like to become part of our fine Restaurant and share in the experience of realizing our vision of being recognized by our customers as the best in our business please email your resume in doc file or pdf or drop your resume:\n\nTo: Basso Cafe Restaurant\n124 new Canaan Ave,\nNorwalk, CT 06850\n\nThis Job is in Norwalk, CT.\n\nwww. Bassobistrocafe.com    ","title":"Server/Bartender - Salad/Pantry Chef - Dishwashers.","url":"https://newyork.craigslist.org/fct/fbh/d/server-bartender-salad-pantry/6591991841.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nChef Andrew Carmellini's team is looking for friendly, hard-working TOURNANTS that are eager to learn in an energetic downtown environment.\n\n\nLAFAYETTE  is an everyday grand café and bakery in ceremony of French cooking at the corner of Lafayette Street and Great Jones Street in downtown Manhattan.\n\n\nIdeal Candidates:  \n*Have excellent knife skills \n*Have knowledge of cooking procedures, safety and sanitation \n*Have experience on multiple stations in the kitchen \n*Are able to lift 25 lbs or more \n*Prepare and execute key components of dishes \n*Ensure quality and accuracy of products and dishes \n*Support their fellow cooks\n\n\nBenefits:  We offer medical, dental, and vision benefits after 90 days of employment for full time employees, as well as a 401(k), Paid Time Off, Employee Dining Discount, Zip Car Discount, Spa Discount, TransitChek, Corporate Fitness Program, Continuing Education Classes and Referral Reward Program.\n\n\nNoHo Hospitality Group owns and operates some of the country's most talked about and beloved restaurants helmed by James Beard award-winning chef Andrew Carmellini and partners Josh Pickard and Luke Ostrom. Properties include: Locanda Verde, The Dutch, Joe's Pub, The Library at The Public, Lafayette, Bar Primi, Little Park, Evening Bar, Westlight, Mister Dips, and Leuca all located in New York City, as well as The Dutch in Miami Beach and Rec Pier Chop House and The Cannon Room in Baltimore.    ","title":"TOURNANT for LAFAYETTE","url":"https://newyork.craigslist.org/mnh/fbh/d/tournant-for-lafayette/6571385598.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nDo you have a knack for well-crafted cocktails? Are you a maitre'd at heart that loves to create regulars? Do you find change and challenge exhilarating and do you like to solve problems? Do you enjoy dressing sharp but don't take yourself too seriously? Do you find great reward in managing a team? Are you extremely flexible and able to work autonomously? Do you have a work history that demonstrates your dependability and reliability?  \n\nBoqueria Restaurants is hiring a Lounge Service Manager for new rooftop lounge concept to open this spring! The ideal candidate must have solid experience managing a high-volume restaurant or bar. The Lounge Service Manager is to ensure that every guest has an amazing experience, that the bar team is motivated and cohesive, and that the bar meets or exceeds its financial targets. They will collaborate with our Beverage Director to deliver thoughtfully crafted cocktails, so extensive beverage knowledge is ideal. The Lounge Service Manager is responsible for building an extraordinary service team, ensuring they are well trained, consistently supported, and led by example throughout service.\n\nTo apply for this exciting opportunity, click link below to be considered.  Please no resumes with photos - unfortunately, they will not be considered.\n\nhttps://careers.hireology.com/boqueriarestaurants/169954/description\n\nWe are an equal opportunity employer. We do not base our employment decisions on an applicant's race, sex, sexual orientation, age, color, national origin, citizenship, disability, handicap, veteran status, or any other factor prohibited by local, state, or federal law.    ","title":"Boqueria Restaurants Seeks Rooftop Lounge Service Manager!","url":"https://newyork.craigslist.org/mnh/fbh/d/boqueria-restaurants-seeks/6571374528.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \n\n\nRoomTurn is a home cleaning service in Manhattan & Brooklyn. We are looking for professional cleaners immediately! in the Manhattan & Brooklyn area.\n\nWhy work for RoomTurn?\n\n*Guaranteed work everyday.\n*We support young families.\n*Work in a fun team, 'many hands makes light work'.\n*No set hours, when the work is done we go home.\n*Make great tips.\n*Potential for future career growth, become a manager and change your life.\n*Onsite training to improve your career.\n*Work in different locations each day\n\n\nWhat we are looking for?\n\nWe're looking for high quality individuals who:\n\n*Have at least 2 years cleaning experience\n*A quality iPhone or latest model android\n*Must be prepared with your own portable cleaning kit\n*Must provide your own unlimited metrocard\n*Must be competent in Google Maps and be able to navigate Manhattan & Brooklyn\n*Enjoy working in a fast moving energetic team environment.\n*Enjoy the rewards of a job well done. \n\n\nWe are excited to meet you. Come & join our family. We would love to have you. We are the only housekeeping company you need to think about.\nTo Apply! Email your resume to delon@roomturn.com\n\n    ","title":"Professional House Cleaners in NYC - Upto $1000 per week plus tips","url":"https://newyork.craigslist.org/mnh/lab/d/professional-house-cleaners/6591678607.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nWould an extra $100-$1,000/month or even a six figure income enhance your life? You pick the intensity and the option (not requirement) of team building.\n \nHigh Reward/Low Risk & no professional license needed!\n\nVirtually recession proof RESIDUAL income, high overall retention. You're in control, but you are not by yourself...direct line to a well experienced coach with current in-the-field experience, many different ways to prospect. This is TVizion Streaming Service...TVizion pays! (Legally compliant streaming source) As of Thursday May 17th 2018 we only have 2 distributorships remaining. This is an EASY sell! AffordablePlan.org\n\nThis is our 4th successful RESIDUAL type of income (including insurance and real estate), we know what works and what doesn't. Success in RESIDUAL income is not a secret...we're here to help!\n\nPete Xavier  \n\nJasmine G-Insurance Broker to the Stars (a VERY good RESIDUAL business as well)\n\nText Pete Xavier or Jasmine G at: 714-459-2017 to receive the no obligation/no pressure full details. Please text your name and email address and than expect contact (by text before call) within 24 hours. \n\nSales and entrepreneurial experience is a plus, but not necessary. Scalable to your efforts. This is a 1099 based position.\n\nTEAM TOTAL ROI of TOTAL ROI LLC (Nationwide)\n    ","title":"6-Figure Residuals is Acheivable!","url":"https://newyork.craigslist.org/lgi/sls/d/6-figure-residuals-is/6571179519.html"},{"body":"\n        \n            QR Code Link to This Post\n            \n        \nCLIENT GROWTH SPECIALIST\n\nDue to rapid growth and increased demand, we are looking to hire a Client Growth Specialist onto our team who enjoys speaking with people and has a talent for presenting our company's products and services.  As a Client Growth Specialist, you will have opportunities for ongoing development in the company and a great team supporting you in the sales processes. You will receive training on our products and their content, packaging, and pricing to convey to your clients. The more you sell, the greater your rewards will be. The ideal candidate will have a great work ethic, sales experience, and a desire to win. This exciting position will maximize your sales skills and provide substantial financial rewards.\n\nWe offer a competitive base salary, as well as commission and bonuses on a weekly basis.\n\nJob Description and Requirements:\n•\tBuilding relationships with executives and professionals\n•\tAssisting members in gathering new and updated biographical information for our database of 1.5 million people\n•\tOffer products and services to executives and professionals online to increase their credibility and visibility \n•\tNo Cold Calling - Only calling new applicants or existing customers\n•\tYou will receive a huge client base to call\n•\tProfessional verbal communication skills\n•\tMinimum of 3 years of proven track record of successful consumer sales is preferred \n•\tStrong independent drive, negotiation and problem-solving skills\n•\tAbility to research, retain and build relationships with clients. \n•\tConverse with business professionals on any level.\n•\tTime management and organizational skills\n\nCompensation:\n•\tAnnual base salary $45,000\n•\tLucrative commissions along with daily, weekly & monthly bonuses and incentives for hitting certain targets\n•\tAverage Client Growth Specialist is making between $75,000- $100,000\n•\tMedical benefits including dental, visions and 401k\n•\tPersonal paid time off; vacation days, sick days\n•\tOffice is closed for all major holidays\n•\t9:00am-5:30pm working hours M-Thursday and 9:00am-4:30pm Fridays with a one hour lunch\n \n\nSince 1898, Marquis Who's Who has remained the standard for reliable and comprehensive biographical data. Our first publication was released 118 years ago: Who's Who in America. Our database is in every public library and university in the United States.\nMarquis Who's Who publications presents unmatched coverage of the lives of today's leaders and achievers from both the United States and around the world, from every significant field of endeavor. Engineers, Accountants, Lawyers, Politicians, Healthcare Leaders, students, researchers, corporate executives, journalists, personnel recruiters, and many others rely on Marquis Who's Who every day for in-depth biographical information they can use with confidence.\nOver the course of decades, the needs of our patrons have evolved; we have strived to develop new and more convenient ways of providing access to our biographical data while maintaining its quality. While we continue the time-honored tradition of publishing our print publications, we are excited to introduce Marquis Biographies Online, a powerful, web product that offers real-time access to our database of over one million biographies! Once they have converted on line from print, other products are available for our members. Some are: Websites creations, Press Releases (that we optimize to major search engines,) magazine spreads, Legacy Family /Career Videos, Private newsletters, Humanitarian awards, and many more.  Our in house Editorial Staff creates these products under strict deadlines.  \nFor over 118 years Marquis Who's Who has opened doors and enabled professionals to reach their career goals, by highlighting their achievements through personalized online and print branding and marketing tools and resources\n    ","title":"Client Growth Specialist","url":"https://newyork.craigslist.org/lgi/sls/d/client-growth-specialist/6591556496.html"}]